window.SuttaDatabase = window.SuttaDatabase || {};

window.SuttaDatabase["01_kitaka_kiccha"] = [
    {
        "sutta_number": 545,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "545. භාවකම්මෙසු තබ්බානීයා.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **භාවකම්මෙසු** ය, **තබ්බානීයා** ය යනු පදයි. **භාවකම්මෙසු**, භාව කර්ම දෙක්හි; (ධාතුයා පරා) (සියලු ධාතූන් කෙරෙන් පරව;) **තබ්බානීයා පච්චයා**, තබ්බ අනීය යන මේ ප්‍රත්‍යයෝ වෙත්.)",
        "sutta_type": "ප්‍රත්‍යය විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "භාවකම්මඉච්චෙතෙස්වත්ථෙසු සබ්බධාතූහි තබ්බ අනීයඉච්චෙතෙ පච්චයා පරා හොන්ති. යොගවිභාගෙන අඤ්ඤත්ථාපි. තත්ථ – අකම්මකෙහි ධාතූහි, භාවෙ කිච්චා භවන්ති තෙ; සකම්මකෙහි කම්මත්ථෙ, අරහසක්කත්ථදීපකා.",
        "vutti_sanna": "ද්විපදයි. **අඤ්ඤත්ථාපි**, කර්තෘ කරණාදියෙහිදු තබ්බ අනීය ප්‍රත්‍යයෝ වෙත්; **තත්ථ**, ඒ තබ්බ අනීයාදි ප්‍රත්‍යයන්ගේ විධානයෙහි මෙසේ නියම ගාථා වන්නීයයි සේයි. **අරහසක්කත්ථදීපකා**, සුදුසුය පොහොසත් යන මේ අර්ථයන් ප්‍රකාශ කරන්නා වූ; **තෙ කිච්චා**, ඒ කිච්ච ප්‍රත්‍යයෝ; **අකම්මකෙහි ධාතූහි**, අකර්මක ධාතූන් කෙරෙන් පරව; **භාවෙ**, භාවයෙහි; **භවන්ති**, වෙත්; **අරහසක්කත්ථදීපකා තෙ කිච්චා සකම්මකෙහි ධාතූහි කම්මත්ථෙ භවන්ති**.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "542"
    },
    {
        "sutta_number": 546,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "546. ණාදයො තෙකාලිකා.",
        "sutta_meaning": "(යනු පරිභාෂා සූත්‍රයි. - **ණාදයො** ය, **තෙකාලිකා** ය යනු පදයි. **ණාදයො**, ණ ප්‍රත්‍යයාදීහු; **තෙකාලිකා**, තුන්කල් ඇත්තාහ.)",
        "sutta_type": "පරිභාෂා සූත්‍රය",
        "anuvattana": "ක්වචි",
        "vutti": "තිකාලෙ නියුත්තා තෙකාලිකා, යෙ ඉධ තතියෙ ධාත්වාධිකාරෙ විහිතා අනිද්දිට්ඨකාලා ණාදයො පච්චයා, තෙ තෙකාලිකා හොන්තීති පරිභාසතො කාලත්තයෙපි හොන්ති.",
        "vutti_sanna": "ද්විපදයි. **තිකාලෙ යුත්තා**, අතීතාදි කාලත්‍රයෙන් යුක්ත වූවාහු; **තෙකාලිකා**, කාලත්‍රයෙන් යුක්ත වූවාහු නම් වෙත්; ණාදි ප්‍රත්‍ය යෝයි; **ඉධ තතියෙ ධාත්වධිකාරෙ**, මෙතුන් වන “ධාතුයා කම්මාදිම්හි ණො” යනාදීන් තුන්වන ධාතූන්ගෙන් වන ධාතු* අධිකාරයෙහි ධාතූන්ගේ තුන්වන මේ සම්බන්ධයෙහි; **අනිද්දිට්ඨකාලා**, නොකියනලද කල් ඇති; **යෙ ණාදයො පච්චයා**, යම් ණාදි ප්‍රත්‍යයකෙනෙක්; **විහිතා**, හදාරන ලදහුද; **තෙ**, ඒ ණාදි ප්‍රත්‍යයෝ; **තෙකාලිකා හොන්ති**, කාලත්‍රයෙහි නියුක්ත වූවාහුම යන; **පරිභාසතො**, පරිභාෂාහෙයින් කී හෙයින්; **තෙ කාලත්තයෙපි හොන්ති**, ඒ ණාදි ප්‍රත්‍යයෝ කාලත්‍රයෙහිදු වෙත්",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "552"
    },
    {
        "sutta_number": 547,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "547. යථාගමමිකාරො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **යථා** ය, **ආගමං** ය, **ඉකාරො** ය යනු පදයි. **යථා**, යම් යම් පරිද්දෙකින්; **ආගමං**, පාලි පදනිෂ්පත්තිය වේද; (එපරිද්දෙන්) නොහොත්, **යථාගමං**, ආගම වූ පරිද්දෙන්; **ඉකාරො**, (සියලු ධාතූන් කෙරෙන් සියලු ප්‍රත්‍යයන් පරකල්හි) ඉකාරාගම වේ.)",
        "sutta_type": "ආගම විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "යථාගමං යථාපයොගං ජිනවචනානුපරොධෙන ධාතූහි පරො ඉකාරාගමො හොති ක්වචි බ්‍යඤ්ජනාදිකෙසු කිච්චකිතකප්පච්චයෙසු, ‘‘අඤ්ඤෙසු චා’’ති වුද්ධි, ‘‘ඔ අව සරෙ’’ති අවාදෙසො, ‘‘නයෙ පරං යුත්තෙ’’ති පරං නෙතබ්බං.",
        "vutti_sanna": "ද්විපදයි. **බ්‍යඤ්ජනාදිකෙසු**, බ්‍යඤ්ජනයන් ආදි කොට ඇති කිච්චාදි ප්‍රත්‍යයන් පර කල්හි; **යථාගමං**, සේ; **යථාපයොගං**, සේයි; **ජිනවචනානුරොධෙන**, ජිනවචනයට අවිරුද්ධ පරිද්දෙන්; ආගමං යථා යන අර්ථයෙහි අව්‍යය සමාස කොට නාහට අංව යථාගමං යනු වී; **යථාපයොගං**, යනුදු එසේමැයි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "607"
    },
    {
        "sutta_number": 548,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "548. තෙ කිච්චා.",
        "sutta_meaning": "(යනු සංඥා සූත්‍රයි - **තෙ** ය, **කිච්චා** ය යනු පදයි. **තෙ,** ඒ තබ්බාදි ප්‍රත්‍යයයෝ; **කිච්චා**, කිච්ච සංඥා ඇත්තෝ වෙත්.)",
        "sutta_type": "සංඥා සූත්‍රය",
        "anuvattana": "",
        "vutti": "යෙ ඉධ වුත්තා තබ්බානීයණ්‍ය තෙය්‍ය රිච්චප්පච්චයා, තෙ කිච්චසඤ්ඤා හොන්තීති වෙදිතබ්බා. තතො ‘‘අඤ්ඤෙ කිති’’ති වචනතො කිච්චප්පච්චයානමකිතකත්තා නාමබ්‍යපදෙසෙ අසම්පත්තෙ ‘‘තද්ධිතසමාසකිතකා නාමංවාතවෙතුනාදීසු චා’’ති එත්ථ චග්ගහණෙන නාමබ්‍යපදෙසො, තතො ස්‍යාද්‍යුප්පත්ති. භාවෙ භාවස්සෙකත්තා එකවචනමෙව, ‘‘සි’’න්ති අමාදෙසො. භවිතබ්බං භවතා පඤ්ඤෙන, භවනීයං.",
        "vutti_sanna": "ද්විපදයි. **ඉධ**, මේ ප්‍රස්තායෙහි තබ්බාදි ප්‍රත්‍යයන් කී තන්හි; **යෙ**, යම් තබ්බ අනීය ණ්‍ය රිච්ච යන ප්‍රත්‍යයෝ; **වුත්තා**, කියන ලද හුද; **තෙ**, ඒ ප්‍රත්‍යයෝ කිච්ච නම් වෙති යි කියා දත යුත්තාහුයි; **තතො**, කිච්චසඤ්ඤා කළ ඉක්බිත්තෙන්; **අඤ්ඤෙ කිතිතිවචනතො**, අඤ්ඤ‍ෙ කිත් යයි කී හෙයින් ' අඤ්ඤෙ කිත් ' යන සූත්‍රයෙන් කිච්ච ප්‍රත්‍යයන්ගේ කිතක බව නැති හෙයින් කිච්ච ප්‍රත්‍යයන් කිතක නොවන හෙයින් තද්ධිතාදි සූත්‍රයෙන් නම්වත් අසම්ප්‍රාප්ත කල්හි කිච්ච ප්‍රත්‍යයන්ට තද්ධිතාදි සූත්‍රයේ චග්‍රහණයෙන් නම්වත් වෙත්; **තතො**, නම්වත් කළ ඉක්බිත්තෙන්; **භාවෙ**, භාවයෙහි උදාහරණ කියනු ලැබේ. ආදි කොට ප්‍රත්‍යයන් භාව කර්ම දෙක්හිවන බව සාමාන්‍ය හෙයින් දක්වා පසුව භාවයෙහි ප්‍රත්‍යයන් කරනු පිණිස භාවෙයි කියා උල්ලිංග කොළෝ; **භාවස්සෙකත්තා**, භාවයාතමා එකත්ව හෙයින් භාවයාගේ උදකලා බව ඇති හෙයින්; **එකවචනමෙව**, භාවයා කෙරෙන් පරව එක වචනම වේ; **භවනීයං**, යන;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "භවිතබ්බ",
                "steps": [
                    {
                        "formula": "භවතා පඤ්ඤෙන (භවිතබ්බං / භවනීයං)",
                        "rule": ""
                    },
                    {
                        "formula": "(තතියා) (තතියා)",
                        "rule": ""
                    },
                    {
                        "formula": "භූයතෙ, අභවිත්ථ, භවිස්සතෙ",
                        "rule": ""
                    },
                    {
                        "formula": "භූ+තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "භ්-ඌ→ඔ→අව + (ඉ) + තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "භවිතබ්බ",
                        "rule": ""
                    }
                ],
                "final_result": "භවිතබ්බ"
            },
            {
                "word": "භවිතබ්බං",
                "steps": [
                    {
                        "formula": "භවිතබ්බ + සි → අං",
                        "rule": ""
                    },
                    {
                        "formula": "භවිතබ්බං",
                        "rule": ""
                    }
                ],
                "final_result": "භවිතබ්බං"
            },
            {
                "word": "භවනීය",
                "steps": [
                    {
                        "formula": "තුම්හෙහි පඤ්ඤෙහි භවිතබ්බං",
                        "rule": ""
                    },
                    {
                        "formula": "භූයතෙ, අභවිත්ථ, භවිස්සතෙ",
                        "rule": ""
                    },
                    {
                        "formula": "භූ+අනීය",
                        "rule": ""
                    },
                    {
                        "formula": "භ්-ඌ→ඔ→අව + අනීය",
                        "rule": ""
                    },
                    {
                        "formula": "භවනීය",
                        "rule": ""
                    }
                ],
                "final_result": "භවනීය"
            },
            {
                "word": "සයනීය",
                "steps": [
                    {
                        "formula": "පණ්ඩිතෙන",
                        "rule": "කොධො = අභිභවිතබ්බො = අභිභූයතෙ .."
                    },
                    {
                        "formula": "(අනු. කර්තෘ) (උක්ත.කර්ම) (කර්මකාරක කිතකය)",
                        "rule": ""
                    },
                    {
                        "formula": "()",
                        "rule": ""
                    },
                    {
                        "formula": "පණ්ඩිතො කොධං අභිභවති (කර්තෘකාරක)",
                        "rule": ""
                    },
                    {
                        "formula": "පණ්ඩිතෙන කොධො අභිභූයතෙ (කර්මකාරක)",
                        "rule": ""
                    },
                    {
                        "formula": "පණ්ඩිතෙන කොධො අභිභවිතබ්බො (හොති)",
                        "rule": ""
                    },
                    {
                        "formula": "සී+අනීය",
                        "rule": ""
                    },
                    {
                        "formula": "ස්-ඊ→එ→අය+අනීය",
                        "rule": ""
                    },
                    {
                        "formula": "සයනීය",
                        "rule": ""
                    }
                ],
                "final_result": "සයනීය"
            },
            {
                "word": "පටිපජ්ජිතබ්බ",
                "steps": [
                    {
                        "formula": "බුද්ධෙන පරො අතිසයිතබ්බො",
                        "rule": ""
                    },
                    {
                        "formula": "(අසෙඛෙන / ඛීණාසවෙන / අරහතා) දොසො (අභිභවිතබ්බො / අතිසයිතබ්බො)",
                        "rule": ""
                    },
                    {
                        "formula": "පටි+පද+ය+තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "පටි+ප (ද්+ය) → ජ් → ජ්ජ්+ (ඉ)+ තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "පටි+පජ්ජ්+(ඉ)+තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "පටිපජ්ජිතබ්බ",
                        "rule": ""
                    }
                ],
                "final_result": "පටිපජ්ජිතබ්බ"
            }
        ],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "547"
    },
    {
        "sutta_number": 549,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "549. තුං තුන තබ්බෙසු වා.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **තුංතූනතබ්බෙසු** ය, **වා** ය යනු පදයි. **තුං තුන තබ්බෙසු**, තුංප්‍රත්‍යය, තුන ප්‍රත්‍යය, තබ්බ ප්‍රත්‍යය, යන මොවුන් පරකල්හි; **කරස්ස**, කර ධාතුහුගේ; **අන්තස්ස**, අන්ත වූ රකාරයට; **වා**, විකල්පයෙන්; **තත්තං**, තකාර බව වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "කරඉච්චෙතස්ස ධාතුස්ස අන්තභූතස්ස රකාරස්ස තකාරත්තං හොති වා තුං තුන තබ්බඉච්චෙතෙසු පච්චයෙසු පරෙසු. කත්තබ්බො භවතා ධම්මො, කත්තබ්බා පූජා, කත්තබ්බං කුසලං, තත්තාභාවෙ ‘‘කරොතිස්සා’’ති වත්තමානෙ ‘‘තවෙතුනාදීසු කා’’ති එත්ථ ආදිසද්දෙන තබ්බෙපි කාදෙසො, කාතබ්බං හිතං.",
        "vutti_sanna": "ද්විපදයි. **අන්තභූතස්ස**, ධාතුහුගේ අන්ත වූ රකාරයාට; **තකාරත්තං හොති**, තකාරදෙශ වේ; නොවූ තන්හි; **එත්ථාදිසද්දෙන**, “තවෙතූනාදිසු කා”යන මේ සූත්‍රයෙහි ආදි ශබ්දයෙන්; **තබ්බෙපි**, තබ්බ ප්‍රත්‍යයාපර කල්හිදු; **කා දෙසො**, කරයන ධාතු හට කා යන ආදෙශ වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "622"
    },
    {
        "sutta_number": 550,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "550. රහාදිතො ණ.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **රහාදිතො** ය, ණ **ය** යනු පදයි. **රහාදිතො**, රකාර හකාරාදීන් අන්ත කොට ඇති ධාතුන් කෙරෙන් පර වූ; (අනාදෙශාදීන්ගේ දන්තඃනකාරය;) **ණ**, මූර්ධන්‍ය ණකාරය වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "රකාර හකාරාද්‍යන්තෙහි ධාතූහි පරස්ස අනානීයාදිනකාරස්ස ණකාරො හොති. ආදිසද්දෙන රමු අපඤාතාදිතොපි.",
        "vutti_sanna": "ත්‍රිපදයි. **රකාරහකාරද්‍යන්තෙහි ධාතූහි**, රකාරහකාර යන මේ අදීන් අන්ත කොට ඇති ධාතූන් කෙරෙන්; **පරස්ස**, පර වූ; **අනානීයාදිනකාරස්ස**, අන අනීය යන මේ ආදීන්ගේ නකාරය හට; √**රමු** කීළායං √**අප** පාපුණනෙ √**ඤා** අවබොධනෙ යන මේ ආදීන් කෙරෙන් පර වූ නකාරයාටද ණකාර වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "කරණ",
                "steps": [
                    {
                        "formula": "කර+අන",
                        "rule": ""
                    },
                    {
                        "formula": "කර+අ න→ණ",
                        "rule": ""
                    },
                    {
                        "formula": "කරණ",
                        "rule": ""
                    }
                ],
                "final_result": "කරණ"
            },
            {
                "word": "කරණීය",
                "steps": [
                    {
                        "formula": "කර+අනීය",
                        "rule": ""
                    },
                    {
                        "formula": "කර+අ නී→ණී ය",
                        "rule": ""
                    },
                    {
                        "formula": "කරණීය",
                        "rule": ""
                    }
                ],
                "final_result": "කරණීය"
            },
            {
                "word": "සඞ්ගණ්හිතබ්බො",
                "steps": [
                    {
                        "formula": "සං+ගහ+ණ්හා+(ඉ)+තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "සඞ්ගණ්හිතබ්බො",
                        "rule": ""
                    }
                ],
                "final_result": "සඞ්ගණ්හිතබ්බො"
            },
            {
                "word": "පත්තබ්බ",
                "steps": [
                    {
                        "formula": "ප+අප+තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "ප+අප+තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "ප්-අ+අ+තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "ප්- +අ+ත>ත්ත බ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "පත්තබ්බ",
                        "rule": ""
                    }
                ],
                "final_result": "පත්තබ්බ"
            }
        ],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "551"
    },
    {
        "sutta_number": 551,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "551. ගම ඛන හනාදීනං තුංතබ්බාදීසු න.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ගඛනහනාදීනං** ය, **තුංතබ්බාදිසු** ය, **න** ය යනු පදයි. **ගමඛනහනාදීනං**, ගමු ඛනු හන යන මේ ආදි ධාතූන්ගේ අන්තයට; **තුං** **තබ්බාදිසු**, තුං තබ්බාදිප්‍රත්‍යයන් පරකල්හි; **වා**, විකල්පයෙන්; **න**, නකාරදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "භාවකම්මෙසු",
        "vutti": "ගම ඛන හනඉච්චෙවමාදීනං මකාර නකාරන්තානං ධාතූනමන්තස්ස නකාරො හොති වා තුං තබ්බ තවෙ තුන ත්වාන ත්වාඉච්චෙවමාදීසු තකාරාදිප්පච්චයෙසු පරෙසු. අගච්ඡීයිත්ථ, ගච්ඡීයති, ගච්ඡීයිස්සතීති ගන්තබ්බො මග්ගො, ගමිතබ්බං, ගමනීයං. ඛනු අවදාරණෙ, අඛඤ්ඤිත්ථ, ඛඤ්ඤති, ඛඤ්ඤිස්සතීති ඛන්තබ්බං ආවාටං, ඛනිතබ්බං, ‘‘ක්වචි ධාතූ’’තිආදිනා ඛනන්තස්ස ණත්තඤ්ච, ඛණිතබ්බං, ඛණණීයං, ඛනනීයං වා. හන හිංසා ගතීසු, අහඤ්ඤිත්ථ, හඤ්ඤතෙ, හඤ්ඤිස්සතෙති හන්තබ්බං, හනිතබ්බං, හනනීයං. මන ඤාණෙ, අමඤ්ඤිත්ථ, මඤ්ඤතෙ, මඤ්ඤිස්සතෙති මන්තබ්බො, මනිතබ්බො, යප්පච්චයෙ චවග්ගාදි, මඤ්ඤිතබ්බං, මඤ්ඤනීයං.",
        "vutti_sanna": "ත්‍රිපදයි. √**ඛනු** යනු; **අවදාරණෙ**, පැලීමෙහි වැටේ; ඛන යනාදි යෙහි නකාරයාට නකාර කිරීමෙහි ප්‍රයොජන “ගමඛනහනරමාදීනමන්තො” යන සුතුරෙන් ලොප්වළකන පිණිසයි; **යප්පච්චයෙ**, “දිවාදිතො යො” යන යොගයෙන් ය ප්‍රත්‍යයා කළ කල්හි “යවතමාදි” සූත්‍රයෙන් තවර්ග නකාරයාට චවර්ගඤකාරයෙක් වේ; ද්විත්ත ද වේ;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "නහානීය",
                "steps": [
                    {
                        "formula": "උපජීවන්තාති උපනිස්සාය ජීවන්තාපි එතෙ එත්තකා ජනා ගරුචිත්තෙන මඤ්ඤිතබ්බං න මඤ්ඤන්ති. (ජා.අ.)",
                        "rule": ""
                    },
                    {
                        "formula": "පූජ+ණය+(ඉ)+ තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "පූජ+ණ්-අය+(ඉ)+ තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "මනුස්සා එතෙන නහායති = නහ+අනීය = නහානීය",
                        "rule": ""
                    }
                ],
                "final_result": "නහානීය"
            }
        ],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "598"
    },
    {
        "sutta_number": 552,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "552. ණ්‍යො ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ණ්‍යො** ය, **ච** ය යනු පදයි. **භාව කම්මෙසු**, (සියලු ධාතුන් කෙරෙන් පරව) භාවකර්මදෙක්හි; **ණ්‍යො ච**, ණ්‍ය ප්‍රත්‍යයද වේ.)",
        "sutta_type": "ප්‍රත්‍යය විධි සූත්‍රය",
        "anuvattana": "වා",
        "vutti": "භාවකම්මෙසු සබ්බධාතූහි ණ්‍යප්පච්චයො හොති, චග්ගහණෙන ‘‘ඤාතෙය්‍ය’’න්තිආදීසු තෙය්‍යප්පච්චයො ච.",
        "vutti_sanna": "ද්විපදයි. **ඤාතය්‍යන්ති ආදිසු**, ඤාතය්‍යං යන මේ ආදියෙහි තය්‍ය ප්‍රත්‍යය වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "543"
    },
    {
        "sutta_number": 553,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "553. කාරිතං විය ණානුබන්ධො.",
        "sutta_meaning": "(යනු අතිදේශ සූත්‍රයි. - **කාරිතං** ය, **විය** ය, **ණානුබන්ධො** ය, යනු පදයි. **ණානුබන්ධො**, ණකාරානුබන්ධ ප්‍රත්‍යය තෙම; හෙවත් ලොප් ලබන්නා වූ ණකාරය ඇති ප්‍රත්‍යය තෙම; **කාරිතං** **විය**, කාරිත ප්‍රත්‍යය මෙන්; **වා,** විකල්පයෙන් දැක්ක යුතුයි.)",
        "sutta_type": "විධි සූත්‍රය (අතිදේශ)",
        "anuvattana": "",
        "vutti": "අනුබන්ධො අප්පයොගී, (න+පයොගී) ණකාරානුබන්ධො පච්චයො කාරිතං විය දට්ඨබ්බොති කාරිතබ්‍යපදෙසො, ‘‘කාරිතානං ණො ලොප’’න්ති ණලොපො, ‘‘අසංයොගන්තස්ස වුද්ධි කාරිතෙ’’ති වුද්ධි, ඉකාරාගමො, කත්තබ්බං කාරියං.",
        "vutti_sanna": "ත්‍රිපදයි. **අනුබන්ධො**, සේයි; **අප්පයොගී**; ආගමයෙහි නොයෙදෙන්නා වූ; **ණකාරානුබන්ධො**, ණකාරයා අනුබන්ධකොට ඇති ණකාරයාගේ තමා නිසා පැවතුම් ඇති, **පච්චයො**, අකාරාදි ප්‍රත්‍යය තෙම; **කාරිතං විය**, කාරිතයා මෙන්; කාරිත නම් ඇති තැනැත්තහු මෙන්; **දට්ඨබ්බොති**, දත යුත්තේ යයි කියා; **කාරිතව්‍යපදෙසො**, කාරිතවත් වෙයි කාරිත නම් වෙයි; ණානුබන්ධ නම් ණකාරයි; “**කත්තබ්බං**” යනාදි කිතකයෙන් වාක්‍ය ගත්නියායි;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "කාරිය",
                "steps": [
                    {
                        "formula": "කර+ ණ්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "කර් + ණ් - ය",
                        "rule": ""
                    },
                    {
                        "formula": "ක→කා ර් + ණ් - ය",
                        "rule": ""
                    },
                    {
                        "formula": "කාර් + (ඉ) + ය",
                        "rule": ""
                    },
                    {
                        "formula": "කාරිය",
                        "rule": ""
                    }
                ],
                "final_result": "කාරිය"
            },
            {
                "word": "සිස්ස",
                "steps": [
                    {
                        "formula": "(ආචරියෙන) සාසිතබ්බො සිස්සො",
                        "rule": ""
                    },
                    {
                        "formula": "සාස+ණ්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "සාස්+ණ්-ය",
                        "rule": ""
                    },
                    {
                        "formula": "සා→සි ස්+ ය",
                        "rule": ""
                    },
                    {
                        "formula": "සි (ස්+ය) →ස→ස්ස",
                        "rule": ""
                    },
                    {
                        "formula": "සිස්ස",
                        "rule": ""
                    }
                ],
                "final_result": "සිස්ස"
            }
        ],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "621"
    },
    {
        "sutta_number": 554,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "554. කගා චජානං.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි - **කගා** ය, **චජානං** ය යනු පදයි. **අන්තානං**, ධාත්වන්ත වූ; **චජානං**, චකාර ජකාර දෙකට; **ණානුබන්ධෙ**, ණකාරානුබන්ධ ප්‍රත්‍යයා පරකල්හි; **කගා** කකාර ගකාරයො ආදේශ වෙත්.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "අන්තෙන, ණ්‍යස්ස",
        "vutti": "චජඉච්චෙතෙසං ධාත්වන්තානං කකාර ගකාරාදෙසා හොන්ති ණකාරානුබන්ධෙ පච්චයෙ පරෙති චස්ස කාදෙසො. වචනීයං වාක්‍යං. භජ සෙවායං, භජනීයං භාග්‍යං, ජස්ස ගාදෙසො.",
        "vutti_sanna": "ද්විපදයි. **භජනීයං**, සත්පුරුෂයන් විසින් සෙවනය කරනු ලබන්නේ; **භාග්‍යං**, භාග්‍ය නම් වේ; **කුසලං**,",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "වාක්‍ය",
                "steps": [
                    {
                        "formula": "ච ඡ ජ ඣ ඤ",
                        "rule": ""
                    },
                    {
                        "formula": "ක ඛ ග ඝ ඞ",
                        "rule": ""
                    },
                    {
                        "formula": "වච + ණ්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "වච්+ ණ්-ය",
                        "rule": ""
                    },
                    {
                        "formula": "ව්-අ → ආ ච් → ක් -ණ්-ය",
                        "rule": ""
                    },
                    {
                        "formula": "වාක්‍ය",
                        "rule": ""
                    }
                ],
                "final_result": "වාක්‍ය"
            },
            {
                "word": "විනිච්ඡෙය්‍ය",
                "steps": [
                    {
                        "formula": "වි+නි+චි+ණ්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "වි+නි+ච්-ඉ+ණ්‍-ය",
                        "rule": ""
                    },
                    {
                        "formula": "වි+නි+ච්→ඡ්-ඉ→එ+ණ්‍-ය",
                        "rule": ""
                    },
                    {
                        "formula": "විනි+ඡ් →ච්ඡ් + එ + ය → ය්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "විනිච්ඡෙය්‍ය",
                        "rule": ""
                    }
                ],
                "final_result": "විනිච්ඡෙය්‍ය"
            }
        ],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "625"
    },
    {
        "sutta_number": 555,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "555. භූතොබ්බ.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **භූතො** ය, **අබ්බ** ය යනු පදයි.  **භූතො**, භූධාතුහු කෙරෙන් පර වූ; **ණ්‍යස්ස**, ණ්‍ය ප්‍රත්‍යයට; **අන්තෙන**, ධාත්වන්තය හා එක්ව; **අබ්බ**, අබ්බ යනාදේශ වේ.) ද්විපදයි.",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "අන්තෙන, ණ්‍යස්ස",
        "vutti": "භූ ඉච්චෙතස්මා පරස්ස ණ්‍යප්පච්චයස්ස සහ ධාත්වන්තෙන අබ්බාදෙසො හොති. භවිතබ්බො භබ්බො, භබ්බා, භබ්බං.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "භබ්බ",
                "steps": [
                    {
                        "formula": "භූ+ ණ්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "භ්- (ඌ+ණ්‍ය) → අබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "භබ්බ",
                        "rule": ""
                    }
                ],
                "final_result": "භබ්බ"
            }
        ],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "545"
    },
    {
        "sutta_number": 556,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "556. වද මද ගමු යුජ ගරහාකාරාදීහි ජ්ජම්මග්ගය්හෙය්‍යා ගාරො වා.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **වදමදගමයුජගරහාකාරාදීහි** ය, **ජ්ජම්මග්ගය්හය්‍යා** ය, **ගාරො** ය, **වා** ය යනු පදයි. වදමදගමයුජගරහාකාරාදීහි, **වද**, වචනෙය; **මද**, උම්මා දෙය; **ගමු**, ගතියංය; **යුජ**, යොගෙය; **ගරහ**, නින්දායංය යනාදි ධාතු හා ආකාරාන්තධාතුය යන මොවුන් කෙරෙන් පර වූ; **ණ්‍යස්ස**, ණ්‍ය ප්‍රත්‍යයට; **අන්තෙත**, ධාත්වන්තය හා එක්ව; **වා**, විකල්පයෙන්; ජ්ජ ම්ම ග්ග යෙහය්‍යා, ජ්ජ ම්ම ග්ග ය්හ එය්‍ය යන මේ ආදේශයෝ පිළිවෙළින් වෙත්; **ගාරො**, (ගරහධාතුහට) ගාර යනාදෙශද වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "භාවකම්මෙසු",
        "vutti": "වද මද ගමු යුජ ගරහඉච්චෙවමාදීහි ධාතූහි, ආකාරන්තෙහි ච පරස්ස ණ්‍යප්පච්චයස්ස ධාත්වන්තෙන සහ යථාක්කමං ජ්ජ ම්ම ග්ග ය්හ එය්‍යඉච්චෙතෙ ආදෙසා හොන්ති වා, ගරස්ස ච ගාරාදෙසො, ගරහස්ස ගරස්සෙවායං ගාරො. වවත්ථිතවිභාසත්ථොයං වාසද්දො.",
        "vutti_sanna": "සිවුපදයි. **ආකාරන්තෙහි**, ආ-යන මොහු අන්ත කොට ඇති ධාතූන් කෙරෙන් පරවූ ද; **අයං ගාරො**,මේගාරයන ආදෙශය ගරහ යන ධාතු හුගේ; **ගරස්සෙව**, ගර යන මොහටමැයි ; ආදෙශි වූ ධාතුන් බොහෝ වුව යථාක්කමං කීයේ කුමටයත්? ආකාරන්තයන්ගෙන කීහු;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "546"
    },
    {
        "sutta_number": 557,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "557. කරම්හා රිච්ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **කරම්හා** ය, **රිච්චො** ය යනු පදයි. **කරම්හා**, කර ධාතුහු කෙරෙන්; **භාවකම්මෙසු,** භාවකර්ම දෙක්හි; **රිච්චො**, රිච්ච ප්‍රත්‍යය වේ.) ද්විපදයි. ",
        "sutta_type": "ප්‍රත්‍යය විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "කරධාතුතො රිච්චප්පච්චයො හොති භාවකම්මෙසු.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "544"
    },
    {
        "sutta_number": 558,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "558. රම්හි රන්තො රාදි නො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **රම්හි** ය. **අන්තො** ය, **රාදි** ය, **නො** ය යනු පදයි. **රම්හි**, රකාරානුබන්ධ ප්‍රත්‍යයා පරකල්හි; **අන්තො,** (ධාතූන්ගේ) අන්තයද, **රාදි**, රකාරාදියද; **නො**, නොවේ; හෙවත් ලොප් වේ.)",
        "sutta_type": "ලොප විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "රකාරානුබන්ධෙ පච්චයෙ පරෙ සබ්බො ධාත්වන්තො රාදි පච්චයරකාරමරියාදො නො හොති, ලොපමාපජ්ජතෙති අත්ථො. රන්තොති එත්ථ රකාරො සන්ධිජො, කත්තබ්බං කිච්චං. ‘‘රිච්චා’’ති යොගවිභාගෙන භරාදිතොපි රිච්චප්පච්චයො, යථා, භරීයතීති භච්චො, සරලොපො. ඉ ගතිම්හි, පති එතබ්බො පටිච්චො. (අභිමුඛයට ගිය?)",
        "vutti_sanna": "සිවුපදයි. **රකාරානුබන්ධෙ පච්චයෙ පරෙ**, රකාර අනුබන්ධ කොට ඇති ප්‍රත්‍යයා පරකල්හි, රකාරමරියාදො; රකාරහිම්කොට ඇති; **සබ්බො ධාත්වන්තො**, සියලු ධාත්වන්ත තෙම සියලු ධාතූන්ගේ අන්ත තෙම; **නො හොති**, සේ; **ලොපො හොති**, සේයි; රකාරොමරියාදා යස්ස ධාත්වන්තස්ස සො ධාත්වන්තො රකාරමරියාදො; රකාරමරියාද නම් වේ; තද්ගුණ හෙයින් රකාරදගැණේ. **රන්තොති එත්ථ**, සූත්‍රයෙහි රන්තො යන මෙහි; **√භර** භරණෙ; පටිපූර්ව වූ **√ඉ** ගතිම්හි යනු කියා තිබේ; රිච්ච ප්‍රත්‍යයාගෙ රාදිහටලොප්ව පරනය ව **පටිච්චො** යනුවේ; රකාරො මරියාදා යස්ස ධාතුස්ස සො රකාරමරියා දො; මෙසේ ගත්කල අන්ත නැති ධාතුද ලැබේ; රකාරයා හිම් කොට ඇති එකාක්ෂර ධාතූන්ටත් ලොප්වෙයි සේයි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "කිච්ච",
                "steps": [
                    {
                        "formula": "කත්තබ්බං",
                        "rule": ""
                    },
                    {
                        "formula": "√කර + රිච්ච",
                        "rule": ""
                    },
                    {
                        "formula": "කර + රිච්ච",
                        "rule": ""
                    },
                    {
                        "formula": "ක (ර් + ර්) - ඉච්ච",
                        "rule": ""
                    },
                    {
                        "formula": "ක්-අ - ඉච්ච",
                        "rule": ""
                    },
                    {
                        "formula": "කිච්ච",
                        "rule": ""
                    }
                ],
                "final_result": "කිච්ච"
            },
            {
                "word": "පටිච්ච",
                "steps": [
                    {
                        "formula": "පති + එතබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "පති + √ඉ + රිච්ච",
                        "rule": ""
                    },
                    {
                        "formula": "පති→පටි + ඉ + ර්-ඉච්ච",
                        "rule": ""
                    },
                    {
                        "formula": "පට්-ඉ + ඉ + ඉච්ච",
                        "rule": ""
                    },
                    {
                        "formula": "පටිච්ච",
                        "rule": ""
                    }
                ],
                "final_result": "පටිච්ච"
            }
        ],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "541"
    },
    {
        "sutta_number": 559,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "559. පෙසාතිසග්ගපත්තකාලෙසු කිච්චා.",
        "sutta_meaning": "(යනු නියම සුත්‍රයි. - **පෙසාතිසග්ගපත්තකාලෙසු** ය, **කිච්චා** ය යනු පදයි. **පෙසාතිසග්ගපත්තකාලෙසු**, **පෙස**, නියොගය; **අතිසග්ග**, ගිවිසීමය; **පත්තකාලෙසු**, කටයුත්තට ප්‍රාප්තකාලාරොචනය යන මේ අර්ථයන්හි; **කිච්චා**, කිච්ච ප්‍රත්‍යයෝ වෙත්.)",
        "sutta_type": "විධි සූත්‍රය (නියමසුත්ත)",
        "anuvattana": "තස්ස",
        "vutti": "පෙස අතිසග්ග පත්තකාලඉච්චෙතෙස්වත්ථෙසු කිච්චප්පච්චයා හොන්ති. පෙසනං නාම ‘‘කත්තබ්බමිදං භවතා’’ති ආණාපනං, අජ්ඣෙසනඤ්ච. අතිසග්ගො නාම ‘‘කිමිදං මයා කත්තබ්බ’’න්ති පුට්ඨස්ස වා ‘‘පාණො න හන්තබ්බො’’තිආදිනා පටිපත්තිදස්සනමුඛෙන වා කත්තබ්බස්ස අනුඤ්ඤා. පත්තකාලො නාම සම්පත්තසමයො යො අත්තනො කිච්චකරණසමයමනුපපරික්ඛිත්වා න කරොති, තස්ස සමයාරොචනං, න තත්ථ අජ්ඣෙසනමත්ථීති. තෙ ච ‘‘භාවකම්මෙසු කිච්චක්තක්ඛත්ථා’’ති වුත්තත්තා භාවකම්මෙස්වෙව භවන්ති. පෙසනෙ තාව – කරීයතු භවතා කම්මන්ති අත්ථෙ ඉමිනා තබ්බානීයා, සෙසං වුත්තනයමෙව, කත්තබ්බං කම්මං භවතා, කරණීයං කිච්චං භවතා.",
        "vutti_sanna": "ද්විපදයි. **පෙස**, නියොගය; **අතිසග්ග**, ගිවිස්මය; **පත්තකාල**, කර්මාන්තයට සුදුසු කල්හි කීමය යන මොවුන්ගේ අර්ථයෙහි තබ්බා දි කිච්ච ප්‍රත්‍යයෝ වෙත්; **පෙසනං නාම**, පෙසන නම්; **භවතා**, පින්වත්හු විසින් මේ කටයුත්තේ යයි; **ආණාපනං**, නියොග කිරීමද **අජ්ඣ‍ෙසඤ්ච**, ආරාධනා කිරීමද යන මේයි; **අතිසග්ග** නම්, **මයා ඉදං කිං කත්තබ්බං ඉති**, මා විසින් කුමක් කටයුත්තේ දැයි මෙසේ; **පුට්ඨස්ස**, විචාළවුට ද කීවහුටද; **වා**, නොහොත් මෙසේ නොකීව හුටද; **පාණො න හන්තබ්බො ආදිනා**, සතුන් නොමැරිය යුත්තේය යනාදි විසින්; **පටිපත්තිදස්සනමුඛෙන වා**, බුදුන් ප්‍රතිපත්ති දර්ශන ද්වාරයෙන් හෝ සක්විත්තන් විසින් අවවාද කරන සමය; **අනුපපරික්ඛිත්වා**, පරීක්ෂා නොකොට නොවිචාරා, **න කරොති**, නො කෙරේද; **තස්ස**, ඔ හට; **සමයාරොචනං**, සමකල් කීමයි; ඔහට කර්මාන්ත කරන කල් කීමයි; **තත්ථ**, ඒ සමයා රොචනයෙහි, **අජ්ඣෙසනං න අත්ථි**, ආරාධනා කිරීමෙක් නැති. සමය කියන බව මිස ආරාධනා කිරීමෙක් නැත්තේද. “භාවකම්මෙසු කිච්චක්තක්ඛත්ථා” යී කී හෙයින් කිච්ච ප්‍රත්‍යය වන්නේ භාව කර්ම දෙක්හි යයි කී හෙයින්; **තෙ කිච්චප්පච්චයා භාවකම්මෙසු භවන්ති**, මේ සූත්‍රයෙහි භාව කර්ම ග්‍රහණ ඇතිව \"භාවකම්මෙසු තබ්බානීයා '' යන සූත්‍රයෙහි භාව කර්ම ග්‍රහණ කෙළේ කුමක් පිණිසද යත්? \" නන්දාදීහි යු \" යන සූත්‍රයට වැටෙන පිණිසයි, ඒ සූත්‍රයෙහිම නොකියා මේ සූත්‍රයෙහි කීයේ කුමක් පිණිසද යත්? '' භාව කම්මෙසු කිච්චක්තක්ඛත්ථා '\" යන සුත්‍රය දූරස්ථ හෙයින් කී ප්‍රත්‍යයෝ වෙත්;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "637"
    },
    {
        "sutta_number": 560,
        "sub_khanda_id": "01_kitaka_kiccha",
        "sub_khanda_name": "කිච්චප්පච්චයන්තනය",
        "sutta_name": "560. භුජාදීනමන්තො නො ද්වි ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **භුජාදීනං** ය, **අන්තො** ය, **ච** ය යනු පදයි. **භුජාදීනං**, භුජාදී ධාතූන්ගේ; **අන්තො,** අන්තයතෙම; **නො**, නොවේ හෙවත් ලොප් වේ; **තස්ස**, තප්‍රත්‍යයට; **ද්වි ච**, ද්විත්වද වේ.)",
        "sutta_type": "විධි සූත්‍රය (ලොප හා ද්විත්ව විධි)",
        "anuvattana": "පරා, පච්චයා",
        "vutti": "භුජඉච්චෙවමාදීනං ජකාරාදිඅන්තානං ධාතූනමන්තො නො හොති, පරස්ස කිච්චකිතකප්පච්චයතකාරස්ස ච ද්වෙභාවො හොති. භොත්තබ්බං භොජනං භවතා, භොජනීයං භොජ්ජං භවතා. ඉකාරාගමයුත්තතකාරෙ පන – ‘‘නමකරානමන්තානං නියුත්තතම්හී’’ති එත්ථ ‘‘අන්තානං නියුත්තතම්හී’’ති යොගවිභාගෙන ධාත්වන්තලොපාදිනිසෙධො, ‘‘රුධාදිතො නිග්ගහීතපුබ්බ’’න්ති විනාධිකාරයොගවිභාගෙන, ‘‘නිග්ගහීතඤ්චා’’ති වා නිග්ගහීතාගමො, භුඤ්ජිතබ්බං තයා, යුඤ්ජිතබ්බං.",
        "vutti_sanna": "පස්පදයි. **ජකාරාදි අන්තානං**, ජකාරය යනාදි මොවුන් අන්ත කොට ඇති භුජාදිධාතූන්ගේ අන්ත තෙම; **නො හොති**, ලොප් වේ; **පරස්ස** භුජාදිධාතූන් කෙරෙන්, පර වූ; **කිච්චකිතකප්පච්චයතකාරස්ස ච**, කිච්චකිතක ප්‍රත්‍යයන්ගේ තකාරයහට ද; **භවතා**, පින්වත්හු විසින්; **භොජනං**, භොජනය; **භොත්තබ්බං**, වැළඳීම; **භවතා භොජ්ජං භොජනීයං**, **ඉකාරාගමයුත්තතකාරෙ පන**, “යථා ගමමිකාරො” යන සූත්‍රයෙන් ආගම වූ ඉකාරය යුක්ත වූ තකාරයා පර කල්හි වනාහි; **ධාත්වන්තලොපාදි**, ධාතූන්ගේ අන්තයාට ලොප් ව තකාරයාට ද්විත්ව යන මේ, **නිසෙධො**, වළකී; **විනාධීකාරෙන කත**, විනාධිකාරයයි කරන ලද නම් ඇති “රුධාදිතො නිග්ගහීතපුබ්බං” යන **යොගවිභාගෙන**, සූත්‍ර භාගයෙන් හෝ “නිග්ගහීතඤ්ච” යන සූත්‍රයෙන් හෝ; **යුඤ්ජිතබ්බං**, **√යුජ** යොගෙ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "අජ්ඣයිතබ්බ",
                "steps": [
                    {
                        "formula": "අධි+√ඉ+ තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "අධි+ඉ+ (ඉ) +තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "අධි>අජ්ඣ+ඉ>එ>අය+ (ඉ) +තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "අජ්ඣ+අය+ඉ+තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "අජ්ඣයිතබ්බ",
                        "rule": ""
                    }
                ],
                "final_result": "අජ්ඣයිතබ්බ"
            },
            {
                "word": "අජ්ඣෙය්‍ය",
                "steps": [
                    {
                        "formula": "අධි+√ඉ+ ණ්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "අධි→අජ්ඣ+ඉ→එ + ණ්- ය→ය්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "අජ්ඣ+එ+ය්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "අජ්ඣෙය්‍ය",
                        "rule": ""
                    }
                ],
                "final_result": "අජ්ඣෙය්‍ය"
            },
            {
                "word": "අජ්ඣයනීය",
                "steps": [
                    {
                        "formula": "අධි+√ඉ+ අනීය",
                        "rule": ""
                    },
                    {
                        "formula": "අධි→අජ්ඣ+ඉ→එ→අය+ අනීය",
                        "rule": ""
                    },
                    {
                        "formula": "අජ්ඣ+අය+අනීය",
                        "rule": ""
                    },
                    {
                        "formula": "අජ්ඣයනීය",
                        "rule": ""
                    }
                ],
                "final_result": "අජ්ඣයනීය"
            },
            {
                "word": "ඒ භික්ෂුව දක්ෂ ගුරුවරයෙකු විය යුතුය.",
                "steps": [
                    {
                        "formula": "යං ඉණං අදෙන්තස්ස දණ්ඩො ආගච්ඡති, ඉදං අධමිණං නාම, සතං මෙ දාතබ්බං භවතාති. (නිරු.දී.)",
                        "rule": ""
                    },
                    {
                        "formula": "තිතික්ඛාපීයති",
                        "rule": ""
                    },
                    {
                        "formula": "තිතික්ඛති",
                        "rule": "= ඉවසයි (ක්ෂමා කරනු කැමැති වේ)"
                    },
                    {
                        "formula": "තිතික්ඛ +ණාපෙ+ ති",
                        "rule": ""
                    },
                    {
                        "formula": "තිතික්ඛාපෙති",
                        "rule": "= ඉවසවයි (ක්ෂමා කරනු කැමැති කරවයි)"
                    },
                    {
                        "formula": "තිතික්ඛ +ණාපෙ+ (ඊ)+ ය+ ති",
                        "rule": ""
                    },
                    {
                        "formula": "තිතික්ඛාපීයති",
                        "rule": "= ඉවසවනු ලැබේ (ක්ෂමා කරනු කැමැති කරවනු ලැබේ)"
                    },
                    {
                        "formula": "තිතික්ඛාපෙ+තබ්බො",
                        "rule": ""
                    },
                    {
                        "formula": "නුඹ විසින් මේ ගස නො කැපිය යුතුය.",
                        "rule": ""
                    },
                    {
                        "formula": "අන් එක සොරෙකු විය යුතුයි.",
                        "rule": ""
                    },
                    {
                        "formula": "ඔබ වහන්සේ සිල්වතෙකු විය යුතුය",
                        "rule": ""
                    },
                    {
                        "formula": "ඒ භික්ෂුව දක්ෂ ගුරුවරයෙකු විය යුතුය.",
                        "rule": ""
                    }
                ],
                "final_result": "ඒ භික්ෂුව දක්ෂ ගුරුවරයෙකු විය යුතුය."
            }
        ],
        "category_badge": "කිච්චප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "580"
    }
];
