window.SuttaDatabase = window.SuttaDatabase || {};

window.SuttaDatabase["03_kitaka_atita"] = [
    {
        "sutta_number": 612,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "612. අතීතෙ ත තවන්තු තාවී.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **අතීතෙ** ය, **තතවන්තුතාවී** ය යනු පදයි. **අතීතෙ**, අතීත කාලයෙහි; **ත-තවන්තු-තාවී**, (සියලු ධාතූන් කෙ රෙන් පරව) ත-තවන්තු-තාවී යන මේ ප්‍රත්‍යයෝ වෙත්.)",
        "sutta_type": "ප්‍රත්‍යය විධි සූත්‍රය",
        "anuvattana": "තස්ස, සාදිනා",
        "vutti": "අතීතෙ කාලෙ සබ්බෙහි ධාතූහි ත තවන්තු තාවී ඉච්චෙතෙ පච්චයා හොන්ති. එතෙ එව පරසමඤ්ඤාය නිට්ඨසඤ්ඤකාපි, තෙ ච කිතසඤ්ඤත්තා කත්තරි භවන්ති. අභවීති භූතො, භූතා, භූතං, ‘‘අඤ්ඤෙසු චා’’ති එත්ථානුවත්තිතවාග්ගහණෙන ත තවන්තුතාවීසු වුද්ධි න හොති. හු දානාදනහබ්‍යප්පදානෙසු, අහවීති හුතො අග්ගිං.",
        "vutti_sanna": "ද්විපදයි. **පරසමඤ්ඤාය**, පරයන්ගේ නම් විසින්; **නිට්ඨාසඤ්ඤකාපි**, නිට්ඨා නම් ඇත්තාහුද; **එතෙ එව**, මොහු තුන්දෙන මැයි. “අපි” යනු කිත්සඤ්ඤා සම්පිණ්ඩනය කෙරේ; **කිත්සඤ්ඤත්තා**, “අඤ්ඤෙ කිත්” යන සූත්‍රයෙන් කරන ලද කිත්නම් බව ඇති හෙයින්; **තෙ ච**, ත ආදි ප්‍රත්‍යයෝ; කත්තරි භවන්ති; **තතවන්තුතාවීසු**, ත ය තවන්තු ය තාවී ය යන මොවුන් පරකල්හි; √හු යනු; **දාන**, දීමය; **ආදාන**, ගැන්මය; **හව්‍ය**, යාග වස්තු; **පදාන**, දීමය යන මොවුන් කෙරෙහි වැටේ - **අහාවීති**, වී යනුයි ගිනි තෙම හුත නම් වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "557"
    },
    {
        "sutta_number": 613,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "613. වසතො උත්ථ.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **වසතො** ය, **උත්ථ** ය යනු පදයි. **වසතො**, වස ධාතුහු කෙරෙන් පර වූ; **සාදිනා**, ආදි බ්‍යඤ්ජනය සහිත වූ; **තස්ස**, තප්‍රත්‍යයට; **උත්ථ**, උත්ථාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තෙ, වසස්ස",
        "vutti": "වසඉච්චෙතස්මා ධාතුම්හා පරස්ස තකාරස්ස සහාදිබ්‍යඤ්ජනෙන උත්ථාදෙසො හොති, සරලොපාදි. වස්සං වුත්ථො, වුත්ථා සා, ‘‘සරලොපො’’තිආදිසුත්තෙ තුග්ගහණතො පුබ්බලොපාභාවෙ ‘‘අධිවත්ථා දෙවතා, වත්ථබ්බ’’න්තිආදීසු පරලොපො.",
        "vutti_sanna": "ද්විපදයි. “වස්සං” යනු උපපද වූ √වස නිවාසෙ යන්නහුටයි. **පුබ්බලොපාභාවේ**, පූර්ව ස්වරයාට ලොපප්‍රතිෂෙධ කළ කල්හි. අධි-පූර්ව වූ √වස නිවාසෙ යන්නහු කෙරෙන් පර වූ ත ප්‍රත්‍යයාට වස යන ධාතුහුගේ ආදි ව්‍යංජනයා හා එක්ව එක්කොට උත්ථ යන ආදෙශ කොට “වා පරො අසරූපා” යන සූත්‍රයෙන් පරයා ලොප් කළ කල්හි අධිවත්ථ නම් වේ, ආදිව්‍යංජන නම් සකාරයි. වත්ථබ්බං යනු ද එසේමැයි; **දෙවතා**, දෙවතා තොම; **අධිවත්ථා**, අධිගෘහිත වී විසී; **වත්තබ්බං**, විසිය යුත්තේය.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "වුත්ථ",
                "steps": [
                    {
                        "formula": "ව (ස+ත) →උත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "වුත්ථ",
                        "rule": ""
                    }
                ],
                "final_result": "වුත්ථ"
            },
            {
                "word": "අධිවත්ථ",
                "steps": [
                    {
                        "formula": "අධි+අවසි",
                        "rule": ""
                    },
                    {
                        "formula": "අධි+ ව (ස+ත) →උත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "අධි+ ව - උ ත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "අධිවත්ථ",
                        "rule": ""
                    }
                ],
                "final_result": "අධිවත්ථ"
            },
            {
                "word": "වත්ථබ්බ",
                "steps": [
                    {
                        "formula": "වස+තබ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "ව (ස+ත) →උත්ථ බ්බ",
                        "rule": ""
                    },
                    {
                        "formula": "වත්ථබ්බ",
                        "rule": ""
                    }
                ],
                "final_result": "වත්ථබ්බ"
            }
        ],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "576"
    },
    {
        "sutta_number": 614,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "614. වස්ස වා වු.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **වස්ස** ය, **වා** ය, **උ** ය යනු පදයි. **වසස්ස**, වස ධාතුහුගේ; **වස්ස**, වකාරයට; **තෙ**, තප්‍රත්‍යයා පරකල්හි **වා**, විකල්පයෙන්; **උ**, උකාරාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "හචතුත්ථානං, අන්තානං",
        "vutti": "වසඉච්චෙතස්ස ධාතුස්ස වකාරස්ස තකාරෙ පරෙ උකාරො හොති, තත්ථ වකාරාගමො ච වා හොති. නිට්ඨතකාරෙ එවායං.",
        "vutti_sanna": "ත්‍රිපදයි. **තත්ථ**, ඒ උකාරාදේශ කළ තන්හි වාසිතො වාසිතො යන තන්හි; වකාරාගමො ච වා හොති, වකාරාගම ද විකල්පයෙන් වේ, \"ව\" යනු උකාරාදෙශ ද වෙයි සමුච්චය ද කෙරේ. **අයං**, වකාරයාට උකාරාදේශ ද වකාරාගම ද යන මේ කාරිය; **නිට්ඨාතකාරෙ එව**, නිට්ඨා නම් ඇති තකාරයා පරකල්හි මැයි; **ව ච**, වකාර ද; **උ ච** උකාර ද වවු නම් වේ. මෙසේගත් ආදිපක්ෂයෙහිදී උකාරාදෙශ වෙයි වකාරාගම වෙයි කී නියායි;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "වුසිත",
                "steps": [
                    {
                        "formula": "ව→උ",
                        "rule": ""
                    },
                    {
                        "formula": "වස+ත",
                        "rule": ""
                    },
                    {
                        "formula": "වස+ (ඉ) +ත",
                        "rule": ""
                    },
                    {
                        "formula": "(ව්)+ ව→උ ස+ (ඉ) +ත",
                        "rule": ""
                    },
                    {
                        "formula": "වුසිත",
                        "rule": ""
                    }
                ],
                "final_result": "වුසිත"
            },
            {
                "word": "වුසිත",
                "steps": [
                    {
                        "formula": "ව්-අ→උ",
                        "rule": ""
                    },
                    {
                        "formula": "ව→උ",
                        "rule": ""
                    },
                    {
                        "formula": "වස්ස අ = ව (වසස්ස වස්ස වා උ) (වස ධාතුවේ වකාරස්ථ අකාරයට උ වේ.)",
                        "rule": ""
                    },
                    {
                        "formula": "වස+ත",
                        "rule": ""
                    },
                    {
                        "formula": "වස+ (ඉ) +ත",
                        "rule": ""
                    },
                    {
                        "formula": "ව්-අ→උ ස+ (ඉ) +ත",
                        "rule": ""
                    },
                    {
                        "formula": "වුසිත",
                        "rule": ""
                    }
                ],
                "final_result": "වුසිත"
            },
            {
                "word": "උසිත",
                "steps": [
                    {
                        "formula": "වස+ත",
                        "rule": ""
                    },
                    {
                        "formula": "වස+ (ඉ) +ත",
                        "rule": ""
                    },
                    {
                        "formula": "ව→උ ස+ (ඉ) +ත",
                        "rule": ""
                    },
                    {
                        "formula": "උසිත",
                        "rule": ""
                    }
                ],
                "final_result": "උසිත"
            }
        ],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "577"
    },
    {
        "sutta_number": 615,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "615. ඩො ඪකාරෙ.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ඩො** ය, **එකාරෙ** ය යනු පදයි. **අන්තානං**, ධාවන්ත වූ; **හචතුත්ථානං**, හකාර වර්ගචතුර්ථාක්ෂරයන්ට; **ඪකාරෙ**, ඪකාරයා පරකල්හි; **ඩො**, ඩකාරදේශ වේ.) ද්විපදයි.",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තස්ස, අන්තො, නො",
        "vutti": "හචතුත්ථානං ධාත්වන්තානං ඩකාරාදෙසො හොති ඪකාරෙ පරෙ. වුඩ්ඪො, වුඩ්ඪා, ‘‘බො වස්සා’’ති බත්තෙ බුඩ්ඪො.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "බුඩ්ඪ",
                "steps": [
                    {
                        "formula": "වඩ්ඪ + ත",
                        "rule": ""
                    },
                    {
                        "formula": "වඩ්ඪ් + ත→ඪ",
                        "rule": ""
                    },
                    {
                        "formula": "වඩ්ඪ්→ඩ් + ඪ",
                        "rule": ""
                    },
                    {
                        "formula": "ව්→බ්-අ→උ ඩ් ඩ් + ඪ",
                        "rule": ""
                    },
                    {
                        "formula": "බුඩ්ඪ",
                        "rule": ""
                    }
                ],
                "final_result": "බුඩ්ඪ"
            },
            {
                "word": "බුද්ධි",
                "steps": [
                    {
                        "formula": "බුජ්ඣනං, බුජ්ඣති එතාය",
                        "rule": ""
                    },
                    {
                        "formula": "බුධ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "බු ධ් + ත්-ඉ",
                        "rule": ""
                    },
                    {
                        "formula": "බු ධ් + ත් →ධ්-ඉ",
                        "rule": ""
                    },
                    {
                        "formula": "බු ධ්→ද්+ ධ්-ඉ",
                        "rule": ""
                    },
                    {
                        "formula": "බුද්ධි",
                        "rule": ""
                    }
                ],
                "final_result": "බුද්ධි"
            }
        ],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "614"
    },
    {
        "sutta_number": 616,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "616. තරාදීහි ඉණ්ණො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **තරාදීහි** ය, **ඉණ්ණො** ය යනු පදයි. **තරාදීහි**, තර තරණෙ යනාදී ධාතූන් කෙරෙන් පර වූ; **තස්ස**, ත ප්‍රත්‍යයට; **ඉණ්ණො**, ඉණ්ණාදේශ වේ **අන්තො**, ධාවන්ත වූ බ්‍යඤ්ජනය තෙම; **නො,** නොවේ හෙවත් ලොප් වේ)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තස්ස, අන්තො, නො",
        "vutti": "තරඉච්චෙවමාදීහි ධාතූහි පරස්ස තප්පච්චයස්ස ඉණ්ණාදෙසො හොති, ධාත්වන්තො ච නො හොති, සරලොපාදි. තර තරණෙ, සංසාරණ්ණවං අතරීති තිණ්ණො තාරෙය්‍යං. එවං උත්තිණ්ණො, තිණ්ණං වා. පූර පූරණෙ, සංපූරීති සංපුණ්ණො, ‘‘සරලොපො’’තිආදිසුත්තෙ තුග්ගහණතො පුබ්බලොපාභාවෙ උවණ්ණතො පරස්ස ‘‘වා පරො අසරූපා’’ති ලොපො, සංයොගෙ රස්සත්තං. තුර වෙගෙ, අතුරීති තුණ්ණං, තුරිතං වා. ජර වයොහානිම්හි, පරිජීරීති පරිජිණ්ණො. කිර විකිරණෙ, ආකිරීති ආකිණ්ණො ඉච්චාදි.",
        "vutti_sanna": "ද්විපදයි. **නො හොති, ලොපො හොති**, සසර නැමැති මහ මුහුදු; **අතරි**, එතර වීනුයි තිණ්ණ නම් වේ; **තිණ්ණො අහං**, එතර වූ හෙ මම් **තාරෙය්‍ය**, එතර කෙරෙම් වා ; **උත්තරීති උත්තිණ්ණො**, නැඟීනුයි උත්තිණ්ණ නම් වේ. නැඟීමයි, **අතරීති තිණ්ණො**, නැඟිනුයි තිණ්ණ නම් වේ. පිරිනුයි සම්පුණ්ණ නම් වේ; **සංයොගෙ**, සංයොගයා පර කල්හි **අතුදීති**, ඇරදි වී නුයි; **පරිජීරීති**. පෙරදිරිණිනුයි. පරි පූර්ව වූ √ජර වයොහානිම්හි යන ධාතුයි. √කිර යනු; **විකිරණ‍ෙ**, විසිරීමෙහි, වැටේ. **ආකිරීති**, ගැවසී ගත්නුයි ආකිණ්ණ නම් වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "583"
    },
    {
        "sutta_number": 617,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "617. සුස පච සකතො ක්ඛක්කා ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **සුස-පච-සකතො** ය,**ක්ඛක්කා** ය, ච ය යනු පදයි. **සුස පච සකතො**, √සුස සොසනෙය, √පච පාකෙය, √සක සාමත්ථෙය යන මේ ධාතූන් කෙරෙන් පර වූ; **තස්ස**, තප්‍රත්‍යයට; **ක්ඛක්කා ච** ක්ඛ-ක්ක යන මේ ආදේශයෝද වෙත්; **අන්තො**, ධාන්තාන්ත වූ බ්‍යඤ්ජනය තෙම; **නො**, නොවේ හෙවත් ලොප් වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තස්ස, අන්තො, නො",
        "vutti": "සුස පච සකඉච්චෙතෙහි ධාතූහි පරස්ස තප්පච්චයස්ස ක්ඛ-ක්කාදෙසා හොන්ති, අන්තො ච බ්‍යඤ්ජනො නො හොති. චසද්දෙන මුචාදිතො ක්කාදෙසො. සුස සොසනෙ, අසුස්සීති සුක්ඛො රුක්ඛො. අපච්චීති පක්කං ඵලං. සක සාමත්ථෙ, අසක්ඛීති සක්කො අස්ස, ඔමුච්චීති ඔමුක්කා උපාහනා. ‘‘පචිතුං, පචිතබ්බ’’න්තිආදීසු පන න භවති, ඉකාරෙන බ්‍යවහිතත්තා. එවං සබ්බත්ථ බ්‍යවධානෙ න භවති.",
        "vutti_sanna": "ත්‍රිපදයි. **මුචාදිතො**, මුච මොචනෙ යන මේ ආදි ධාතුන් කෙරෙන් පර වූ තප්‍රත්‍යයාට ක්ක යන ආදේශ වේ. සුස යනු **සොසනෙ**, වියළී මෙහි වැටේ. වියළානුයි රුක තෙම **සුක්ඛ** නම් වේ; **අපච්චීති**, පැසිණිනුයි ඵලය තෙම **පක්ක** නම් වේ. සකයනු; **සාමථ**, සාමර්ථ්‍යයෙහි වැටේ. **අසක්කීති**, පෙර සමර්ථ විනුයි; **සක්කො අස්ස**, ශක්‍ර වී. **ඔමුච්චීති**, බහන ලදනුයි. වහන් තෙම උපාහන නම් වේ; **සබ්බත්ථ ව්‍යවධානෙ**, චකාරයා විසින් ව්‍යවධාන වූ සියලු උදාහරණයෙහි; **එවං න භවති**, “පචිතං” යනාදියෙහි නොවූවා සේම නොවේ. සීහ ගතීන් වැටෙන තිග්‍රහණය ච ග්‍රහණය පිණිස වැටේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "585"
    },
    {
        "sutta_number": 618,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "618. පක්කමාදීහි න්තො ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **පක්කමාදිහි** ය, **න්තො** ය, **ච** ය යනු පදයි. **පක්කමාදීහි**, ප-යන උපසර්ගය පූර්ව කොට ඇති √කමු ආදි ධාතූන් කෙරෙන් පර වූ; **තස්ස**, තප්‍රත්‍යයට; **න්තො** **ච**, න්තාදේශද වේ; **අන්තො**, ධාවන්ත වූ බ්‍යඤ්ජනය තෙම; **නො,** ලොප් වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තස්ස, අන්තස්ස, නො",
        "vutti": "පක්කමඉච්චෙවමාදීහි මකාරන්තෙහි ධාතූහි පරස්ස තප්පච්චයස්ස න්තාදෙසො හොති, ධාත්වන්තො ච නො හොති. චසද්දෙන තිප්පච්චයස්ස න්ති ච හොති. කමු පදවික්ඛෙපෙ, පක්කමීති පක්කන්තො. එවං සඞ්කන්තො, (නික්ඛන්තො, ‘‘දො ධස්ස චා’’ති සුත්තෙ චග්ගහණෙන කස්ස ඛත්තං.) භමු අනවට්ඨානෙ, විබ්භමීති විබ්භන්තො, භන්තො. ඛමු සහනෙ, අක්ඛමීති ඛන්තො. සමු උපසමෙ, අසමීති සන්තො. දමු දමනෙ, අදමීති දන්තො.",
        "vutti_sanna": "ත්‍රිපදයි. **මකාරන්තෙහි**, මකාරයා අන්ත කොට ඇති; **පක්කමිච්චෙවමාදීහි ධාතූහි**,ප පූර්ව වූ කමු යන මේ ආදි ධාතූන්කෙරෙන් පරවූ තප්‍රත්‍යයාට; **නොහොති**, ලොපොහොති **පක්කමීති**, එළඹිණිනුයි; සංකමීති; නික්ඛමීති, නික්ඛත්තො, පක්කන්තො යනුයේම අර්ථයි, සං නි පූර්ව වූ බව මැයි වෙනස. භමු යනු; **අනවට්ඨානෙ**, අනවස්ථිතියෙහි වැටේ. එකෙක මතු නොපිහිටියෙහිම වැටේ. අනික් පරිද්දෙක වීමෙහි වැටේ. **විබ්භමීති** එළඹීනුයි; **භන්ත** නම් බියවීමයි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "586"
    },
    {
        "sutta_number": 619,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "619. ජනාදීනමා තිම්හි ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ජනාදීනං** ය**, ආ** ය, **තිම්හි** ය, **ච** ය යනු පදයි. **ජනාදීනං**, ජන ජනනෙ යනාදි ධාතූන්ගේ; **අන්තස්ස**, අන්තයට; **තෙ,** තප්‍රත්‍යයා පරකල්හිද; **තිම්හි ච**, තිප්‍රත්‍යයා පරකල්හි ද; **ආ** ආකාරාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තෙ, ආ, තිම්හි, ච, අන්තස්ස",
        "vutti": "ජනඉච්චෙවමාදීනං ධාතූනමන්තස්ස බ්‍යඤ්ජනස්ස ආත්තං හොති තප්පච්චයෙ, තිම්හි ච. යොගවිභාගෙන අඤ්ඤත්ථාපි. ජන ජනනෙ, අජනීති ජාතො, විජායීති පුත්තං විජාතා, ජනනං ජාති. තප්පච්චයෙ සතිපි තකාරෙ පුන තිග්ගහණකරණං පච්චයන්තරතකාරෙ ආත්තනිවත්තනත්ථං, යථා – ජන්තු. ‘‘ජනිත්වා, ජනිතු’’න්තිආදීසු පන ඉකාරෙන බ්‍යවහිතත්තා න භවති.",
        "vutti_sanna": "සිව්පදයි. ජන යන මේ ආදි ධාතූන්ගේ අන්ත වූ ව්‍යංජනයාට යොගවිභාගෙන, “ජනාදීනං ආ” යන සූත්‍ර විභාගයෙන් ත ප්‍රත්‍යයා ති ප්‍රත්‍යය යන මොවුන් පරතෙන තබා සෙසු ප්‍රත්‍යයන් පර අන්‍ය උදාහරණයෙහි ධාත්වන්ත වු ව්‍යංජනයාට ආත්ව වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "587"
    },
    {
        "sutta_number": 620,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "620. ඨාපානමිඊ ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ඨාපානං** ය, **ඉඊ** ය, **ච** ය යනු පදයි. **ඨාපානං**, √ඨා √පා යන ධාතු දෙදෙනාගේ **ආ**-**අන්තස්ස**, අන්ත වූ ආකාරයට; **තෙ,** තප්‍රත්‍යයා පරකල්හිද; **තිම්හි ච**, තිප්‍රත්‍යයා පරකල්හි ද (ඇතැම් වෙනත් තැන්හි ද); **ඉඊ**, (පිළිවෙළින්) ඉකාර ඊකාරාදේශයෝ වෙත්.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තස්ස, තිස්ස",
        "vutti": "ඨා පාඉච්චෙතෙසං ධාතූනං අන්තස්ස ආකාරස්ස යථාක්කමං ඉකාරඊකාරාදෙසා හොන්ති තප්පච්චයෙ, තිම්හි ච. චසද්දෙන අඤ්ඤත්‍රාපි ක්වචි. ඨා ගතිනිවත්තිම්හි, අට්ඨාසීති ඨිතො, උපට්ඨිතො ගරුං, ඨිතවා, අධිට්ඨිත්වා, ඨානං ඨිති. පා පානෙ, අපායීති පීතා, යාගුං පීතවා, පානං පීති, පීත්වා.",
        "vutti_sanna": "ත්‍රිපදයි. **අඤ්ඤත්‍රාපි**, ඨා යන ධාතුන් කෙරෙන් පිටත් සෙසු ධාතූන් කෙරෙහිද ඉකාර ඊකාරාදේශයෝ වෙත් **අට්ඨාසි**, සිටියේනුයි; **උපට්ඨාසි**, එළඹ සිටියේ නුයි; ගුරුන් කරා; **උපට්ඨිතො**, එළඹිණි; \" අට්ඨාසීති ඨිතවා'' යනුයෙහි ච ග්‍රහණයෙන් ඉත්ව වේ; අධිට්ඨිත්වා යනුදු චග්‍රහණයට විෂයයි - අධිපූර්ව වූ ඨායනා ධාතුයි - '' පුබ්බකාලෙ '' යනාදි සූත්‍රයෙන් ත්වා ප්‍රත්‍යය වේ; **අධිට්ඨිත්වා**, ඉටා; **ඨානං**, සිටීම ඨිතිනම් වේ. **පානං**, පීම පීති නම් වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "590"
    },
    {
        "sutta_number": 621,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "621. හන්තෙහි හො හස්ස ලො වා අදහනහානං.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **හාන්තෙහි** ය, **හො** ය, **හස්ස** ය, **ළො** ය, **වා** ය, **අදහනහානං** ය යනු පදයි. **හාන්තෙහි**, හකාරාන්ත ධාතූන් කෙරෙන් පර වූ; **තස්ස**, තප්‍රත්‍යයටද; **තිස්ස**, තිප්‍රත්‍යයටද; **හො,** හකාරාදේශ වේ; **හස්ස**, (ධාත්වන්ත) හකාරයට; **වා**, විකල්පයෙන්; **ළො**, ළකාරාදේශ වේ; **අදහනහානං**, දහ නහ යන ධාතු සම්බන්ධව නොවේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "අතීතෙ -",
        "vutti": "හකාරන්තෙහි ධාතූහි පරස්ස තප්පච්චයස්ස, තිස්ස ච හකාරාදෙසො හොති, හස්ස ච ධාත්වන්තස්ස ලකාරො හොති වා දහනහෙ වජ්ජෙත්වා, ඪත්තාපවාදොයං.",
        "vutti_sanna": "සපදයි. **හකාරන්තෙහි**, හකාරයා අන්ත කොට ඇති. **ධාත්වාන්තස්ස**, ධාත්වන්ත වූ හකාරයාට ලකාර වේ; **දහනහෙ**, දහභස්මීකරණෙ, නභිබන්ධනෙ යන මොවුන්; **වජ්ජෙත්වා**, වර්ජිත කොටා ඇති හකාරාන්ත ධාතූන් කෙරෙන් යයි සේයි. **අයං**, මේ කාරිය; **ඪත්තාපවාදො**, ඪකාරයා වැළක්ම වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "591"
    },
    {
        "sutta_number": 622,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "622. භාවකම්මෙසු ත.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **භාවකම්මෙසු** ය, **ත** ය යනු පදයි. **භාවකම්මෙසු**, භාවකාරක කර්මකාරක දෙක්හි; **අතීතෙ**, අතීත කාලයෙහි; (සියලු ධාතූන් කෙරෙන් පරව) **ත**, තප්‍රත්‍යය වේ.)",
        "sutta_type": "ප්‍රත්‍යය විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "අතීතෙ කාලෙ ගම්‍යමානෙ සබ්බධාතූහි තප්පච්චයො හොති භාවකම්මඉච්චෙතෙස්වත්ථෙසු. භාවෙ තාව – ගෙ සද්දෙ, ගායනං, අගායිත්ථාති වා අත්ථෙ තප්පච්චයො.",
        "vutti_sanna": "ද්විපදයි. කො යනු ද √ගෙ යනුද; **සද්දෙ**, බිණීමෙහි වැටේ",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "558"
    },
    {
        "sutta_number": 623,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "623. සබ්බත්ථ ගෙ ගී.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **සබ්බත්ථ** ය, **ගෙ** ය, **ගී** ය යනු පදයි. **සබ්බත්ථ**, සෑම තන්හි; **ගෙ,** ගෙ යන ධාතුව; **ගී**, ගයනාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "ගෙඉච්චෙතස්ස ධාතුස්ස ගීආදෙසො හොති සබ්බත්ථ, තප්පච්චයතිපච්චයෙස්වෙවායං. තස්ස ගීතං, (ගායනං, ගායිතබ්බාති වා ගීති.) භාවෙ – තප්පච්චයන්තා නපුංසකා. කම්මනි – තිලිඞ්ගා. නත ගත්තවිනාමෙ, නච්චනං, අනච්චිත්ථාති වා අත්ථෙ තප්පච්චයො.",
        "vutti_sanna": "ත්‍රිපදයි. **සබ්බත්ථ**, සියලු ප්‍රත්‍යයන් පරකල්හි. මෙසේ කිව ද “**තදනුපරොධෙන**” යනු වැටුණු හෙයින් තප්‍රත්‍යය තිප්‍රත්‍යය ( යන මොවුන් කීම තෙමෙ '' තස්ස '' යනු ආගමයෙ පදයා වැනි යයි; ගායනං යනුද, ගායිතබ්බාතිවා යනුද, ප්‍රත්‍යය හෙයින් (නෑ) යන මොවුන් පර කල්හි මැ; ගෙ යන ධාතු හට ගී යන ආදේශ වේ. එසෙයින් කීහු; - '' තප්පච්චය තිප්පච්චයෙස්වායං\" යනු **අයං**, මේ ගෙ යන ධාතු හට ගී යන ආදෙශ තෙම තප්‍රත්‍යය තිප්‍රත්‍යය යන මොවුන් පර කල්හි මැයි; **තස්ස**, ඔහුගේ; **ගීතං**, ගීතය තෙමෙ - '' තස්ස \" යනු ආගමයේ පදයා වැනි යයි, \" ගායනං\" යනුද, ගායිතබ්බා යනුද, ප්‍රත්‍යය හෙයින් වෙනස් බවයි; **භාවෙ**, භාවයෙහි ත ප්‍රත්‍යයා අන්ත කොට ඇති ශබ්දයෝ* නපුංසකලිඟු වන්නාහ; **කම්මණි**, කර්මයෙහි ත ප්‍රත්‍යයා අන්ත කොට ඇති ශබ්දයෝ තුන් ලිඟුයෙහිම වෙත්. නත යනු; **ගත්තවිනාමෙ**, ගාත්‍ර විනාමයෙහි වැටේ, ගතු පෙරළීමෙහි වැටේ, ශරීරය පෙරළීමෙහි වැටේ - **නච්චනං**, නැටීම හෝ නටනලද යන අර්ථයෙහි; ' භාවකම්මෙසු න \" යන සූත්‍රයෙන් තප්‍රත්‍යය වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "610"
    },
    {
        "sutta_number": 624,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "624. පච්චයා දනිට්ඨා නිපාතනා සිජ්ඣන්ති.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි - **පච්චයා** ය, **අනිට්ඨා** ය, **නිපාතනා** ය **සිජ්ඣන්ති** ය යනු පදයි. **අනිට්ඨා,** සුත්‍රයන්ගෙන් නිෂ්පන්න නොවූ; **පච්චයා**, ප්‍රත්‍යයෝ; **නිපාතනා**, නිපාතනයෙන්; **සිජ්ඣන්ති**, සිද්ධ වෙත්.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "යෙ ඉධ සප්පච්චයා සද්දා පච්චයෙහි න නිට්ඨං ගතා, තෙ නිපාතනතො සිජ්ඣන්තීති ධාත්වන්තෙන සහ තප්පච්චයස්ස ච්ච ට්ටාදෙසා. නච්චං, නට්ටං. හස හසනෙ, හසනං හසිතං, ඉකාරාගමො. ගමනං ගතං. එවං ඨිතං, සයිතං, වාධිකාරස්ස වවත්ථිතවිභාසත්තා වුද්ධි. රුද අස්සුවිමොචනෙ, අරුජ්ඣිත්ථාති රොදිතං, රුණ්ණං වා ඉච්චාදි. කම්මනි – අභිභූයිත්ථාති අභිභූතො කොධො භවතා, අභිභූතා, අභිභූතං. භාස බ්‍යත්තියං වාචායං, අභාසිත්ථ තෙනාති භාසිතො ධම්මො, භාසිතා ගාථා, භාසිතං සුත්තං. දිසී උච්චාරණෙ, චුරාදිත්තා ණෙ. අදෙසීයිත්ථාති දෙසිතො ධම්මො භගවතා, ඉකාරාගමෙ කාරිතසරලොපො. ජි ජයෙ, අජීයිත්ථාති ජිතො මාරො. නී පාපුණනෙ, අනීයිංසූති නීතා ගාමමජා, සුතො තයා ධම්මො, ඤාතො.",
        "vutti_sanna": "සිව්පදයි. **ඉධ**, මේ මාගධව්‍යාකරණයෙහි; **සප්පච්චයා**, ප්‍රත්‍යය සහිත වූ; **යෙ සද්දා**, යම් ශබ්ද කෙනෙක් ඇද්ද; **පච්චයෙහි**, ප්‍රත්‍යයන් විසින්; **අනිට්ඨංගතා**, නිමාවට නොගියෝ ද; සිද්ධ නොවන ත ප්‍රත්‍යය ප්‍රකෘතීන්ගේ ප්‍රත්‍යයන්ගේද; **උච්චාරණං**, කීම නිපාතන නම් වේ; හනුවූද සිද්ධ නොවෙද්ද; **තෙ**, ඒ සබ්දයෝ නිපාතන හෙයින් සූත්‍රකාරකයා කී හෙයින්; **සිජ්ඣන්තීති**, සිද්ධවෙනුයි සමුදායස්සුච්චාරණෙ නිපාතන සමුදායස්ස සමුදාය සමූහයාගේ ඒ ඒ සූත්‍රයෙන් නොදක්වන ලද සිද්ධ නොවන ප්‍රත්‍යය ප්‍රකෘතීන්ගේ ප්‍රත්‍යයන්ගේ ප්‍රකෘතීන්ගේද; **උච්චාරණං**, කීම නිපාතන නම් වේ. හස යනු; **හසන‍ෙ**, සිනායෙහි වැටේ - ගමයන්නෙහි මකාරයා ' ගමඛනා ' දි සූත්‍රයෙන් ලොප් වේ; ඨානං ඨිතං, සයනං සයිතං - \" අඤ්ඤසු ච \" යන සූත්‍රයට වැටුණු වාකාරයා ධාත්වන්ත වූ ව්‍යංජනයා හා එක්ව ත ප්‍රත්‍යයට \"තරාදීහි ඉණ්ණො \" යන සූත්‍රයෙන් ඉණ්ණ යන ආදෙශව පරයාට ලොප්ව රුණ්ණො යනු වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "573"
    },
    {
        "sutta_number": 625,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "625. සාසදිසතො තස්ස රිට්ඨො ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **සාසදිසතො** ය, **තස්ස** ය, **රිට්ඨො** ය, **ච** ය යනු පදයි. **සාසදිසතො**, √සාසු අනුසිට්ඨියං, √දිස පෙක්ඛණෙ යන ධාතූන් කෙරෙන් පර වූ; **තස්ස**, තප්‍රත්‍යයට; **රිට්ඨො** **ච**, රිට්ඨ යනාදේශද වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තස්ස",
        "vutti": "සාසදිසඉච්චෙතෙහි ධාතූහි පරස්ස තප්පච්චයස්ස රිට්ඨාදෙසො හොති, චසද්දෙන තිස්ස රිට්ඨි ච, දිසතො කිච්චතකාරතුංත්වාදීනඤ්ච රට්ඨ රට්ඨුං රට්ඨාදෙසා ච හොන්ති, රාදිලොපො, අනුසිට්ඨො සො මයා, අනුසිට්ඨා සා, අනුසිට්ඨං. දිස පෙක්ඛණෙ, අදිස්සිත්ථාති දිට්ඨං මෙ රූපං.",
        "vutti_sanna": "සිව්පදයි. **දිසතො**, දිසයන ධාතුහු කෙරෙන් පරවූ; **කිච්ච තකාරතුංත්වාදීනංච**, තබ්බා තය්‍ය යන මේ කිච්ච ප්‍රත්‍යය තකාරය, තුංය, ත්වාය: යන මේ ආදීන්ටද ච ග්‍රහණයෙන් රට්ඨය රට්ඨුංය, රට්ඨුය යන මේ ආදෙශයෝ වෙත්;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "සිට්ඨ",
                "steps": [
                    {
                        "formula": "සාස + ත→රිට්ඨ",
                        "rule": ""
                    },
                    {
                        "formula": "ස්-ආ (ස + ර්)-ඉට්ඨ",
                        "rule": ""
                    },
                    {
                        "formula": "ස්-ආ ඉට්ඨ",
                        "rule": ""
                    },
                    {
                        "formula": "සිට්ඨ",
                        "rule": ""
                    }
                ],
                "final_result": "සිට්ඨ"
            },
            {
                "word": "දට්ඨුං",
                "steps": [
                    {
                        "formula": "දිස + තුං→රට්ඨුං",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-ඉ (ස + ර්) - අට්ඨුං",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-ඉ අට්ඨුං",
                        "rule": ""
                    },
                    {
                        "formula": "දට්ඨුං",
                        "rule": ""
                    }
                ],
                "final_result": "දට්ඨුං"
            },
            {
                "word": "දට්ඨබ්බං",
                "steps": [
                    {
                        "formula": "දිස + තබ්බං",
                        "rule": ""
                    },
                    {
                        "formula": "දිස + ත→රට්ඨ- බ්බං",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-ඉ (ස + ර්) - අට්ඨ-බ්බං",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-ඉ අට්ඨබ්බං",
                        "rule": ""
                    },
                    {
                        "formula": "දට්ඨබ්බං",
                        "rule": ""
                    }
                ],
                "final_result": "දට්ඨබ්බං"
            },
            {
                "word": "දට්ඨෙය්‍යං",
                "steps": [
                    {
                        "formula": "දිස + තෙය්‍යං",
                        "rule": ""
                    },
                    {
                        "formula": "දිස + ත→රට්ඨ- එය්‍යං",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-ඉ (ස + ර්) - අට්ඨ-එය්‍යං",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-ඉ අට්ඨෙය්‍යං",
                        "rule": ""
                    },
                    {
                        "formula": "දට්ඨෙය්‍යං",
                        "rule": ""
                    }
                ],
                "final_result": "දට්ඨෙය්‍යං"
            }
        ],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "574"
    },
    {
        "sutta_number": 626,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "626. සාදි, සන්තපුච්ඡභන්ජහන්සාදීහි ට්ඨො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **සාදිසන්තපුච්ඡභඤ්හංසාදීහි** ය, **ට්ඨො** ය යනු පදයි. **සාදි**, ධාත්වන්ත වූ ආදි බ්‍යඤ්ජනය සහිත වූ; **සන්ත**, සකාරාන්තධාතුය; **පුච්ඡ**, පුච්ඡ **සම්පුච්ඡනෙ** යන ධාතුය; **භඤ්ජ**, භඤ්ජ අවමද්දනෙ යන ධාතුය; **හංසාදීහි**, හංස පීතියං යන මේ ආදි ධාතූන් කෙරෙන් පර වූ; **තස්ස**, ත ප්‍රත්‍යයට; **ට්ඨො**, ට්ඨ යනාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "ආදිනා සහ වත්තතීති සාදි. සකාරන්තෙහි, පුච්ඡ-භන්ජ-හන්සඉච්චෙවමාදීහි ච ධාතූහි පරස්ස අනන්තරිකස්ස තකාරස්ස සහාදිබ්‍යඤ්ජනෙන ධාත්වන්තෙන ට්ඨාදෙසො හොති. හන්සස්ස සතිපි සන්තත්තෙ පුනග්ගහණං ක්වචි ට්ඨාදෙසස්ස අනිච්චතාදීපනත්ථං, තෙන ‘‘විද්ධස්තො උත්‍රස්තො’’තිආදීසු න හොති. තුට්ඨො, සන්තුසිතො.",
        "vutti_sanna": "ත්‍රිපදයි. **ආදිනා සහ**, ආදිහු හා එක්ව, ධාත්වන්තයා හා එක්ව, තමාට ආදි වූ ධාත්වන්තයා හා එක්ව; **වත්තතීති**, පවතීනුයි. ත ප්‍රත්‍යය තෙම; **ආදි**, ආදි නම්වේ, ධාත්වන්තය ආදි කොට ඇත්තා නම් වේ, සාදි නම් ධාත්වන්තයා ආදි කොට ඇති ත ප්‍රත්‍යයයි, සාදි නම් තප්‍රත්‍යයායි, අඛ්‍යයීභාවසමාසයි. **සකාරන්තෙහි**, සකාරයා අන්ත කොට ඇති ධාතූන් කෙරෙන්, පුච්ඡ යන ධාතූන් කෙරෙන් ද පර වූ; **අනන්තරිතස්ස තකාරස්ස**, මධ්‍යයෙහි ව්‍යවධාන නැත්තා වූ, ඉකාරාගමාදීන් විසින් බාධාවක් නැත්තා වූ තකාරයාට; **ධාත්වන්තෙන**, ධාත්වන්ත වූ ආදිබ්‍යංජනයා හා, ත ප්‍රත්‍යයාට ආදි වූ ව්‍යංජනයා හා සමඟ; **ට්ඨාදෙසො හොති**, “සන්ත” යන්නෙහි අර්ථයි “සකාරන්තෙහි” යනු; “සාදි” යන්නෙහි අර්ථයි. “සහ බ්‍යංජනෙන” යනු, “ධාත්වන්තෙන” යනු “සාදි” යන මේ සාමාර්ථයෙන් ලැබිණි; **හන්සස්ස**, හන්ස යන ධාතු; **සන්තත්තෙ සතිපි**, සකාරන්ත බව ඇත ද සකාරයා අන්තකොට ඇති බව ඇත ද, හන යන ධාතුහු සන්ත යන මේ ධාතූන් කෙරෙහි සංග්‍රහ නොකොට පුන ග්‍රහණ සූත්‍රකාරකයා විසින් හන්ස යී කියා නැවත හැදෑරීම “ට්ඨ” යන ආදේශය සකාරාන්ත ධාතූන් කෙරෙන් පර වූ තප්‍රත්‍යයාට නිත්‍යයෙන් නොවන බව අඟවන පිණිසයි. √ධංස යනු; **අවධංසනෙ**, නැසීමෙහි වැටේ. විද්ධංසීති, නැසිණිනුයි යන අර්ථයෙහි “අතීතා” දි සූත්‍රයෙන් තප්‍රත්‍යයව නිග්ගහීත ලොප්ව ද්විත්වව \" විද්ධස්තො '' යනුවේ, නැසිණිනුයි “විද්ධස්ත” නම් වේ; උත්‍රස්තො යන තන්හි උපූර්ව වූ √තස යනු තැතිගැනීමෙහි වැටේ. උත්තසිතො තසිතො යන අර්ථයෙහි තැතිගත්තේ වීනුයි යන අර්ථයෙහි මෙම තබා මහා වෘත්තීන් තකාරස්ථ අකාරය හට රකාරව උත්‍රස්තො යනු වේ; ත්‍රස්ත වීනුයි පීඩිත වීනුයි උත්‍රස්ත නම් වේ; සතුටු වීනුයි තුට්ඨ නම් වේ; සන්තුසිතො යනු පුන ග්‍රහණ සාමයෙහි ට්ඨ යන ආදෙශ නොවූ නියායි; සෙස්සෙහිදු මෙසේ මැයි. සං පූර්ව වූ √තුස පීතිම්හි අතුස්සීති, යන අර්ථයෙහි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "භජ්ජ-භජ්ජනෙ, භජ්ජිත්ථාති භට්ඨං-ධඤ්ඤං. (නිරු.දී.)",
                "steps": [
                    {
                        "formula": "(√----ස+ත)",
                        "rule": "→ = (√----(ස+ත) → ට්ඨ) = = = දිට්ඨ , අනුසිට්ඨ"
                    },
                    {
                        "formula": "(√පුච්ඡ+ත)",
                        "rule": "→ = (√පු(ච්ඡ+ත) → ට්ඨ) = = = පුට්ඨ"
                    },
                    {
                        "formula": "(√භන්ජ+ත)",
                        "rule": "→ = (√භ(න්ජ+ත) → ට්ඨ) = = = භට්ඨ"
                    },
                    {
                        "formula": "(√හන්ස+ත)",
                        "rule": "→ = (√හ(න්ස+ත) → ට්ඨ) = = = හට්ඨ චුතො පරද්ධො භට්ඨො ච, සද්ධම්මා හි නිරඞ්කතො; සංවාසොපි තහිං නත්ථි, තෙනෙතං ඉති වුච්චතී”ති වුත්තං. ( පරිවාරපාලි) කප්පො නට්ඨො හොති, (කප් බිංදුව) ආයස්මා උපනන්දො සක්‍යපුත්තො ගාමං පිණ්ඩාය පවිට්ඨො හොති භට්ඨධඤ්ඤමයො සත්තු, කුම්මාසො යවසම්භවො (කුද්දසික්ඛා)"
                    },
                    {
                        "formula": "අවිජ්ඣාතං අලාතං උක්ඛිපන්තස්සාති ගහණෙන භට්ඨං අනිබ්බුතාලාතං අග්ගිනො සමීපං කරොන්තස්ස, (විනයවිනිච්ඡයටීකා)",
                        "rule": ""
                    },
                    {
                        "formula": "භස්ස භස්සනෙ. භස්සන්ති කථනං වුච්චති ‘‘ආවාසො ගොචරො භස්සං. භස්සකාරක’’න්තිආදීසු විය. භස්සති. භට්ඨං. භට්ඨන්ති භාසිතං, වචනන්ති අත්ථො. (සද්දනීති)",
                        "rule": ""
                    },
                    {
                        "formula": "සචෙ වදති ‘‘එකදිවසං මෙ දන්තකට්ඨං වා රජනඡල්ලිං වා පත්තපචනකදාරුං වා ඡින්නං, ඝංසිත්වා වා නිසිතා’’ති. අථස්සා පොරාණො අග්ඝො භට්ඨොති වෙදිතබ්බො (ස.පා.)",
                        "rule": ""
                    },
                    {
                        "formula": "භජ්ජ-භජ්ජනෙ, භජ්ජිත්ථාති භට්ඨං-ධඤ්ඤං. (නිරු.දී.)",
                        "rule": ""
                    }
                ],
                "final_result": "භජ්ජ-භජ්ජනෙ, භජ්ජිත්ථාති භට්ඨං-ධඤ්ඤං. (නිරු.දී.)"
            }
        ],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "575"
    },
    {
        "sutta_number": 627,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "627. යජස්ස සරස්සි ට්ඨෙ.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **යජස්ස** ය, **සරස්ස** ය**,** **ඉ** ය, **ට්ඨෙ** ය යනු පදයි **යජස්ස**, යජ ධාතුහුගේ; **සරස්ස**, ස්වරයට; ට්**ඨෙ**, ට්ඨ-යනාදේශයා පරකල්හි; **ඉ**, ඉකාරාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තස්ස, සාදිනා",
        "vutti": "යජඉච්චෙතස්ස ධාතුස්ස සරස්ස ඉකාරාදෙසො හොති ට්ඨෙ පරෙ. යිට්ඨො මයා ජිනො. සජ විස්සග්ගෙ සංපුබ්බො, සංසජ්ජිත්ථාති සංසට්ඨො තෙන, විස්සට්ඨො. මජ සුද්ධිම්හි, අමජ්ජීති මට්ඨො ඉච්චාදි.",
        "vutti_sanna": "සිව්පදයයි. √සජ යනු; **විස්සග්ගෙ**, හැරපීමෙහි වැටේ. **විස්සජ්ජිත්ථාති**, හැර පියන ලදනුයි. √මජ යනු, සුද්ධිම්හි, ශුද්ධියෙහි වැටේ. **මට්ඨො**, සිලුටුයි ශුද්ධ කිරීමයි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "612"
    },
    {
        "sutta_number": 628,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "628. භන්ජතො ග්ගො ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **භඤ්ජ** ය, ග්**ගො** ය, **ච** ය යනු පදයි. **භඤ්ජතො**, භඤ්ජ අවමද්දනෙ යන ධාතුහු කෙරෙන් පර වූ; **සාදිනා**, ආදිබ්‍යඤ්ජනය සහිත වූ; **තස්ස**, තප්‍රත්‍යයට; **ග්ගො ච**, ග්ගාදේශද වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තස්ස, අන්තො, නො, ද්වි, චා",
        "vutti": "භන්ජතො ධාතුම්හා තප්පච්චයස්ස සහාදිබ්‍යඤ්ජනෙන ග්ගො ආදෙසො හොති. භග්ගො රාගො අනෙන. වස නිවාසෙ, පරිවසීයිත්ථාති පරිවුට්ඨො පරිවාසො, වුසිතං බ්‍රහ්මචරියං, උට්ඨ උආදෙසා. වස අච්ඡාදනෙ, නිවසීයිත්ථාති නිවත්ථං වත්ථං, ‘‘ක්වචි ධාතූ’’තිආදිනා ස්තකාරසංයොගස්ස ත්ථත්තං, එවං නිවත්ථබ්බං. සංස පසංසනෙ, පසංසීයිත්ථාති පසත්ථො පසංසිතො, පසංසනං පසත්ථි (ප+සංස+ති). බධ බන්ධනෙ, අබජ්ඣිත්ථාති බද්ධො රඤ්ඤා, අලභීයිත්ථාති ලද්ධං මෙ ධනං, ධත්තදත්තානි. (රූ.සි. 607 - 608)",
        "vutti_sanna": "ත්‍රිපදයි. **තෙන**, ඔහු විසින්; රාගය; **භග්ගො**, නසන ලදි, මඩනා ලදි. √**භන්ජ** අවමද්දනෙ යන්නහුටයි. **පරිවාසො**, පරිවාසය තෙම භික්ෂූහු විසින්: **වුත්ථො**, වසන ලදී, √වස යනු **අච්ඡාදනෙ**, වැසීමෙහි වැටේ. වස්ත්‍රයතෙම; **නිවත්ථං**, වසනු ලැබේනුයි නිවත්ථ නම් වේ. නිවත්ථං යන තන්හි මහා වෘත්තීන් අන්තයා හා එකොට ත්ථ යන ආදේශ කරන්නේ, “වසතො උත්ථ” යන සුතුර වස නිවාසෙ යන්නහුට නියම හෙයින් “වස අච්ඡාදනෙ” යනාදීන් කෙරෙන් පරවුව හට මහා වෘත්තිනැයි සේයි; **ස්තකාරසංයොගස්ස**, තකාර සහිත වූ සංයොගය හට, තකාර සංයොගයාට “ත්ථ” යන ආදෙශ වේ; නිවසීයිත්ථාති නිවත්ථබ්බං. පසත්ථි යන්නෙහි තිප්‍රත්‍යයයි. **මයා**, මා විසින්; ධනං ලද්ධං;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "579"
    },
    {
        "sutta_number": 629,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "629. වච වා වු.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **වච** ය, **වා** ය, **ව** ය, **උ** ය, යනු පදයි. **වච**, වච ධාතුහුගේ; **ව**, වකාරය තෙම; **වා**, විකල්පයෙන්; **උ**, උකාරාදේශ වේ; **අන්තො**, ධාන්තාන්ත වූ චකාරයද; **නො**, නොවේ හෙවත් ලොවේ; **තස්ස**, තප්‍රත්‍යයට; **ද්විච**, ද්විත්වද වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "තස්ස, අන්තො, ද්වි, ච",
        "vutti": "චතුප්පදමිදං. වචඉච්චෙතස්ස ධාතුස්ස වකාරස්ස උකාරාදෙසො හොති වා, ධාත්වන්තො ච චකාරො නො හොති, තප්පච්චයස්ස ච ද්විභාවො හොති. වාග්ගහණමවධාරණත්ථං, ධාත්වාදිම්හි වකාරාගමො. වුත්තමිදං භගවතා, උත්තං වා.",
        "vutti_sanna": "සිව්පදයි. **වාග්ගහණමවධාරණත්ථ**, වාග්‍රහණය නියමය පිණිසයි. වච යන ධාතුහුගේ වකාරයාටම උකාරාදෙශ වෙයි යන මේ නියමය හඟවන පිණිසයි; උකාරාදේශද ලොප්ද ද්විත්ව ද නියමයෙන්ම වෙයි සේයි. **ධාත්වාදිම්හි**, ධාතුහුගේ ආදියෙහි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "උත්ත",
                "steps": [
                    {
                        "formula": "වච+ත",
                        "rule": ""
                    },
                    {
                        "formula": "වච+ත→ත්ත",
                        "rule": ""
                    },
                    {
                        "formula": "ව→උ + ත්ත",
                        "rule": ""
                    },
                    {
                        "formula": "උත්ත",
                        "rule": ""
                    }
                ],
                "final_result": "උත්ත"
            },
            {
                "word": "වුත්ත",
                "steps": [
                    {
                        "formula": "(ව්) උත්ත",
                        "rule": ""
                    },
                    {
                        "formula": "වුත්ත",
                        "rule": ""
                    }
                ],
                "final_result": "වුත්ත"
            }
        ],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "581"
    },
    {
        "sutta_number": 630,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "630. ගුපාදීනඤ්ච.",
        "sutta_meaning": "(යනූ විධි සූත්‍රයි. - **ගුපාදීනං** ය, **ච** ය යනු පදයි. **ගුපාදීනං** **ච**, ගුප ගොපනෙ යනාදි ධාතූන්ගේ ද; **අන්තො**, අන්තය තෙම; **නො**, නොවේ හෙවත් ලොප්වේ; **තස්ස**, තප්‍රත්‍යයට; **ද්වි ච**, ද්විත්ව ද වේ.)",
        "sutta_type": "විධි සූත්‍රය (ලොප හා ද්විත්ව විධි)",
        "anuvattana": "තස්ස, අන්තො, නො",
        "vutti": "ගුපඉච්චෙවමාදීනං ධාතූනමන්තො ච බ්‍යඤ්ජනො නො හොති, පරස්ස තකාරස්ස ච ද්විභාවො හොති. ගුප ගොපනෙ, සුගොපීයිත්ථාති සුගුත්තො, සුගොපිතො, ඉකාරෙන බ්‍යවහිතත්තා න ධාත්වන්තලොපො, ‘‘අඤ්ඤෙසු චා’’ති සුත්තෙ වාධිකාරස්ස වවත්ථිතවිභාසත්තා නිට්ඨතකාරෙපි ක්වචි වුද්ධි. ගොපනං ගුත්ති. ලිප ලිම්පනෙ, අලිම්පීයිත්ථාති ලිත්තො සුගන්ධෙන. තප සන්තාපෙ, සන්තපීයිත්ථාති සන්තත්තො තෙජෙන. දීප දිත්තිම්හි, ආදීපීයිත්ථාති ආදිත්තො අග්ගිනා, රස්සත්තං, දීපනං දිත්ති. අප පාපුණනෙ, පාපීයිත්ථාති පත්තො ගාමො, පාපුණීති පත්තො සුඛං, පාපුණනං පත්ති, පත්තබ්බං.",
        "vutti_sanna": "ද්විපදයි. **සුගුත්තො**, මනාකොට රක්ෂා කරන ලදි; **නිට්ඨාතකාරෙපි**, '' සුගොපිතො '' යන තන්හි කර්මයෙහි කළ ප්‍රත්‍යයාට නිට්ඨා නම් වේ, එසේ හෙයින් නිට්ඨාතකාරයා පරකල්හිද “සාමාන්‍ය විධයඃ ප්‍රයොග මනුසරන්ති” යී කී හෙසින් “**අතීතෙ**” යනාදි සූත්‍රයෙන් නිට්ඨා ප්‍රත්‍යයෝ අසවල් කාරකයෙහි වෙතියි නියම කොට නොකළ හෙයින් නිට්ඨා ප්‍රත්‍යයෝ කර්මාදි ජන වචනයට අවිරුද්ධ පරිද්දෙන් වෙත්; **සාමාන්‍ය විධයඃ**, සාමාන්‍යයෙන් දැක්වූ විධීහු; **ප්‍රයොගමනුසරන්ති**, ශිෂ්ට ප්‍රයොගානුසාරයෙන් වෙත්. බාහ්‍යයෙහි නිට්ඨා-තකාරයා පරකල්හි විධි ප්‍රතිෂෙධය එසෙයින් “**ක්වචි**” යි කීහු. ලිප යනු, **ලිම්පනෙ**, ආලිම්පනයෙහි වැටේ, සුවඳ ආදි ගැල්වීමෙහි වැටේ, √දීප යනු; **දිත්තිම්හි**, දිලිහිමෙහි වැටේ. **අග්ගිනා**, ගිනි විසින්; **ආදිත්තො**, දිලියෙන ලදි. **පුරිසෙන ගාමො පත්තො**; **පාපුණිති**, පුරුෂයා පැමිණිනුයි පත්ත නම් වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "582"
    },
    {
        "sutta_number": 631,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "631. භිදාදිතො ඉන්න-අන්න-ඊණා වා.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි - **භිදාදිතො** ය, **ඉන්නාන්නඊණා** ය, **වා** ය යනු පදයි. **භිදාදිතො**, භිද විදාරණ යනාදී ධාතූන් කෙරෙන් පරවූ; **තස්ස**, ත ප්‍රත්‍යයට; **වා**, විකල්පයෙන්; **ඉන්නාන්න ඊණා**, **ඉන්න අන්න ඊණ** යන මේ ආදේශයෝ වෙත්; **අන්තො**, ධාත්තන්ත වූ බ්‍යඤ්ජනය තෙම**;** **නො**, නොවේ; හෙවත් ලොප් වේ.)",
        "sutta_type": "විධි සූත්‍රය (ආදේශ විධි හා ලොප විධි)",
        "anuvattana": "තෙ, නො, තිම්හි, අන්තො",
        "vutti": "භිදඉච්චෙවමාදීහි ධාතූහි පරස්ස තප්පච්චයස්ස ඉන්න අන්න-ඊණඉච්චෙතෙ ආදෙසා හොන්ති වා, අන්තො ච නො හොති. වවත්ථිතවිභාසත්ථොයං වාසද්දො, සරලොපාදි. භිදි විදාරණෙ, අභිජ්ජිත්ථාති භින්නො ඝටො භවතා, භිජ්ජීති වා භින්නො දෙවදත්තො. ඡිදි ද්විධාකරණෙ, අඡිජ්ජිත්ථාති ඡින්නො රුක්ඛො, අච්ඡින්නං චීවරං, උච්ඡිජ්ජීති උච්ඡින්නො. අදීයිත්ථාති දින්නො සුඞ්කො. සද විසරණගත්‍යාවසානෙසු, නිසීදීති නිසින්නො. ඛිද උත්තාසනෙ, ඛිද දීනභාවෙ වා, අඛිජ්ජීති ඛින්නො. අන්නාදෙසෙ ඡද අපවාරණෙ, අච්ඡාදීයිත්ථාති ඡන්නො, පටිච්ඡන්නං ගෙහං, පසීදීති පසන්නො. පද ගතිම්හි, උප්පජ්ජීති උප්පන්නො, ඣානං සමාපන්නො. රුදි අස්සුවිමොචනෙ, රුණ්ණො, පරලොපො. ඛී ඛයෙ ඊණාදෙසො, අඛීයීති ඛීණො දොසො, ඛීණා ජාති, ඛීණං ධනං. හා චාගෙ, ‘‘ක්වචි ධාතූ’’තිආදිනා හාදිතො ඊණාදෙසෙ ණකාරස්ස නත්තං, පහීයිත්ථාති පහීනො කිලෙසො, පරිහායීති පරිහීනො. ආස උපවෙසනෙ, අච්ඡීති ආසීනො. ලී සිලෙසනෙ, ලීයීති ලීනො, නිලීනො. ජි ජයෙ, ජියීති ජීනො විත්තමනුසොචති, ජිතො වා.",
        "vutti_sanna": "ත්‍රිපදයි. භිද යනු **විදාරණෙ**, දෙකක් කිරීමෙහි වැටේ. **අභිජ්ජිත්ථාති**, බිඳින ලදනුයි; **වා**, නොහොත්; භිජ්ජිති, බිදිණිනුයි. **උච්ඡිජ්ජිති**, සිඳිනා ලදනුයි උච්ඡින්න නම් වේ; **දින්නා**, දෙනලදි. සුංක නම් මං තොට ආදියෙහි සිට ගන්නා කර වූ වරයි, අයයි, සද යනු; **විසරණ**, ඇරපීමෙහිද; **ගති**, ගමන්හිද; **අවසාදනෙ**, වැසීමෙහි ගමන් වැළ කීමෙහි ද වැටේ. **නිසීදිති**, හිඳිනුයි. ඛිද යනු; **උත්තාසනෙ**, උත්‍රාස කිරීමෙහි වැටේ; **වා**, නොහොත් ඛිද යනු; **දීනභාවෙ**, බැගෑවීමෙහි දිළිඳු වීමෙහි වැටේ. **අඛිජ්ජිති**, උත්‍රාස වීනු නොහොත්; දිළිඳුවී නුයි ඛින්න නම් වේ. √ඡද යනු, **අපවාරණෙ**, වැළකීමෙහි වැටේ. සැඟවීමෙහි වැටේ ඡන්නො, වසන ලදි. “සද විසරණාදි ධාතු හට කතෘකාරකයෙහි ත ප්‍රත්‍යය ව “පසන්තො” යනු වේ. සමාපජ්ජතීති, සං ආ පූර්ව වූ √පද ගතිම්හි යන්න කර්තෘ. √රුදි යනු; **අස්සු විමොචනෙ**, කඳුළු වැහීමෙහි වැටේ. **අරොදීති රුන්නො** කතෘයි. ක්ෂය වීනුයි ඛීණ නම් වේ. **හාදිතො**, √හා යන මේ ආදීන් කෙරෙන් පරවූ; **ඊණෙ**, ඊණ යන ආදෙශයාගේ ණකාරයාට නකාරවේ. **පහීයිත්ථාති**, පිරිහෙන ලදනුයි. පහීන නම්; **පරිහායීති** පිරිහිණිනුයි **පරිහීන** නම් වේ; ඉකාර වේ‍. **අච්ඡීති**, හුන්නුයි. √ලී යනු, **සිලෙසන‍ෙ**, හැලීමෙහි වැටේ. ලීයති සැඟවිණිනුයි ලීන නම් වේ. පරයට ලොපි. √ජර වයොහානිම්හි යන ධාතුහට “ජරමරා” දී සූත්‍රයෙන් ජීර යන ආදෙශව යවත්ව වූ තකාරයා “තස්ස ච වග්ගා” දි සූත්‍රයෙන් යකාරව ජීයති යනු වේ. මේ ආඛ්‍යාත වාක්‍යයි. ජර- යන්නහුගේ අන්තය හට “රකාරො ච” යන සූත්‍රයෙන් ලොප්වේ. ත ප්‍රත්‍යයාට ඊන යන ආදෙශව ජීන යනු වේ, නොහොත්; √ජර වයො හානිම්හි;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "584"
    },
    {
        "sutta_number": 632,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "632. රකාරො ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **රකාරො** ය, **ච** ය යනු පදයි. **අන්තො,** ධාවන්ත වූ; **රකාරො** **ච**, රකාරය තෙමේද; **තෙ**, තප්‍රත්‍යයා පරකල්හිද; **තිම්හි**, තිප්‍රත්‍යයා පරකල්හිද; **නො,** නොවේ, හෙවත් ලොප් වේ.)",
        "sutta_type": "ලොප විධි සූත්‍රය",
        "anuvattana": "ලොපො",
        "vutti": "රකාරො ච ධාතූනමන්තභූතො නො හොති තප්පච්චයෙ, තිප්පච්චයෙ ච පරෙ. පකරීයිත්ථාති පකතො කටො භවතා, කතා මෙ රක්ඛා, කතං මෙ පුඤ්ඤං. ‘‘දො ධස්ස චා’’ති එත්ථ චසද්දෙන ටො තස්ස, යථා – සුකටං, දුක්කටං, පුරෙ අකරීයිත්ථාති පුරක්ඛතො, ‘‘පුරසමුපපරීහි කරොතිස්ස ඛඛරා වා තප්පච්චයෙසු චා’’ති ඛකාරො, පච්චයෙහි සඞ්ගම්ම කරීයිත්ථාති සඞ්ඛතො, අභිසඞ්ඛතො, උපකරීයිත්ථාති උපක්ඛතො, උපක්ඛටො, පරිකරීයිත්ථාති පරික්ඛතො. තිප්පච්චයෙ පකරණං පකති. සර ගතිචින්තායං, අසරීති සතො, විසරීති විසටො, (සරණං, සරති එතායාති වා සති, ) නීහරීයිත්ථාති නීහටො. ධර ධාරණෙ, උද්ධරීයිත්ථාති උද්ධටො, අභරීයිත්ථාති භතො, භරණං, භරති එතායාති වා භති. ඉකාරාගමයුත්තෙසු ‘‘ගමිතො’’තිආදීසු ධාත්වන්තලොපෙ සම්පත්තෙ –",
        "vutti_sanna": "ද්විපදයි. ධාත්වන්ත රකාර තෙම ලොප්වේ. ප්‍රකර්ෂයෙන් කරන ලදනුයි **පකත** නම් වේ; **අකරීයිත්ථාති** **කටො**; **භවතා**, පින්වත්හු විසින් කරන ලද නම් වේ. **රක්ඛා මෙ කතා**, මා විසින් රක්ෂා තොමෝ කරන ලදු; **අකරීයිත්ථාති**, කතා; **තස්ස**, තප්‍රත්‍යයාට; **ටො**, ට කාර යෙක් වේ; **සුකරීයිත්ථාති**, සුවසේ කරන ලදනුයි සුකට නම් වේ; දුකරීයිත දුකින් කරන ලදනුයි දුක්කට නම් වේ; පෙර කරන ලද නුයි පුරක්ඛත නම් වේ; අවිජ්ජාදි ප්‍රත්‍යයන් විසින් එක්ව කරන ලද නුයි සංඛාරාදි තෙම **සංඛත** නම් වේ; **අභිසංකරීයිත්ථාති**, මනා කොට කරන ලදනුයි **අභිසංඛට** නම් වේ; කරන සේ ලදනුයි **උපක්ඛිත** නම් වේ; හාත්පසින් කරන ලදනුයි **පරික්ඛත** නම් වේ; කිරීම් මාත්‍රය **පකති** නම් වේ; සිතානුයි **සති** නම් වේ; සිහි යි; පතළේයි **විසට** නම් වේ; රක්ෂා කෙරේනුයි විස්තරයෙන් සිතන ලද දෙයයි; **එතාය**, මේ සතිය කරණ කොටගෙන සීකිරීම් හෝ සී කෙරේනුයි **සති** නම් වේ; හරන ලදනුයි **නීහට** නම් වේ. √**හර හරණෙ.** උදුරන ලද්දේ **උද්ධට** නම් වේ; රක්ෂා කරන ලදනුයි **භත** නම් වේ. √භර භරණෙ; **එතාය**, මේ රක්ෂාව කරණ කොටගෙන. **ඉකාරාගමයුත්තෙසු**, ඉකාරාගම යුක්ත වූ; ඉකාරාගමයා විසින් “යථාගමමිකරුරො” යන සූත්‍රයෙන් ආගම වූ ඉකාරයා විසින් යුක්ත වූ; **ගමිතොති ආදිසු**, “ගමිතො” යනාදි උදාහරණයෙහි; ඉකාරාගමයා විසින් යුක්ත වූ ත ප්‍රත්‍යයා පරකල්හි; **ධාත්වන්තලොපෙ සම්පත්තෙ** ධාත්වන්තයාට “ගමඛනහනරමාදීනමන්තො” යන සූත්‍රයෙන් ලොප් ප්‍රතිෂෙධ කළ කල්හි",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "589"
    },
    {
        "sutta_number": 633,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "633. නමකරානමන්තානං නියුත්තතම්හි.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි - **නමකරානං** ය, **අන්තානං** ය, **න** ය, **ඉයුත්තතම්හි** ය යනු පදයි. **අන්තානං**, ධාත්වන්ත වූ; **නමකරානං**, **න**කාර **ම**කාර **ක**කාර **ර**කාරයන්ට; **ඉයුත්තතම්හි**, ඉකාරයෙන් යුක්ත වූ තප්‍රත්‍යයා පරකල්හි; **ලොපො**, ලොපය තෙම; **න**, නොවේ.)",
        "sutta_type": "විධි සූත්‍රය (පටිසෙධ?)",
        "anuvattana": "කත්තරි",
        "vutti": "නකාර මකාර කකාර රකාරානං ධාත්වන්තානං ලොපො න හොති ඉකාරාගමයුත්තෙ තකාරෙ පරෙති ලොපාභාවො.",
        "vutti_sanna": "සිව්පදයි. ධාත්වන්ත වූ නකාරය, මකාරය කකාරය, රකාරය, යන මොවුන්ට ඉකාරයා පූර්ව කොට ඇති තප්‍රත්‍යයා පරකල්හි ලොප් නොවෙයි කියා මේ සූත්‍රයෙන් ලොප් ප්‍රතිෂෙධ වේ,",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "619"
    },
    {
        "sutta_number": 634,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "634. කම්මනි දුතියායං ක්තො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **කම්මනි** ය, **දුතියායං** ය, **තා** ය යනු පදයි. **කම්මනි**, කර්මයෙහි; **දුතියායං**, ද්විතීයා විභක්තිය ඇති කල්හි; **කත්තරි**, කතෘකාරකයෙහි; **ක්තො**, ධාතූන් කෙරෙන් පරව ක්ත ප්‍රත්‍යය වේ.)",
        "sutta_type": "ප්‍රත්‍යය විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "කම්මත්ථෙ දුතියායං විභත්තියං විජ්ජමානායං ධාතූහි කත්තරි ක්තප්පච්චයො හොති. ඉදමෙව වචනං ඤාපකං අභිහිතෙ කම්මාදිම්හි දුතියාදීනමභාවස්ස. දානං අදාසීති අත්ථෙ ක්තප්පච්චයො, ‘‘ක්වචි ධාතූ’’තිආදිනා පච්චයකකාරස්ස ලොපො, තස්ස ඉන්නාදෙසො, දානං දින්නො දෙවදත්තො. රක්ඛ පාලනෙ, සීලං අරක්ඛීති සීලං රක්ඛිතො, භත්තං අභුඤ්ජීති භත්තං භුත්තො, ගරුං උපාසීති ගරුමුපාසිතො ඉච්චාදි.",
        "vutti_sanna": "ත්‍රිපදයි. **කම්මත්ථෙ**, කර්මාර්ථයෙහි වු “කම්මත්ථෙ දුතියා” යන සූත්‍රයෙන් කමාර්ථයෙහි වූ \"කාලද්ධානා\" දී සූත්‍රයෙන් සෙසු අර්ථයෙහි නොවු දුතියා විභක්තියක් ඇති කල්හි පුර්වපද කල්හි. කකාර අනු බන්ධ මාත්‍රයකින් ඇත්තේ තප්‍රත්‍යය මැයි, අනුබන්ධ වන්නේ කාරිය පිණිස හෝ සලකුණු පිණිස හෝයි, මේකකාරය සලකුණු පිණිස අනුබන්ධ වේ, සෙසු තප්‍රත්‍යයෝ නොවෙති, කකාරානුබන්ධ ප්‍රත්‍යයා හඳුනන පිණිස යයි සේයි,\" කම්මෙක්තො \" යි නොකියා කර්මාර්ථයෙහි සෙසු විභක්ති වන හෙයින් '' දුතියායංක්තො \" යී නොකීයේ, දුතියා විභක්තිය සෙසු අර්ථයෙහිදු වන හෙයින් දෙකම කී කල කර්මාර්ථ යෙහි වන සෙසු විහක්තිහු ද, සෙසු අර්ථයෙහි වන දුතියා හැර කමාර්ථය වු දුතියා උපපදකල්හිය යනු හැඟේ. **කම්මාදිම්හි අභිහිතෙ**, කර්මාර්ථ කරණාර්ථ යනාදි උක්ත කල්හි; **දුතියාදීනං අභාවස්ස**, දුතියා තතියා යනාදි විභක්තීන්ගේ නොවී මට; **එත්ථ**, මේ සූත්‍රයෙහි; **ඉදං**, මේ; **වචනං**, \" කම්මණි දුතියායං \" යන මේ වචනයම මේ සූත්‍ර වචනය මේ සූත්‍රයම; **ඤාපකං**, දැනේ - දුතියාදීන් නොවන්නා සෙසු විභක්තීහු වෙති සේයි, කම්මණියනු මතු කිව හොත් සෙසු විභක්තීන්ගේ ප්‍රාප්ත වන හෙයින් \" දුතියායං \" යනු නොකී බවම කම්මාර්ථයෙහිම දුතියාවන තැන සෙසු විභක්තීන් නොවන බවට මෙම ඥාපකයි සේයි, සාමාන්‍ය කොට සෙසු විභක්තීන් චෙතියි කිවද \" වුත්තෙ කම්මණි පඨමා \" යි පරයන්ගේ සූත්‍ර හෙයින් කර්මාදි උක්ත කල්හි ප්‍රථමාම වේ. **පච්චයකකාරස්ස**, ත ප්‍රත්‍යයාගේ අනුබන්ධ කකාරයාට; **තස්ස**, තප්‍රත්‍යයාට. “**දානං**” යනු උපපද වූ √දා දානෙ යන ධාතුයි. **දින්නො**, දෙන ලදී; **රක්ඛිතො**, රක්නා ලදී; **භුත්තො**, කන ලදී; **උපාසිතො**, එළඹෙන ලදී. √ආස උපවෙසනෙ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "දින්න",
                "steps": [
                    {
                        "formula": "දෙවදත්තො දානං දින්නො = අදාසි",
                        "rule": ""
                    },
                    {
                        "formula": "දා+ ක්ත",
                        "rule": ""
                    },
                    {
                        "formula": "දා+ ක්-ත→ඉන්න",
                        "rule": ""
                    },
                    {
                        "formula": "දින්න",
                        "rule": ""
                    }
                ],
                "final_result": "දින්න"
            }
        ],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "628"
    },
    {
        "sutta_number": 635,
        "sub_khanda_id": "03_kitaka_atita",
        "sub_khanda_name": "අතීතප්පච්චයන්තනය",
        "sutta_name": "635. භ්‍යාදීහි මතිබුද්ධිපූජාදීහි ච ක්තො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **භ්‍යාදීහි** ය, **මති-බුද්ධි-පූජාදීහී** ය, **ච** ය, **ක්තො** ය යනු පදයි. **භ්‍යාදීහි**, භී භයෙ යනාදී ධාතූන් කෙරෙන්ද; **මති බුද්ධි පූජාදීහි ච**, √මන ඤාණෙ, √**බුධ** බොධන, √**පූජ** පූජායං යනාදී ධාතූන් කෙරෙන් ද පරව; **ක්තො**, ක්ත ප්‍රත්‍ය වේ.)",
        "sutta_type": "ප්‍රත්‍යය විධි සූත්‍රය",
        "anuvattana": "කත්තරි",
        "vutti": "භීඉච්චෙවමාදීහි ධාතූහි, මති බුද්ධි පූජාදීහි ච ක්තප්පච්චයො හොති. සො ච ‘‘භාවකම්මෙසු කිච්චත්තක්ඛත්ථා’’ති වුත්තත්තා භාවකම්මෙස්වෙව භවති. භී භයෙ, අභායිත්ථාති භීතං භවතා. සුප සයෙ, අසුපීයිත්ථාති සුත්තං භවතා. එවං සයිතං භවතා. අස භොජනෙ, අසිතං භවතා, පචිතො ඔදනො භවතා.",
        "vutti_sanna": "සිව්පදයි. භී යන මේ ආදි ධාතූන් කෙරෙන් පරවද, මෙතන ආදි ශබ්දයෙන් මති ආදි ධාතූන් හඟවන්නේයි; **මති**, √මන ඤාණෙ යන ධාතුහු කෙරෙන් පරව ද; **බුද්ධි**, √බුධ බොධනෙ යන ධාතුහු කෙරෙන් පරව ද; **පූජාදීහි**, පූජ යන මේ ආදී ධාතූන් කෙරෙන් පරවද. “පූජාදීහි ච” යන තැන ආදි ශබ්දය එම පූජාදිග්‍රහණය හඟවන්නේයි;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "භීත",
                "steps": [
                    {
                        "formula": "අභායිත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "භී + ක්ත",
                        "rule": ""
                    },
                    {
                        "formula": "භී + ක්-ත",
                        "rule": ""
                    },
                    {
                        "formula": "භීත",
                        "rule": ""
                    }
                ],
                "final_result": "භීත"
            }
        ],
        "category_badge": "අතීතප්පච්චයන්තනය",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "645"
    }
];
