window.SuttaDatabase = window.SuttaDatabase || {};

window.SuttaDatabase["00_akhyata_intro"] = [
    {
        "sutta_number": 0,
        "sub_khanda_id": "00_akhyata_intro",
        "sub_khanda_name": "ආඛ්‍යාත හැඳින්වීම",
        "sutta_name": "ආඛ්‍යාත හැඳින්වීම",
        "sutta_meaning": "",
        "sutta_type": "හැඳින්වීම",
        "anuvattana": "",
        "vutti": "භූවාදිගණ විභත්තිවිධාන අථ ආඛ්‍යාතවිභත්තියො ක්‍රියාවාචීහි ධාතූහි පරා වුච්චන්තෙ. තත්ථ ක්‍රියං ආචික්ඛතීති ආඛ්‍යාතං, ක්‍රියාපදං. වුත්තඤ්හි ‘‘කාලකාරකපුරිසපරිදීපකං ක්‍රියාලක්ඛණමාඛ්‍යාතික’’න්ති. තත්ථ කාලොති අතීතාදයො, කාරකමිති කම්මකත්තුභාවා, පුරිසාති පඨමමජ්ඣිමුත්තමා, ක්‍රියාති ගමනපචනාදිකො ධාත්වත්ථො, ක්‍රියාලක්ඛණං සඤ්ඤාණං එතස්සාති ක්‍රියාලක්ඛණං, අතිලිඞ්ගඤ්ච.",
        "vutti_sanna": "**ඉදානි පකතිප්පච්චයවසෙන ආක්ඛ්‍යාතරූපසිද්ධිං දස්සෙතුං ''අථ ආඛ්‍යාත විභත්තියො\"තිආදි** **ආරද්ධං**, පකති සංඛ්‍යාත වූ ධාතු වශයෙන්ද ති ආදී විභක්ති සංඛ්‍යාත වූ ප්‍රත්‍ය වශයෙන්ද ආඛ්‍යාත පදයන්ගේ සිද්ධිය දක්වනු පිණිස \"අථ\" යනාදී දැන් පටන් ගන්නා ලදි. **අථ**, තද්ධිත කියා ඉක්බිත්තෙන්; **ආඛ්‍යාතවිභත්තියො**, ආඛ්‍යාත විභක්තීහු; ක්‍රියාවාවී ධාතුන් කෙරෙන්; **පරා**, පරව; **වුච්චන්තෙ**, කියනු ලැබෙත්. ''ආඛ්‍යාතවිභත්තියො\" යන මෙයින් තද්ධිත කිතකාදි ප්‍රත්‍යයන් සේ දූරවාචී ව නොකියා* ක්‍රියා විභාග කරන හෙයින් ති-ආදි ප්‍රත්‍යයන් තද්ධිතාදි ප්‍රත්‍යයන් කෙරෙන් වෙන් කොට දැක්වූ නියායි; කත්තාදිවසයෙන් ලිංගාර්ථාදී ප්‍රකාශයෙන් **ස්‍යාදීහු** නාමවිභක්තීහු නම් වෙත්; කර්ත්‍රාදි වශයෙන් ධාත්වර්ථය විභාග කරන හෙයින් **ත්‍යාදීහු** ආඛ්‍යාතවිභක්තීහු නම් වෙත්. ධාතුහු යන මෙයින් ලිංගාඛ්‍යාත වූ නාම ප්‍රකෘතිහු කෙරෙන් ධාතු සංඛ්‍යාත වූ ආඛ්‍යාත ප්‍රකෘතීහු දැක්වූ නියායි, \"ක්‍රියාවාචීහි\" යන මෙයින් කිත් ප්‍රත්‍යයාන්තයාගෙන් අර්ථවාචී භූපචාදි ( ධාතුන් කෙරෙන්) ක්‍රියාවාචී වූ ධාතූන් වෙන් කොට දැක්වූ නියායි, \" ක්‍රියාවාචීහි පරා\" යි නොකියා ධාතූහි යනු කීයේ කුමක් පිණිසද යත්? භවති පචති යනාදි ක්‍රියා පදයා කෙරෙන් පරව ක්‍රියා විභක්ති නොවන පිණිසය, \"අථ\" යනාදි කී ඉක්බිත්තෙන් ශබ්දාර්ථ හෙයින්ද ලක්ෂණ හෙයින්ද ආඛ්‍යාතය දක්වනු පිණිස \"තත්ථ\" යනාදි කියන ලදි. **තත්ථ**, ඒ ආදි වාක්‍යයෙහි; **ක්‍රියං**, භවනාදි ධාත්වර්ථය: **ආචික්ඛතීති**, කියානුයි ආඛ්‍යාත නමි; මේ ශබ්දාර්ථයි; ආඛ්‍යාත නම් කිමෙක්ද යත්; ක්‍රියාපදං, ගච්ඡති පඨති යනාදි ක්‍රියා පදයැ. මෙයින් සරූප කී නියායි; **ක්‍රියතෙ ඉති**, කරනු ලැබේනුයි ගච්ඡති යනාදියෙහි ගමනාදි ක්‍රියා කර්ත්තෘන් විසින් කරනු ලැබේනුයි; **ක්‍රියා**, ක්‍රියා නම් වේ. සාධ්‍යය සිද්ධය යන මේ ක්‍රියාවන් අතුරෙන් ආඛ්‍යාත විෂයෙහි සාධ්‍ය ක්‍රියා කියනු ලැබේ. සාධ්‍ය ක්‍රියා නම් සපයන ලබන ක්‍රියාවයි. පෙරම සිද්ධ නොව දැන් සිද්ධ වන \"භවති” යනාදියෙහි භවනාදි ක්‍රියායි. සිද්ධ ක්‍රියා නම් '' බුද්ධෝ \" යනාදියෙහි බුජ්ඣන ක්‍රියා යනාදි පෙරම සිද්ධ ක්‍රියායි. ක්‍රියාව කියන හෙයින් ආඛ්‍යාත වන බව සාධන්නෝ '' වුත්තං හි \" යනාදි කියත්, **වුත්තං හි, මහානිරුත්තියං**,*යි සේයි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ආඛ්‍යාත හැඳින්වීම",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ"
    }
];
