window.SuttaDatabase = window.SuttaDatabase || {};

window.SuttaDatabase["02_akhyata_adesa"] = [
    {
        "sutta_number": 476,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "476. ඉසුයමූනමන්තො ච්ඡො වා.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ඉසුයමානං** ය, **අන්තො** ය, **ච්ඡො** ය, **වා** ය යනු පදයි. **ඉසුයමානං**, ඉසු ඉච්ඡායං ය යමු උපරමෙය යන; **ධාතූනං**, ධාතූන්ගේ; **අන්තො**, අන්තය තෙම; **වා**, විකල්පයෙන්; **ච්ඡො,** ච්ඡ යනාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "වා, අන්තලොපො",
        "vutti": "ඉසුයමුඉච්චෙතෙසං ධාතූනං අන්තො ච්ඡො හොති වා. වවත්ථිතවිභාසත්ථොයං වාසද්දො, ‘‘අන්තො ච්ඡො වා’’ති යොගවිභාගෙන ආසස්සපි. සො සග්ගං ඉච්ඡති, ඉච්ඡන්ති. ඉච්ඡසි, ඉච්ඡථ. ඉච්ඡාමි, ඉච්ඡාම. ච්ඡාදෙසාභාවෙ අසංයොගන්තත්තා ‘‘අඤ්ඤෙසු චා’’ති වුද්ධි, එසති, එසන්ති ඉච්චාදි.",
        "vutti_sanna": "චතුෂ්පදයි. **ආසස්සපි**, ආස උපවෙසන‍ෙ යන ධාතුහටද ආස උපවෙසනෙ යන ධාතුහුගේ අන්තයා හටද ච්ඡ යන ආදෙශ වේ; **ආස,** යන ධාතු; **උපවෙසනෙ**, හිඳීමෙහි වැටේ; ච්ඡ යන ආදෙශ නොවූ තැන්හි සංයොග නොවූව වූ අන්ත කොට ඇති හෙයින් '' අඤ්ඤෙසු ච '' යන සූත්‍රයෙන් වෘද්ධිව එසති යනු වේ;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "ඉච්ඡති",
                "steps": [
                    {
                        "formula": "ඉසු ඉච්ඡාකන්තීසු",
                        "rule": "= = ජිනවචන..."
                    },
                    {
                        "formula": "ඉසු",
                        "rule": "= = භුවාදයො ධාතවො"
                    },
                    {
                        "formula": "ඉස්-උ",
                        "rule": "= = ධාතුස්සන්තො & ධාතුලිඞ්ගෙහි ... & වත්තමානා ති.. & වත්තමානා පච්චුප්පන්නෙ & අථ පුබ්බානි .. & කත්තරි .. & ද්වෙ ද්වෙ පඨම..."
                    },
                    {
                        "formula": "ඉස් + ති, අන්ති",
                        "rule": "= = නාමම්හි පයුජ්ජමානෙපි ..."
                    },
                    {
                        "formula": "ඉස් + ති",
                        "rule": "= = (එකම්හි වත්තබ්බෙ ...)"
                    },
                    {
                        "formula": "ඉස් + අ + ති",
                        "rule": "= = භුවාදිතො අ"
                    },
                    {
                        "formula": "ඉ-ස් ච්ඡ + අ + ති",
                        "rule": "= = ඉසුයමූනමන්තො ච්ඡො වා"
                    },
                    {
                        "formula": "ඉච්ඡ්-අ+ අ + ති",
                        "rule": "= = පුබ්බ.... & සරලොපො ... & නයෙ පරං .."
                    },
                    {
                        "formula": "ඉච්ඡති",
                        "rule": ""
                    }
                ],
                "final_result": "ඉච්ඡති"
            },
            {
                "word": "එසති",
                "steps": [
                    {
                        "formula": "ඉසු ඉච්ඡාකන්තීසු",
                        "rule": "= = ජිනවචන..."
                    },
                    {
                        "formula": "ඉසු",
                        "rule": "= = භුවාදයො ධාතවො"
                    },
                    {
                        "formula": "ඉස්-උ",
                        "rule": "= = ධාතුස්සන්තො & ධාතුලිඞ්ගෙහි ... & වත්තමානා ති.. & වත්තමානා පච්චුප්පන්නෙ & අථ පුබ්බානි .. & කත්තරි .. & ද්වෙ ද්වෙ පඨම..."
                    },
                    {
                        "formula": "ඉස් + ති, අන්ති",
                        "rule": "= = නාමම්හි පයුජ්ජමානෙපි ..."
                    },
                    {
                        "formula": "ඉස් + ති",
                        "rule": "= = (එකම්හි වත්තබ්බෙ ...)"
                    },
                    {
                        "formula": "ඉස් + අ + ති",
                        "rule": "= = භුවාදිතො අ"
                    },
                    {
                        "formula": "ඉ > එ -ස් + අ + ති",
                        "rule": "= = අඤ්ඤෙසු ච"
                    },
                    {
                        "formula": "එස්+ අ + ති",
                        "rule": "= = පුබ්බ.... & සරලොපො ... & නයෙ පරං .."
                    },
                    {
                        "formula": "එසති",
                        "rule": ""
                    }
                ],
                "final_result": "එසති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "524"
    },
    {
        "sutta_number": 477,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "477. ලභස්මා ඊ ඉංනං ත්ථත්ථං.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ලභස්මා** ය, **ඊ ඉන්නං** ය, **ත්ථත්ථං** ය යනු පදයි. **ලභස්මා**, ලභ ධාතු කෙරන් පර වූ; **ඊ ඉන්නං**, ඊ විභක්ති ඉං විභක්ති දෙකට; **වා**, විකල්පයෙන්; **ත්ථත්ථං**, ත්ථ ත්ථං යන ආදේශ දෙකවෙත්; **අන්තලොපො**, ධාත්වන්තයට ලොප්ද වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "ලභඉච්චෙතස්මා ධාතුතො පරෙසං ඊඉංනං විභත්තීනං ත්ථ ත්ථංඉච්චෙතෙ ආදෙසා හොන්ති වා, ධාත්වන්තස්ස ලොපො ච. අලත්ථ, අලභි, ලභි, අලභිංසු, ලභිංසු. අලභො, ලභො, අලභි, ලභි, අලභිත්ථ, ලභිත්ථ. අලත්ථං, අලභිං, ලභිං, අලභිම්හ, ලභිම්හ ඉච්චාදි.",
        "vutti_sanna": "ත්‍රිපදයි. **ලභ ඉච්චෙතස්මා ධාතුතො පරෙසං ඊ ඉන්නං, විභත්තීනං ත්ථත්ථං ඉච්චෙතෙ ආදෙසා හොන්ති වා ධාත්වන්තස්ස ලොපො ච**, ලභ යන මේ ධාතුහු කෙරෙන් පර වූ ඊය ඉංය යන විභක්තීන් දෙදෙනා පිළිවෙළින් ත්ථය ත්ථංය යන මේ ආදෙශයෝ වෙත්. ධාතු අන්තය හට ලොපුදු වේ; අලභි යනු විකල්පයෙන් ත්ථ යන ආදෙශ නොව හ්‍රස්ව වූ තැනි; ඔකාරය හට ඉකාරව අලභි යනු වී; හ්‍රස්වව අලභිම්හ ලභිම්හ යනු වී,",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "අලත්ථ",
                "steps": [
                    {
                        "formula": "ඊ > ත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "ඉං > ත්ථං",
                        "rule": ""
                    },
                    {
                        "formula": "ලභ + ඊ",
                        "rule": ""
                    },
                    {
                        "formula": "(අ)+ලභ + ඊ",
                        "rule": ""
                    },
                    {
                        "formula": "(අ)+ලභ + ඊ → ත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "අලත්ථ",
                        "rule": ""
                    }
                ],
                "final_result": "අලත්ථ"
            },
            {
                "word": "අලත්ථං",
                "steps": [
                    {
                        "formula": "ලභ + ඉං",
                        "rule": ""
                    },
                    {
                        "formula": "(අ)+ලභ + ඉං",
                        "rule": ""
                    },
                    {
                        "formula": "(අ)+ලභ + ඉං → ත්ථං",
                        "rule": ""
                    },
                    {
                        "formula": "අලත්ථං",
                        "rule": ""
                    }
                ],
                "final_result": "අලත්ථං"
            },
            {
                "word": "ලච්ඡති",
                "steps": [
                    {
                        "formula": "ලභ+ස්සති",
                        "rule": ""
                    },
                    {
                        "formula": "ලභ්+ස්ස>ඡ- ති",
                        "rule": ""
                    },
                    {
                        "formula": "ල-භ්>ච් ඡති",
                        "rule": ""
                    },
                    {
                        "formula": "ලච්ඡති",
                        "rule": ""
                    }
                ],
                "final_result": "ලච්ඡති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "499"
    },
    {
        "sutta_number": 478,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "478. වච වස වහාදීනමුකාරො වස්ස යෙ.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **වචවසවහාදීනං** ය, **උකාරො** ය, **වස්ස** ය, **යෙ** ය යනු පදයි. **වචවසවහාදීනං**, වච බ්‍යත්තව චෙය, **වස** **නිවාසෙය**, වහ පාපුණනෙ ය, යනාදි ධාතූන්ගේ; **වස්ස**, වකාරයට; **යෙ**, යප්‍රත්‍යයා පරකල්හි; **උකාරො**, උකාරාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "වච වස වහඉච්චෙවමාදීනං ධාතූනං වකාරස්ස උකාරො හොති යප්පච්චයෙ පරෙ, ආදිසද්දෙන වඩ්ඪස්ස ච. ‘‘වස්ස අ ව’’ඉති සමාසෙන දුතියඤ්චෙත්ථ වග්ගහණං ඉච්ඡිතබ්බං, තෙන අකාරස්සපි උකාරො හොති, පුරිමපක්ඛෙ පරලොපො. ‘‘තස්ස චවග්ග’’ඉච්චාදිනා සධාත්වන්තස්ස යකාරස්ස චකාරො, ද්විත්තං. උච්චතෙ, උච්චන්තෙ. වුච්චතෙ, වුච්චන්තෙ. වුච්චති, වුච්චන්ති වා ඉච්චාදි. තථා වචතු, වුච්චතු. වචෙය්‍ය, වුච්චෙය්‍ය. අවචා, අවච්චා, අවචූ, අවච්චූ. අවච, අවචො, අවචුත්ථ. අවච, අවචං, අවචම්හා. අවචුත්ථ ඉච්චාදි.",
        "vutti_sanna": "චතුෂ්පදයි. **වඩ්ඪස්ස ච**, වඩ්ඪ යන ධාතුහුගේ වකාරය හටද උකාරයෙක් වේ; වස්ස අ යි කියා විග්‍රහ ගෙන තත්පුරුෂ සමාස කළ කල්හි \" ව \" යී කියා සිද්ධ වේ; **එත්ථ**, මේ සූත්‍රයෙහි; **වස්ස**, වකාරයාගේ; **අ**, අකාර තෙම; **ව ඉති**, ව නම් වෙයි කියා සමාස හෙයින් සමාස විසින් දුතිය වකාරයට උකාර වෙයි කී ආදි පක්ෂයට දෙවනුව ග්‍රහණ නම් ඇති අකාරයාගේ ගැන්ම; **ඉච්ඡිතබ්බං**, කැමැති විය යුත්තේයි; වචාදි ධාතුන්ගේ වකාර තෙම කෙවලවත් සිටි සමාසවත් සිටිය යන මේ අර්ථද්වයය එහෙයින් ආදි පක්ෂය කෙවලව සිටි අන්ත පක්ෂය සමාසව සිටී - වකාරය හට උකාර වන පක්ෂයෙහි කෙවලව සිට්ටි අකාරය හට උකාරවන පක්ෂයෙහි සමාසව සිට්ටියි සේයි. **පුරිමපක්ඛෙ පරලොපො**, ආදි පක්ෂයෙහි වකාරය හට උකාර වූ පක්ෂයෙහි; **පරලොපො**, පර අකාරය හට '' වා පරො අසරූපා '' යන සූත්‍රයෙන් ලොප් වේ; \"තස්ස චවග්ගයකාරවකාරත්තං සධාත්වන්තස්ස '' ද්විත්තං, තස්ස යනාදි සූත්‍රයෙන් ධාත්වන්තයා සහිත වූ ය ප්‍රත්‍යය හට වකාරයෙක් වෙයි \" පරද්වෙ \" යනාදි සූත්‍රයෙන් ද්විත්ව ද වේ; වුච්චති යනාදි පරස්සපදා දෙසයි වුච්චතු වුච්චෙය්‍ය යනු පරස්ස පදා දෙස වූ තැනි අවචා යනාදි හීයත්තනී යනු සිද්ධයි. ආහට හ්‍රස්ව ව අවච යනු වී ඌ හට භ්‍රස්ව ව අවචු යනු වී ඔහට අත්ව ව අවච යනු වී, ත්ථාය පරකල්හි උකාරාගමව අවචුත්ථ යනු වී අ හට අං ච අවචං යනු වී අත්තනොපද ප්‍රථමෛක වචනය හට ත්ථ ව අවචුත්ථ යනු වී.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "ව",
                "steps": [
                    {
                        "formula": "වස්ස අ",
                        "rule": "= (වයන්නේ ඇති අයන්න = වකාරස්ථ අකාරය)"
                    },
                    {
                        "formula": "ව + අ",
                        "rule": "= = (විභක්ති ලෝපය)"
                    },
                    {
                        "formula": "ව",
                        "rule": ""
                    }
                ],
                "final_result": "ව"
            },
            {
                "word": "උච්චතෙ",
                "steps": [
                    {
                        "formula": "වො වං වෙන වස්ස වම්හා වස්ස වම්හි",
                        "rule": ""
                    },
                    {
                        "formula": "01 විකල්පය",
                        "rule": "ව >උ = = වයන්නට උයන්න"
                    },
                    {
                        "formula": "02 විකල්පය",
                        "rule": "ව්-අ > උ = = වයන්නේ අයන්නට උයන්න"
                    },
                    {
                        "formula": "වච + ය+ තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "ව >උ ච්-අ + ය+ තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "උ (ච්+ය) > ච් > ච්ච + තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "උච්චතෙ",
                        "rule": ""
                    }
                ],
                "final_result": "උච්චතෙ"
            },
            {
                "word": "වුච්චතෙ",
                "steps": [
                    {
                        "formula": "වච + ය+ තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "ව්-අ >උ ච්-අ + ය+ තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "ව්-උ (ච්+ය) > ච් > ච්ච + තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "වුච්චතෙ",
                        "rule": ""
                    }
                ],
                "final_result": "වුච්චතෙ"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "489"
    },
    {
        "sutta_number": 479,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "479. වචස්සජ්ජතනිම්හි මකාරො ඔ.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **වචස්ස** ය, **අජ්ජතනිස්මිං** ය, **අකාරො** ය, **ඔ** ය යනු පදයි. **අජ්ජතනිස්මිං,** අජ්ජතනි විභක්ති පරකල්හි; **වචස්ස**, වචධාතුහුගේ, **අකාරො**, (වකාරස්ථ) අකාරය තෙම; **ඔ**, ඔකාරය වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "වා, අන්තලොපො",
        "vutti": "වචඉච්චෙතස්ස ධාතුස්ස අකාරො ඔත්තමාපජ්ජතෙ අජ්ජතනිම්හි විභත්තිම්හි. අවොචි, අවොචුං. අවොචො, අවොචුත්ථ. අවොචිං, අවොචුම්හ, උකාරාගමො. අවොච, රස්සත්තං, අවොචු ඉච්චාදි. අවුච්චිත්ථ.",
        "vutti_sanna": "චතුෂ්පදයි. වච යන ධාතුහුගේ අන්තය හට ඔකාර ව ඊ ප්‍රත්‍යය හට හ්‍රස්ව ව අවොචි යනු වී; ත්ථ ම්හා යන මොවුන් පර කල්හි උකාරාගමව අවොචුත්ථ යනු වී අවොචුම්හා යි වී. අත්තනොපද ප්‍රථමෛකවචනය හට ''ක්විචි ධාතු\" යනාදි සූත්‍රයෙන් හ්‍රස්ව ව අවච යනු වී කර්තෘ විෂයෙහි අජ්ජතනි අත්තනොපද එකවචනය හට ත්ථ ව අවචිත්ථ යනු වී.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "අවොචි",
                "steps": [
                    {
                        "formula": "වච + ඊ",
                        "rule": ""
                    },
                    {
                        "formula": "(අ) + වච + ඊ",
                        "rule": ""
                    },
                    {
                        "formula": "(අ) + ව්-අ>ඔ ච + ඊ>ඉ",
                        "rule": ""
                    },
                    {
                        "formula": "අවොචි",
                        "rule": ""
                    }
                ],
                "final_result": "අවොචි"
            },
            {
                "word": "වක්ඛති",
                "steps": [
                    {
                        "formula": "වච+ ස්සති",
                        "rule": ""
                    },
                    {
                        "formula": "වච්+ ස්ස> ඛ ති",
                        "rule": ""
                    },
                    {
                        "formula": "ව ච්>ක්+ ඛති",
                        "rule": ""
                    },
                    {
                        "formula": "වක්ඛති",
                        "rule": ""
                    }
                ],
                "final_result": "වක්ඛති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "479"
    },
    {
        "sutta_number": 480,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "480. කුසස්මා දී ච්ඡි.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **කුසස්මා** ය, **ඊ** ය, ච්**ඡි** ය යනු පදයි. **කුසස්මා**, කුස අක්කොසෙ යන ධාතුහු කෙරෙන් පර වූ; **ඊ**, ඊ විභතිය; **වා,** විකල්පයෙන්; **ච්ඡි,** යනාදේශ වේ; **අන්තලොපො**, ධාත්වන්තයට ලොප් ද වේ.)",
        "sutta_type": "විධි සූත්‍රය (ආදේශ හා ලොප විධි)",
        "anuvattana": "යෙ",
        "vutti": "කුස ඉච්චෙතස්මා ධාතුතො ඊවිභත්තිස්ස ච්ඡිආදෙසො හොති, ධාත්වන්තස්ස ලොපො ච. අක්කොච්ඡි මං, අක්කොසි වා. අක්කොසිස්සති. අක්කොසිස්ස ඉච්චාදි. වහ පාපනෙ, වහති, වහන්ති.",
        "vutti_sanna": "ත්‍රිපදයි. කුස යන ධාතුහු කෙරෙන් පර වූ ඊකාරය හට ච්ඡි යන ආදෙශව වෘද්ධි තන්හි ඊහට භ්‍රස්ව ව අක්කොසි යනු වේ. කාලාති පත්ති ස්සා හට හ්‍රස්ව ව අක්කොසිස්ස යනු වී, වහ යන ධාතු, **පාපනෙ**, ඉසිලීමෙහි වැටේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "500"
    },
    {
        "sutta_number": 481,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "481. හ විපරියයො ලො වා.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **හවිපරියයො** ය, **ළො** ය, **වා** ය යනු පදයි. **යෙ,** යප්‍රත්‍යයා පරකල්හි; **හවිපරියයො**, හකාරයාගේ විපර්යාසය වේ; **වා**, විකල්පයෙන්; **ළො**, (යප්‍රත්‍යයට) ළකාරාදේශ වේ.)",
        "sutta_type": "විධි සූත්‍රය (විධි)",
        "anuvattana": "",
        "vutti": "හකාරස්ස විපරියයො හොති යප්පච්චයෙ පරෙ, යප්පච්චයස්ස ච ලකාරො හොති වා. වවත්ථිතවිභාසත්ථොයං වාසද්දො, තෙන ‘‘ගය්හතී’’තිආදීසු ලත්තං න හොති, නිමිත්තභූතස්ස යකාරස්සෙවෙතං ලත්තං, ‘‘වචවස’’ඉච්චාදිනා උත්තං. වුය්හති, වුල්හති, වුය්හන්ති. වහතු, වුය්හතු. (කම්මෙ = වහ+ය+තු) වහෙය්‍ය, වුය්හෙය්‍ය. අවහී, අවුය්හිත්ථ, අවහිත්ථ. අවහිස්සති, වුය්හිස්සති. අවහිස්ස, අවුය්හිස්ස ඉච්චාදි. ජර වයොහානිම්හි.",
        "vutti_sanna": "ත්‍රිපදයි. **හකාරස්ස**, හකාරයාගේ; **විපරියයො**, විපරීතය තෙම ( උඩු යටිව පෙරළීම තෙම); **හොති**, වේ; **එතං ලත්තං**, මේ ලකාරාදෙශත්වය නම්, හකාරයාගේ විපරියත්තය හට නිමිත්ත වූ යකාරයාටමයි. අවහි යනු වූයේ අජ්ජතනි ඊ හටයි. අජ්ජතනි අත්තනොපද ප්‍රථමෛක වචනය හට ත්ථ යන ආදෙශ වූ තැනි වුය්හිත්ථ අවහිත්ථ යනු, අවිහිස්ස යනාදි කාලාතිපත්තියටයි, **ජර** යන ධාතු, **වයො හානිම්හි**, වයස් පිරිහීමෙහි වැටේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "490"
    },
    {
        "sutta_number": 482,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "482. ජරමරානං ජීරජීය්‍යමීය්‍යා වා.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ජරමරානං** ය, **ජීරජීය්‍යමීයා** ය, වා ය යනු පදයි. **ජරමරානං**, **ජර** වයොහානිම්හිය; **මර** පාණචාගෙය, යන ධාතු දෙකට; **වා**, විකල්පයෙන්; **ජිර ජිය්‍ය මීයා**, ජීර ජීය්‍ය මීය යන ආදෙශයෝ වෙත්.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "ජරමර ඉච්චෙතෙසං ධාතූනං ජීරජීය්‍යමීය්‍යාදෙසා හොන්ති වා, සරලොපාදි. ජීරති, ජීරන්ති. ජීය්‍යති, ජීය්‍යන්ති. ‘‘ක්වචා’’දිසුත්තෙන එකයකාරස්ස ක්වචි ලොපො හොති. ජීයති, ජීයන්ති. කම්මෙ ජීරීයති, ජීරීයන්ති. ජීයිය්‍යති, ජීයිය්‍යන්ති. ජීරතු, ජීය්‍යතු. ජීරෙය්‍ය, ජීය්‍යෙය්‍ය. අජීරී, ජීරී, ජීය්‍යී. ජීරිස්සති, ජීය්‍යිස්සති. අජීරිස්ස, අජීය්‍යිස්ස. මර පාණචාගෙ, මීය්‍යාදෙසො, මීය්‍යති, මීය්‍යන්ති. මීයති, මීයන්ති වා. මරති, මරන්ති ඉච්චාදි.",
        "vutti_sanna": "ත්‍රිපදයි. **අජීරි** යනාදි අජ්ජතනිහට උදාහරණයයි, **අජීරිස්ස** යනාදි කාලාතිපත්ති; මර යන ධාතු, පාණචාගෙ දිවි ගැලවීමෙහි වැටේ. **මීය්‍යාදෙසො**, මර යන ධාතු හට මීය්‍ය යන ආදේශ වේ. මීය්‍ය යන ආදෙශයා එක් යකාරයක් හට ලොප් ව මීයති යනාදි වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "507"
    },
    {
        "sutta_number": 483,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "483. දිසස්ස පස්ස දිස්ස දක්ඛා වා.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **දිසස්ස** ය, පස්සදිස්ස දක්ඛා ය, **වා** ය යනු පදයි. **දිසස්ස**, දිසපෙක්ඛණෙ යන ධාතුහට; **වා**, විකල්පයෙන්;**පස්ස දිස්ස දක්ඛා**, පස්ස දිස්ස දක්ඛ යන මේ ආදේශයෝ වෙත්.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "සබ්බත්ථ, ක්වචි",
        "vutti": "දිසඉච්චෙතස්ස ධාතුස්ස පස්ස දිස්ස දක්ඛඉච්චෙතෙ ආදෙසා හොන්ති වා. වවත්ථිතවිභාසත්ථොයං වාසද්දො, තෙන දිස්සාදෙසො කම්මනි සබ්බධාතුකෙ එව. පස්සති, පස්සන්ති. දක්ඛති, දක්ඛන්ති. කම්මනි යකාරලොපො, දිස්සතෙ, දිස්සන්තෙ. දිස්සති, දිස්සන්ති. විපස්සීයති, දක්ඛීයති. පස්සතු, දක්ඛතු, [දිස්සතු. ] පස්සෙය්‍ය, දක්ඛෙය්‍ය, [දිස්සෙය්‍ය.] හිය්‍යත්තනියං ‘‘ක්වචි ධාතූ’’තිආදිනා ධාතුඉකාරස්ස අත්තං, අද්දසා, අද්දස. කම්මනි අදිස්ස. තථා අපස්සි, පස්සි, අපස්සිංසු, පස්සිංසු. අපස්සි, පස්සි, අපස්සිත්ථ, පස්සිත්ථ. අපස්සිං, පස්සිං, අපස්සිම්හ, පස්සිම්හ. අද්දසි, දසි, අද්දසංසු, දසංසු. කම්මනි අදිස්සංසු. අද්දක්ඛි, අද්දක්ඛිංසු. පස්සිස්සති, පස්සිස්සන්ති. ‘‘භවිස්සන්තිම්හි ස්සස්ස චා’’ති යොගවිභාගෙන ස්සස්ස ලොපො, ඉකාරාගමො ච, දක්ඛිති, දක්ඛින්ති. ලොපාභාවෙ දක්ඛිස්සති, දක්ඛිස්සන්ති. අපස්සිස්ස, අදක්ඛිස්ස ඉච්චාදි. සද විසරණගත්‍යාවසානෙසු.",
        "vutti_sanna": "ත්‍රිපදයි. **තෙන**, වා ශබ්දයා නිශ්චිත වූ විකල්පය අර්ථ කොට ඇති හෙයින් දිස්ස යන ආදෙශ තෙම; **කම්මණි**, කර්මයෙහි වූ; **සබ්බධාතුකෙයෙව**, සාර්ව ධාතුකයන් විෂයෙහි මැයි. **දිස්සති** යනාදි පරස්ස පදාදි වූ තැනි. **ධාතු**, ධාතුහුගේ; ත්ථයාට ථ ව අදිස්සථ යනු වී, ඔකාරයාට ඉකාරව අපස්සි යයි යනු වී. \"කරස්ස කා\" යනාදි සූත්‍රයෙහි සත්තමජ්ජතනිම්හි* යන යොග විභාගයෙන් සකාරාගමව ඊහට හ්‍රස්ව ව අද්දසාසි යනු වී, අජ්ජතනි අත්තනොපද උත්තම පුරිස එක වචනයාට අං ව අද්දසං යනු වී. ''භවිස්සන්තිම්හි ස්සස්ස චා\" ති **යොගවිභාගෙන**, හොතිස්සරො යනාදි සූත්‍රයෙහි \"භවිස්සන්තිම්හි ස්සස්ස ච\" යන යොගවිභාගයෙන් ස්ස හට ද ලොපුදු වේ; ඉන්ම ඉකාරයෙක් ආගම වෙ, **සද** යන ධාතු; **විසරණ**, විසිරයාමය; **ගති**, ගමන්හිය; **අවසාදනෙසු**, හැම්මීමෙහිදු වැටේ, හිඳීමෙහි යයි සේයි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "473"
    },
    {
        "sutta_number": 484,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "484. සදස්ස සීදත්තං.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **සදස්ස** ය, **සීදත්තං** ය යනු පදයි. **සදස්ස**, සද ධාතු හට; **සබ්බත්ථ**, සෑම තන්හි; **සීදත්තං**, සීදබව වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "යම්හි",
        "vutti": "සදඉච්චෙතස්ස ධාතුස්ස සීදාදෙසො හොති සබ්බත්ථ විභත්තිප්පච්චයෙසු ක්වචි. සෙසං නෙය්‍යං. නිසීදති, නිසීදන්ති. භාවෙ නිසජ්ජතෙ, ඉධ ක්වචාධිකාරෙන සීදා-දෙසො න භවති. නිසීදතු. නිසීදෙ. නිසීදි. නිසීදිස්සති. නිසීදිස්ස ඉච්චාදි. යජ දෙවපූජා-සඞ්ගතිකරණ-දානෙසු. යජති, යජන්ති.",
        "vutti_sanna": "ද්විපදයි. **සබ්බත්ථ**, කත්තු කම්මභාව යන මෙහි; නිසජ්ජතෙ යන **ඉධ**, මෙහි; ක්වචි යනු වැටුණු හෙයින් සිද යන ආදෙශ නොවේ; යවත් වූ දකාරයාට ජකාරව ද්විත්ව ව නිසජ්ජතෙ යනු වේ. හිඳිනා ලැබේ. **යජ** යන ධාතු, **දේවපූජා**, දෙවතාවන් පිදීමෙහිද; **සංගතිකරණතා**, ද්‍රව්‍ය රැස් කිරීමෙහි ද; **දානෙසු**, දීමෙහිද වැටේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "611"
    },
    {
        "sutta_number": 485,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "485. යජස්සාදිස්සි.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **යජස්ස** ය, **ආදිස්ස** ය, **ඉ** ය යනු පදයි. **යම්හි,** යප්‍රත්‍යයා පරකල්හි; **යජස්ස**, යජ දෙවච්චනෙ යන ධාතුහු ගේ; **ආදිස්ස**, පූර්ව වූ යකාරයට; **ඉ**, ඉකාරාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "වා",
        "vutti": "යජඉච්චෙතස්ස ධාතුස්ස ආදිස්ස යකාරස්ස ඉකාරාදෙසො හොති යප්පච්චයෙ පරෙ, සරලොපො. ඉජ්ජතෙ මයා බුද්ධො. තථා යජතු, ඉජ්ජතං. යජෙ, ඉජ්ජෙථ. යජි, ඉජ්ජිත්ථ. යජිස්සති, ඉජ්ජිස්සතෙ. යජිස්ස, ඉජ්ජිස්සථ ඉච්චාදි.",
        "vutti_sanna": "ත්‍රිපදයි. **සරලොපො**, යකාරස්ථ අකාරය හට ලොප් වේ; යජෙ යනු එය්‍ය හට එවූ තැනි. ඉජ්ජෙථ යනු වේ. අත්තනොපදයි. යජි යනු අජ්ජතනියි. අජ්ජතනි අත්තනොපද පඨම පුරිසෙක වචනය හට ත්ථව යජිත්ථ යනු වී.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "ඉජ්ජතෙ",
                "steps": [
                    {
                        "formula": "√යජ + ය + තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "ය>ඉ ජ් - අ + ය + තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "ඉ (ජ්+ය) > ජ > ජ්ජ + තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "ඉජ්ජතෙ",
                        "rule": ""
                    }
                ],
                "final_result": "ඉජ්ජතෙ"
            },
            {
                "word": "ඉජ්ජිත්ථ",
                "steps": [
                    {
                        "formula": "√යජ + ය + ආ (අජ්ජතනී-අත්තනොපද-පඨමපුරිස-එකවචන)",
                        "rule": ""
                    },
                    {
                        "formula": "ය>ඉ ජ් - අ + ය + ආ>ත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "ඉ (ජ්+ය) > ජ > ජ්ජ + (ඉ) + ත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "ඉජ්ජිත්ථ",
                        "rule": ""
                    }
                ],
                "final_result": "ඉජ්ජිත්ථ"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "505"
    },
    {
        "sutta_number": 486,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "486. වදස්ස වජ්ජං.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **වදස්ස** ය, **වජ්ජං** ය, යනු පදයි. **වදස්ස**, වද වචනෙ යන ධාතු හට; **වා**, විකල්පයෙන්; **වජ්ජං**, වජ්ජා දේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "වා",
        "vutti": "වදඉච්චෙතස්ස ධාතුස්ස සබ්බස්ස වජ්ජාදෙසො හොති වා සබ්බාසු විභත්තීසු. විභත්‍යාධිකාරත්තා චෙත්ථ සබ්බාසූති අත්ථතො සිද්ධං.",
        "vutti_sanna": "ද්විපදයි. **සබ්බස්ස වදඉච්චෙතස්ස ධාතුස්ස**, **විභත්‍යධිකාරත්තා චෙත්ථ සබ්බාසූති අත්ථතො සිද්ධං**, යන මේ, සූත්‍රයෙන් සූත්‍රයට විභත්ති යනු වැටුණු හෙයින් සබ්බාසු යනු අර්ථයෙන් සිද්ධයි. කරණ හෙයින් සිද්ධයි, විභක්ති යනු සාමාන්‍ය වචනයක් හෙයින් සබ්බාසු යනු වැටේ මැයි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "502"
    },
    {
        "sutta_number": 487,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "487. ලොපඤ්චෙත්තමකාරො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ලොපං** ය, **ච** ය, **එත්තං** ය, **අකාරො** ය යනු පදයි. **අකාරො**, (භූ ආදීන් කෙරෙන් පර වූ) අකාර ප්‍රත්‍යය තෙම; **එත්තං**, එකාර බවට පැමිණේ; **වා,** විකල්පයෙන්; **ලොපං ච**, ලොපටද පැමිණේ.)",
        "sutta_type": "විධි සූත්‍රය (ලොප හා ආදේශ විධි)",
        "anuvattana": "",
        "vutti": "භූවාදිතො පරො අප්පච්චයො එත්තමාපජ්ජතෙ, ලොපඤ්ච වා. විකරණකාරියවිධිප්පකරණතො චෙත්ථ අකාරොති අප්පච්චයො ගය්හති.",
        "vutti_sanna": "චතුෂ්පදයි. **විකරණ කාරිය විධිප්පකරණතො**, අං ආදි විකරණ ප්‍රත්‍යයන්ගේ කාරිය කී ප්‍රස්ථාව හෙයින්; **එත්ථ**, මේ සූත්‍රයෙහි; **අකාරොති**, අකාරයයි කියා; **අප්පච්චයො ගය්හති**, අප්‍රත්‍යය ගන්නා ලැබේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "512"
    },
    {
        "sutta_number": 488,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "488. ක්වචි ධාතුවිභත්තිප්පච්චයානං දීඝවිපරීතාදෙසලොපාගමා ච.",
        "sutta_meaning": "(යනු පරිභාෂා සූත්‍රය. - **ක්වචි** ය, **ධාතුවිභත්තිප්පච්චයානං** ය, **දීඝවිපරීතාදෙසලොපාගමා** ය, **ච** ය යනු පදයි. **ක්වචි**, (මේ ධාත්වධිකාරයෙහි ආඛ්‍යාත කිතක දෙක්හි) සමහර තැනෙක; **ධාතුවිභත්තිප්පච්චයානං**, ධාතුය විභක්තිය ප්‍රත්‍යය යන මොවුන්ට; **දීඝවිපරීතාදෙසලොපාගමා ච**, දීර්ඝය, තද් විපරීතය, ආදේශය, ලොපය, ආගමය, යන මොහුද වෙත්.)",
        "sutta_type": "පරිභාෂා සූත්‍රය",
        "anuvattana": "අබ්භාසස්ස, අන්තෙ,වා",
        "vutti": "ඉධ ධාත්වාධිකාරෙ ආඛ්‍යාතෙ, කිතකෙ ච අවිහිතලක්ඛණෙසු පයොගෙසු ක්වචි ධාතූනං, ත්‍යාදිවිභත්තීනං, ධාතුවිහිතප්පච්චයානඤ්ච දීඝතබ්බිපරීතආදෙසලොපාගමඉච්චෙතානි කාරියානි ජිනවචනානුරූපතො භවන්ති. තත්ථ – නාම්හි රස්සො කියාදීනං, සංයොගෙ චඤ්ඤධාතුනං; ආයූනං වා විභත්තීනං, ම්හා, ස්සාන්තස්ස ච රස්සතා. ගමිතො ච්ඡස්ස ඤ්ඡො වාස්ස, ගමිස්සජ්ජතනිම්හි ගා; උචාගමො වා ත්ථම්හෙසු, ධාතූනං යම්හි දීඝතා. එය්‍යෙය්‍යාසෙය්‍යාමෙත්තඤ්ච, වා ස්සෙස්සෙත්තඤ්ච පාපුණෙ; ඔකාරා අත්තමිත්තඤ්ච, ආත්ථා පප්පොන්ති වා ත්ථථෙ.",
        "vutti_sanna": "චතුෂ්පදයි. **ඉධ ධාත්වධිකාරෙ**, මේ ප්‍රථම ධාත්වධිකාර වූ ආදි කොට ධාතූන් කියන ලද; **ආඛ්‍යාතෙ**, ආඛ්‍යාතයෙහි ද; **කිතකෙ ච**, කිතකයෙහි ද; **අවිහිත ලක්ඛණෙසු පයොගෙසු**, නොකරන ලද සූත්‍ර ඇති ප්‍රයෝගයෙහි; සිද්ධයෙහි; **ධාතූනං**, ධාතූන්ටද; **ත්‍යාදි විභත්තීනං**, ති ආදි විභක්තීන්ටද; **ධාතුවිහිතප්පච්චයානං**, ධාත්වර්ථයට විහිත වූ ප්‍රත්‍යයන්ටද; ධාතූන්ගේ අර්ථයෙහි වන ඛඡාදි ප්‍රත්‍යයන්ට ද. දීර්ඝය ආදෙශය ලොපය ආගමය තබ්බිපරීත ග්‍රහණයෙන් ගත් හ්‍රස්වද යන මේ කාර්යයෝ ජිනවචනයට අවිරුද්ධ පරිද්දෙන්; **ක්වචි භවන්ති**, සමහර උදාහරණයෙක වෙත්; **තත්ථ**, ඒ දීර්ඝාදීන් අතුරෙන් හ්‍රස්වය ආදි කොට කියනු ලැබේ. **නාම්හි**, නා විකරණයා පරකල්හි; '' කියාදිතො නා\" යන සූත්‍රයෙන් වූ නාප්‍රත්‍යයා පරකල්හි; **කියාදීනං**, කියාදි ධාතූන්ට ද; **රස්සො**, හ්‍රස්වය වේ; **අඤ්ඤධාතූනං**, දා ධා ඨා යනාදි සෙසු ධාතූන් ටද; **සංයොගෙ ච**, භවිස්සන්ති යනාදි සංයොගයා පරිකල්හිද හ්‍රස්ව වේ; **ආයූනං විභත්තීනං**, **ආ**-ය **ඊ-**ය **ඌ**-ය යන මේ විභක්තීන්ටද, **වා රස්සං**, විකල්පයෙන් හ්‍රස්ව වේ. **ම්හාස්සාන්තස්ස ච රස්සතා**, ම්හා ය ස්සා ය යන මොවුන්ගේ අන්තයාට හ්‍රස්ව වේ. **ගමිතො**, ගමු යන ධාතුහු කෙරෙන්; **ච්ඡස්ස**, ච්ඡ යන ආදෙශයාට; **ඤ්ඡො**, ඤ්ඡ යන ආදෙශ; **වා**, විකල්පයෙන්; **අස්ස**, (භවෙය්‍ය) වන්නේයි; **අජ්ජතනිම්හි ගමිස්ස ගා**, අජ්ජතනි පරකල්හි ගමු යන ධාතූන්ට විකල්පයෙන් ගා යන ආදෙශ වේ. **ත්ථම්හෙසු**, ත්ථය ම්හය යන මොවුන් පරකල්හි; **උ ආගමො**, අජ්ජතනි පරකල්හි ගා යනාදෙශයා කෙරෙන් පරව විකල්පයෙන් උකාරයෙක් ආගම වේ; **යම්හි**, යකාරයා පරකල්හි; **ධාතූනං**, සුයති ජියති යනාදියෙහි ධාතූන්ට; **දීඝතා**, දීර්ඝ බව වේ. **එය්‍යෙය්‍යාසෙය්‍යාමි**, **එය්‍ය** ය **එය්‍යාසි** ය **එය්‍යාමි** ය යන මොවුන්ට **එත්තං ච** (හොති), එත්ත බව විකල්පයෙන් වේ; **ස්සෙස්ස**, ස්සෙ යාගේ එ හට; **අත්තං**, අත්ත බව; **වා**, විකල්පයෙන්; **පාපුණේ**, (පාපුණෙය්‍ය) පැමිණෙන්නේය; **ඔකාරො**, ඔකාර තෙම; **අත්තමිත්තඤ්චා** අජ්ජතනි පරකල්හි අකාර බවද ඉකාර බවද, (**පප්පොති**, විකල්ප යෙන් පැමිණේ;) **ආ-ත්ථා**, අජ්ජතනි හීයත්තනි අත්තනො පදයෙහි **ආ** ය **ත්ථ** ය යන මොවුන් දෙදෙනාට; **ත්ථ-ථෙ වා පප්පොන්ති**, **ත්ථ** ය **ථ** ය යන මොහු දෙදෙන විකල්පයෙන් වෙත්; ආහට ත්ථය ත්ථයහට ථය යන මොහු වෙතියි සේයි;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "519"
    },
    {
        "sutta_number": 489,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "489. නිග්ගහීතඤ්ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි - **නිග්ගහීතං** ය, **ච** ය යනු පදයි. **අබ්භාසස්ස,** අබ්භාස සංඥයාගේ; **අන්තෙ**, අන්තයෙහි; **වා**, විකල්පයෙන්; **නිග්ගහීතඤ්ච**, නිග්ගහීතාගම ද වේ.)",
        "sutta_type": "ආගම විධි සූත්‍රය",
        "anuvattana": "ලොපො, වා",
        "vutti": "අබ්භාසන්තෙ නිග්ගහීතඤ්චාගමො හොති වා. වවත්ථිතවිභාසත්ථොයං වාසද්දො, තෙන කමාදීනමෙවෙතං. චඞ්කමති, චඞ්කමන්ති ඉච්චාදි. කමති, කමන්ති ඉච්චාදි. චල කම්පනෙ, චඤ්චලති, චලති. දල දලනෙ, දද්දල්ලති. ඣෙ චින්තායං, අප්පච්චයෙ ‘‘ඔ, සරෙ, එ’’ති ච අධිකිච්ච ‘‘තෙ ආවායා’’ති යොගවිභාගෙන අකාරිතෙපි එකාරස්ස ආයාදෙසො, ඣායති, ඣායන්ති ඉච්චාදි, විසෙසවිධානං. අවුද්ධිකභූවාදිනයො. තුද බ්‍යථනෙ, ත්‍යාද්‍යුප්පත්ති අප්පච්චයො, ‘‘අඤ්ඤෙසු චා’’ති එත්ථානුවත්තිත වාග්ගහණෙන තුදාදීනං වුද්ධිඅභාවොව විසෙසො, තුදති, තුදන්ති. තුදසි, තුදථ. තුදාමි, තුදාම. කම්මෙ ‘‘තස්ස චවග්ග’’ඉච්චාදිනා සදකාරස්ස යප්පච්චයස්ස ජකාරො ද්විත්තං, තුජ්ජතෙ, තුජ්ජන්තෙ. තුජ්ජති, තුජ්ජන්ති, තුජ්ජරෙ වා. තථා තුදතු, තුදන්තු. තුදෙ, තුදෙය්‍ය, තුදෙය්‍යුං. අතුදි, තුදිංසු. අතුදි, අතුදිත්ථ. අතුදිං, අතුදිම්හ. අතුජ්ජිත්ථ, අතුජ්ජි. තුදිස්සති. අතුදිස්ස ඉච්චාදි. විස පවෙසනෙ පපුබ්බො, සො ගාමං පවිසති, පවිසන්ති. පවිසසි, පවිසථ. පවිසාමි, පවිසාම. කම්මෙ පවිසිය්‍යතෙ, පවිසිය්‍යන්තෙ. පවිසිය්‍යති, පවිසිය්‍යන්ති. පවිස්සතෙ වා.",
        "vutti_sanna": "ද්විපදයි. **අබ්භාසන්තො**, අබ්භාසයාගේ අන්තයෙහි; **තෙත**, ඒ වාග්‍රහණයා වවත්ථිත විකල්ප හෙයින්; **එතං**, මේ නිග්ගහීතාගමය; **කමාදීනං එව**, කමු ආදි ධාතූන්ටමැයි; **චල** යන ධාතු **කම්පනෙ**, කම්පායෙහි වැටේ; **දල** යන ධාතු, **දලනෙ**, බැබළීමෙහි වැටේ. දද්දල්ලති යන තන්හි දල දලනෙ යන ධාතු හට ලොප්ව තිප්‍රත්‍යය අප්‍රත්‍යයව \"ක්වචාදිවණ්ණා\" යනාදි සූත්‍රයෙන් ධාතුහුගේ ආදි හට ද්විත්තව අබ්භාස සංඥාව නිග්ගහීතාගමව \"මදා\" යන යොග විභාගයෙන් හෝ \"ක්වචි ධාතු'' යනාදි මහා වෘත්තීන් හෝ නිග්ගහීතයාට දකාරාදේශව ලකාර ද්විත්වව දද්දල්ලති යනු වී; ‍ **ඣෙ** යන ධාතු, **චින්තායං**, සිතීමෙහි වැටේ; **විසෙස විධානං**, මේ කියා ආයේ විශේෂකාරිය ඇති සූත්‍රයි; **සවුද්ධිකභුවාදිනයො**, වෘද්ධි සහිත වූ වෘද්ධි වන භුවාදීන්ගේ පන්තියි; වෘද්ධි නොවන භූවාදීන් ඇති, එහෙයින් සවුද්ධික යයි කීහු. **තුද** යන ධාතු, **ව්‍යථනෙ**, පීඩායෙහි වැටේ; **සදකාරස්ස**, දකාර සහිත වූ; තුජ්ජති යනු පරස්සපදාදෙශ වූ තැනි, අත්තනොපද පඨම පුරිස බහු වචන අන්තෙ හට මහා වෘත්තීන් රෙ යන ආදෙශව තුජ්ජරෙ යනු වේ. අතුදි යනාදි අජ්ජතනියි. අතුදි යනු ඊහට හ්‍රස්ව වු නියායි. අතුදි යනු ඔහට ඉකාර වූ තැනි. අකර්ම විෂයෙහි අත්තනො පද පඨම පුරිස එක වචනයාට ත්ථව අතුජ්ජිත්ථ යනු වී, එහිම බහු වචනය හට ඉකාරාදෙශව අතුජ්ජි යනු වී. **විස** යන ධාතු, **පවෙසනෙ**, ප්‍රවෙශයෙහි වැටේ, පවිසීයති යනාදි පරස්සපදාදෙශ වූ තැනි. පවිස්සතෙ යනු පරස්සපදාදෙශ නොව යකාරයාට පුර්ව රූප වූ තැනි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "අහෙසුං",
                "steps": [
                    {
                        "formula": "හූ+උං",
                        "rule": ""
                    },
                    {
                        "formula": "(අ) + හ්-උ>ඔ>එ + (ස්)+උං",
                        "rule": ""
                    },
                    {
                        "formula": "අහෙසුං",
                        "rule": ""
                    }
                ],
                "final_result": "අහෙසුං"
            },
            {
                "word": "අහුං",
                "steps": [
                    {
                        "formula": "හූ+ඉං",
                        "rule": ""
                    },
                    {
                        "formula": "(අ) + හ්-ඌ>උ+ ඉ-ං",
                        "rule": ""
                    },
                    {
                        "formula": "අහුං",
                        "rule": ""
                    }
                ],
                "final_result": "අහුං"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "468"
    },
    {
        "sutta_number": 490,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "490. හොතිස්සරෙහොහෙ භවිස්සන්තිම්හි ස්සස්ස ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **හොතිස්සරො** ය, **එහොහෙ** ය, **භවිස්සන්තිම්හි** ය, **ස්සස්ස** ය, **ච** ය යනු පදයි. **හොතිස්සරො**, හූ-සත්තායං යන ධාතුහුගේ ස්වරය තෙම; **භවිස්සන්තිම්හි**, භවිස්සන්ති විභක්ති පරකල්හි; **එහොහෙ**, එහ ඔහ එ යන මේ ආදේශයන්ට පැමිණේ; **ස්සස්ස** **ච**, ස්සති ප්‍රත්‍යයාදීන්ගේ ස්ස ශබ්දයට ද; **වා**, විකල්පයෙන්; **ලොපො**, ලොප් වේ.)",
        "sutta_type": "විධි සූත්‍රය (ආදේශ හා ලොප විධි)",
        "anuvattana": "ධාතූනං",
        "vutti": "හූඉච්චෙතස්ස ධාතුස්ස සරො එහ ඔහ එත්තමාපජ්ජතෙ භවිස්සන්තිම්හි විභත්තිම්හි, ස්සස්ස ච ලොපො හොති වා. ඉකාරාගමො, සරලොපාදි. හෙහිති, හෙහින්ති. හෙහිසි, හෙහිථ. හෙහාමි, හෙහාම. ලොපාභාවෙ – හෙහිස්සති, හෙහිස්සන්ති. හෙහිස්සසි, හෙහිස්සථ. හෙහිස්සාමි, හෙහිස්සාම. ඔහාදෙසෙ – හොහිති, හොහින්ති. හොහිසි, හොහිථ. හොහාමි, හොහාම. තථා හොහිස්සති, හොහිස්සන්ති. හොහිස්සසි, හොහිස්සථ. හොහිස්සාමි, හොහිස්සාම. එකාරාදෙසෙ – හෙති, හෙන්ති. හෙසි, හෙථ. හෙමි, හෙම. හෙස්සති, හෙස්සන්ති. හෙස්සසි, හෙස්සථ. හෙස්සාමි, හෙස්සාම. භාවෙ හූයිස්සතෙ. කාලාතිපත්තියං අහවිස්ස, අහවිස්සංසු. අහුයිස්සථ ඉච්චාදි. හූ, භූ සත්තායං, භූ ඉතීධ අනුපුබ්බො, ත්‍යාද්‍යුප්පත්ති අප්පච්චයස්ස ලොපවුද්ධියො, අනුභොති, අනුභොන්ති. අනුභොසි, අනුභොථ. අනුභොමි, අනුභොම. කම්මෙ අනුභූයති, අනුභූයන්ති. තථා අනුභොතු, අනුභොන්තු. අනුභොහි, අනුභොථ. අනුභොමි, අනුභොම. (අනුභූයතු, අනුභූයන්තු.-කම්ම) අනුභවෙ, අනුභවෙය්‍ය. (අනුභූයෙය්‍ය. -කම්ම) අනුභොසි, අනුභවි. අනුභොස්සති, අනුභොස්සන්ති. අනුභොස්සසි, අනුභොස්සථ. අනුභොස්සාමි, අනුභොස්සාම. අනුභවිස්සති වා. අනුභොස්ස, අනුභවිස්ස වා ඉච්චාදි. සි සයෙ අප්පච්චයලොපො, වුද්ධි ච, සෙති, සෙන්ති. සෙසි, සෙථ. සෙමි, සෙම. සෙතෙ, සෙන්තෙ ඉච්චාදි.",
        "vutti_sanna": "පස්පදයි. **හොතිස්සරො**, සේ; **හූඉච්චෙතස්ස ධාතුස්ස සරො**, හූ යන මේ ධාතුහුගේ ස්වර තෙම එහ ඔහ ඒ බවට පැමිණේ; **තථා**, එසේ; **ලොපාභාවෙ**, පරස්ස පදාදෙසව අනුභුයති යනාදි වී එය්‍යහට එකාරව අනුභවෙ යනු වේ. අනුභූයෙය්‍ය යනු කර්මයි. අනුභොසි යනු අනුභවි යනු අජ්ජතනියි.'' ඔ අවසරෙ \" යන සූත්‍රයෙන් අව ව අනුභවිස්සති යනු වී. අනුභොස්ස යනාදි කාලාතිපත්තියයි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "482"
    },
    {
        "sutta_number": 491,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "491. එ අය.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **එ** ය, **අය** ය, යනු පදයි. **සරෙ**, ස්වරයා පරකල්හි; **ධාතූනං**, ධාතූන්ගේ; **එ**, (අන්ත වූ) එකාරය තෙම; **අය**, අය යනාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "වා",
        "vutti": "එකාරස්ස ධාත්වන්තස්ස සරෙ පරෙ අයාදෙසො හොති, සරලොපාදි. සයති, සයන්ති. සයසි, සයථ. සයාමි, සයාම. කම්මෙ අතිපුබ්බො, ‘‘ක්වචි ධාත්වා’’දිනා යම්හි රස්සසරස්ස ධාත්වන්තස්ස දීඝො, අතිසීයතෙ, අතිසීයන්තෙ. අතිසීයති, අතිසීයන්ති. භාවෙ සීයතෙ. තථා සෙතු, සෙන්තු. සෙහි, සෙථ. සෙමි, සෙම. සයතු, සයන්තු. සය, සයාහි, සයථ. සයාමි, සයාම. සයතං, සයන්තං. සයස්සු, සයව්හො. සයෙ, සයාමසෙ. (අතිසීයතං, අතිසීයන්තං. අතිසීයතු, අතිසීයන්තු. - කම්ම) භාවෙ සීයතං. සයෙ, සයෙය්‍ය, සයෙය්‍යුං. අතිසීයෙය්‍ය. භාවෙ සීයෙථ. අසයි, සයි, අසයිංසු, සයිංසු, අසයුං. සාගමෙ අතිසෙසි, අතිසෙසුං. කම්මෙ අච්චසීයිත්ථ, අච්චසීයි, අතිසීයි. භාවෙ සීයිත්ථ. සයිස්සති, සයිස්සන්ති. ඉකාරාගමාභාවෙ සෙස්සති, සෙස්සන්ති. කම්මෙ අතිසීයිස්සථ, අතිසීයිස්සති. භාවෙ සීයිස්සතෙ. අසයිස්සා, අසයිස්සංසු. කම්මෙ අච්චසීයිස්සථ ඉච්චාදි. නී පාපුණනෙ, ද්විකම්මකොයං, අජං ගාමං නෙති, නෙන්ති. නෙසි, නෙථ. නෙමි, නෙම. ලොපාභාවෙ නයති, නයන්ති ඉච්චාදි. කම්මෙ නීයතෙ ගාමං අජො දෙවදත්තෙන, නීයරෙ, නීයන්තෙ. නීයති, නීයන්ති.",
        "vutti_sanna": "ද්වීපදයි. **රස්සස්ස**, හ්‍රස්ව වූ; අතිසීයෙථ යනාදි අත්තනොපදයටයි. ප්‍රථම පුරුෂ එක වචන උත්තම පුරුෂ එක වචනයි. **අසයි** යනාදි අජ්ජතනියි. අත්තනොපද ආහට ත්ථව **අච්චසීයිත්ථ** යනු වී. **අච්චසීයි** යනු පරස්ස පදාදෙස වූ තැනි. **අතිසීයිස්සති** පරස්ස පදාදෙසයි. **අසයිස්ස** යනාදි කාලාතිපත්තියි. ද්විකර්මක ධාතු **දුහ යාච රුධි පුච්ඡ - භික්ඛ සාසු වචාදයො** **නී වහ හරාදයො ච - උභයෙතෙ ද්විකම්මකා**",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "516"
    },
    {
        "sutta_number": 492,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "492. ඨා තිට්ඨො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ඨා** ය, **තිට්ඨො** ය යනු පදයි. **ඨා**, ඨා ගතිනිවුත්තියං යන ධාතුවට; **වා**, විකල්පයෙන්; **තිට්ඨො**, තිට්ඨ යනාදේශය වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "ඨාඉච්චෙතස්ස ධාතුස්ස තිට්ඨාදෙසො හොති වා. වවත්ථිතවිභාසත්ථොයං වාසද්දො, අප්පච්චයලොපො. තිට්ඨති, තිට්ඨන්ති. ඨාති, ඨන්ති. ලොපාභාවෙ ‘‘ක්වචි ධාතූ’’තිආදිනා ඨාතො හකාරාගමො ච රස්සත්තං, සංපුබ්බො සණ්ඨහති, සණ්ඨහන්ති. එත්තෙ අධිට්ඨෙති, අධිට්ඨෙන්ති.",
        "vutti_sanna": "ද්විපදයි. **ලොපාභාවෙ**, අප්‍රත්‍යයාට ලොප්නොකළ කල්හි; **එත්තෙ**, '' ලොපඤ්චෙත්ත\" යනාදි සූත්‍රයෙන් අප්‍රත්‍යයාට එත්ව කළ කල්හි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "470"
    },
    {
        "sutta_number": 493,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "493. යම්හි දා ධා මා ඨා හා පා මහ මථාදීනමී.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **යම්හි** ය, **දාධාමාඨාහාපාමහමථාදීනං** ය, **ඊ** ය යනු පදයි. **යම්හි,** යප්‍රත්‍යයා පරකල්හි; **දාධාමාඨාහාපාමහමථාදීනං**, √**දා** දානෙ ය, √**ධා** ධාරණෙ ය, √**මා** පරිමානෙ ය, √**ඨා** ගතිනිවුත්තියං ය, √**හා** චාගෙ ය, √**පා** පානෙ ය, √**මහ** පූජායං ය, √**මථ** විලොලනෙ ය යන; **ආදීනං**, මේ ආදි ධාතූන්ගේ අන්තය තෙම; **ඊ**, ඊකාරය වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "වා",
        "vutti": "භාවකම්මවිසයෙ යම්හි පච්චයෙ පරෙ දා ධා මා ඨා හා පා මහ මථ ඉච්චෙවමාදීනං ධාතූනං අන්තො ඊකාරමාපජ්ජතෙ, නිච්චත්ථොයමාරම්භො. උපට්ඨීයති, උපට්ඨීයන්ති. (හකාරාගමෙ රස්සත්තං, ඊකාරාගමො ච, පතිට්ඨහීයති, පතිට්ඨහීයන්ති.) භාවෙ ඨීයතෙ.",
        "vutti_sanna": "ත්‍රිපදයි. **අයං ආරම්භො**, මේ සූත්‍රය \" ඉවණ්ණාගමො වා \" යන මේ සූත්‍රය ඇතිව නැවත මේ සූත්‍රය කීයේ පටන්ගත්තේ; **නිච්චත්ථො**, නිත්‍යාර්ථ පිණිසයි. දාධා යනාදි ධාතුන් විෂයෙහි ඊකාර බව නිච්චයෙන් වන පිණිසයි. උපට්ඨීයති යනාදි පරස්ස පදාදෙසයි. හකාරාගම කළ කල්හි හ්‍රස්ව බවද ඊකාරාගම බව ද වේ.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "පතිට්ඨහීයති",
                "steps": [
                    {
                        "formula": "ප+ ඨා + (ඊ) + ය + ති",
                        "rule": ""
                    },
                    {
                        "formula": "ප+ ඨා → තිට්ඨ + (හ්)+(ඊ) + ය + ති",
                        "rule": ""
                    },
                    {
                        "formula": "පතිට්ඨහීයති",
                        "rule": ""
                    }
                ],
                "final_result": "පතිට්ඨහීයති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "504"
    },
    {
        "sutta_number": 494,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "494. පා පිබො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **පා** ය, **පිබො** ය යනු පදයි. **පා**, පා පානෙ යන ධාතුවට; **වා** විකල්පයෙන්; **පිබො**, පිබ යනාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "අසස්මා, අන්තලොපො",
        "vutti": "පාඉච්චෙතස්ස ධාතුස්ස පිබාදෙසො හොති වා. වවත්ථිතවිභාසත්ථොයං වාසද්දො. පිබති. පිබතු. පිබෙය්‍ය. ‘‘ක්වචි ධාත්වා’’දිනා බකාරස්ස වකාරො, පිවති, පිවන්ති. පාති, පාන්ති, පන්ති වා. (පීයතෙ, පීයන්තෙ. පීයති, පීයන්ති.- කම්ම) පිවතු. පිවෙය්‍ය. අපායි, පිවි. පිවිස්සති. අපිවිස්ස ඉච්චාදි. √අස භුවි, විභත්තුප්පත්ති, අප්පච්චයලොපො, අස ඉතීධ –",
        "vutti_sanna": "ද්වීපදයි. **පාති**, පාති යනු විකල්පයෙන් පිබ යන ආදෙශ නුවූ තැනි, පීයති යනාදි පරස්සපදාදෙසයි. අපායි යනු අජ්ජතනියි. **අස** යන ධාතු, **භූවි**, වීමෙහි වැටේ. **අසතීධ**, අස යන ධාතු \" අස \" යී සිටි කල්හි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "471"
    },
    {
        "sutta_number": 495,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "495. තිස්ස ත්ථිත්තං.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **තිස්ස** ය, **ත්ථිත්තං** ය යනු පදයි. **අසස්මා**, අසධාතුව කෙරෙන් පර වූ; **තිස්ස**, තිවිභක්තිහට; **ත්ථිත්තං**, ත්ථිබවවේ; **අන්තලොපො**, ධාත්වන්තයට ලොප් ද වේ.)",
        "sutta_type": "විධි සූත්‍රය (ආදේශ හා ලොප විධි)",
        "anuvattana": "වා",
        "vutti": "අසඉච්චෙතස්මා ධාතුම්හා පරස්ස තිස්ස විභත්තිස්ස ත්ථිත්තං හොති, ධාත්වන්තස්ස ලොපො ච. අත්ථි.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "අත්ථි",
                "steps": [
                    {
                        "formula": "අස+ති",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස + ති→ත්ථි",
                        "rule": ""
                    },
                    {
                        "formula": "අත්ථි",
                        "rule": ""
                    }
                ],
                "final_result": "අත්ථි"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "496"
    },
    {
        "sutta_number": 496,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "496. සබ්බත්ථාසස්සාදි ලොපො ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **සබ්බත්ථ** ය, **අසස්ස** ය, **ආදිලොපො** ය, **ච** ය යනු පදයි. **සබ්බත්ථ**, සියලුම විභක්ති ප්‍රත්‍යයන් පරකල්හි, **අසස්ස**, අස ධාතුහු ගේ; **ආදිලොපො** **ච**, පූර්වයට ලොප් ද; **වා**, විකල්පයෙන් වේ.)",
        "sutta_type": "ලොප විධි සූත්‍රය",
        "anuvattana": "අසස්ස, අන්තලොපො",
        "vutti": "සබ්බත්ථ විභත්තිප්පච්චයෙසු ච අසඉච්චෙතාය ධාතුයා ආදිස්ස ලොපො හොති වා, වවත්ථිතවිභාසත්ථොයං වාසද්දො. සන්ති.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "සන්ති",
                "steps": [
                    {
                        "formula": "√අස+අන්ති",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස්-අ + අන්ති",
                        "rule": ""
                    },
                    {
                        "formula": "සන්ති",
                        "rule": ""
                    }
                ],
                "final_result": "සන්ති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "508"
    },
    {
        "sutta_number": 497,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "497. සිම්හි ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **සිම්හි** ය, **ච** ය - යනු පදයි. **සිම්හි** **ච**, සිවිභක්ති පරකල්හිද; **අසස්ස**, අසධාතුහුගේ; **අන්තලොපො**, අන්තයට ලොප් වේ.)",
        "sutta_type": "ලොප විධි සූත්‍රය",
        "anuvattana": "අසස්මා, අන්තලොපො",
        "vutti": "අසධාතුස්ස අන්තලොපො හොති සිම්හි විභත්තිම්හි ච. ත්වං අසි.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "අසි",
                "steps": [
                    {
                        "formula": "√අස+සි",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස + සි",
                        "rule": ""
                    },
                    {
                        "formula": "අසි",
                        "rule": ""
                    }
                ],
                "final_result": "අසි"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "498"
    },
    {
        "sutta_number": 498,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "498. ථස්ස ත්ථත්තං.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **ථස්ස** ය, ;**ත්ථත්තං** ය, යනු පදයි. **අසස්මා**, අසධාතුහු කෙරෙන් පර වූ; **ථස්ස**, ථ විභක්තිහට; **ත්ථත්තං**, ත්ථ-බවවේ; **අන්තලොපො**, ධාත්වන්තයට ලොප්ද වේ.)",
        "sutta_type": "විධි සූත්‍රය (ආදේශ හා ලොප විධි)",
        "anuvattana": "වා",
        "vutti": "අසඉච්චෙතාය ධාතුයා පරස්ස ථස්ස විභත්තිස්ස ත්ථත්තං හොති, ධාත්වන්තස්ස ලොපො ච. තුම්හෙ අත්ථ.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "අත්ථ",
                "steps": [
                    {
                        "formula": "√අස+ථ",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස + ථ→ත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "අත්ථ",
                        "rule": ""
                    }
                ],
                "final_result": "අත්ථ"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "495"
    },
    {
        "sutta_number": 499,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "499. අසස්මා මිමානං ම්හිම්හාන්තලොපො ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **අසස්මා** ය, **මිමානං** ය, **ම්හි ම්හා** ය, **අන්තලොපො** ය, චය යනු පදයි. **අසස්මා,** අසධාතුහු කෙරෙන් පරවූ; **මිමානං**, මි-ම විභක්තීන්ට; **වා**, විකල්පයෙන්; **ම්හි ම්හා** ම්හි ම්හාදේශයෝ වෙත්; **අන්තලොපො ච**, ධාන්තයට ලොප්ද වේ.)",
        "sutta_type": "විධි සූත්‍රය (ආදේශ හා ලොප විධි)",
        "anuvattana": "අසස්මා, අන්තලොපො",
        "vutti": "අසඉච්චෙතාය ධාතුයා පරාසං මි මඉච්චෙතාසං විභත්තීනං ම්හිම්හඉච්චෙතෙ ආදෙසා හොන්ති වා, ධාත්වන්තස්ස ලොපො ච. අම්හි, අම්හ. අස්මි, අස්ම.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "අම්හි// අස්මි",
                "steps": [
                    {
                        "formula": "අස + මි අස+මි",
                        "rule": ""
                    },
                    {
                        "formula": "අ ස + මි→ම්හි අස්-අ+මි",
                        "rule": ""
                    },
                    {
                        "formula": "අම්හි// අස්මි",
                        "rule": ""
                    }
                ],
                "final_result": "අම්හි// අස්මි"
            },
            {
                "word": "අම්හ// අස්ම",
                "steps": [
                    {
                        "formula": "අස + ම අස+ම",
                        "rule": ""
                    },
                    {
                        "formula": "අ ස + ම→ම්හ අස්-අ+ම",
                        "rule": ""
                    },
                    {
                        "formula": "අම්හ// අස්ම",
                        "rule": ""
                    }
                ],
                "final_result": "අම්හ// අස්ම"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "494"
    },
    {
        "sutta_number": 500,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "500. තුස්ස ත්ථුත්තං.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **තුස්ස** ය, **ත්ථුත්තං** ය යනු පදයි. **අසස්මා,** අස-ධාතුහු කෙරෙන් පර වූ; **තුස්ස**, තු-විභක්ති හට; **ත්ථුත්තං**, ත්ථු බව වේ; **අන්තලොපො**, ධාවන්තයට ලොප් වේ.)",
        "sutta_type": "විධි සූත්‍රය (ආදේශ හා ලොප විධි)",
        "anuvattana": "අස්සස්ස, වා",
        "vutti": "අසඉච්චෙතාය ධාතුයා පරස්ස තුස්ස විභත්තිස්ස ත්ථුත්තං හොති, ධාත්වන්තස්ස ලොපො ච. අත්ථු. (අසස්සාදිලොපො ච, සන්තු.) ආහි, අත්ථ. අස්මි, අස්ම.",
        "vutti_sanna": "ද්විපදයි. **අසස්සාදිලොපො ච**, අස යන ධාතුහුගේ ආදී හට ලොපුදු වේ;",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "අත්ථු",
                "steps": [
                    {
                        "formula": "අස+තු",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස + තු→ත්ථු",
                        "rule": ""
                    },
                    {
                        "formula": "අත්ථු",
                        "rule": ""
                    }
                ],
                "final_result": "අත්ථු"
            },
            {
                "word": "සන්තු",
                "steps": [
                    {
                        "formula": "නමත්ථු බුද්ධානං = බුද්ධානං නමො අත්ථු",
                        "rule": ""
                    },
                    {
                        "formula": "√අස+අන්තු",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස්-අ + අන්තු",
                        "rule": ""
                    },
                    {
                        "formula": "සන්තු",
                        "rule": ""
                    }
                ],
                "final_result": "සන්තු"
            },
            {
                "word": "ආහි",
                "steps": [
                    {
                        "formula": "√අස+හි",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස + හි",
                        "rule": ""
                    },
                    {
                        "formula": "අ→ආ + හි",
                        "rule": ""
                    },
                    {
                        "formula": "ආහි",
                        "rule": ""
                    }
                ],
                "final_result": "ආහි"
            },
            {
                "word": "අත්ථ",
                "steps": [
                    {
                        "formula": "√අස+ථ",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස + ථ→ත්ථ",
                        "rule": ""
                    },
                    {
                        "formula": "අත්ථ",
                        "rule": ""
                    }
                ],
                "final_result": "අත්ථ"
            },
            {
                "word": "සියා",
                "steps": [
                    {
                        "formula": "√අස+එය්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස + එය්‍ය →ඉයා",
                        "rule": ""
                    },
                    {
                        "formula": "ස්-අ + ඉයා",
                        "rule": ""
                    },
                    {
                        "formula": "සියා",
                        "rule": ""
                    }
                ],
                "final_result": "සියා"
            },
            {
                "word": "සියුං",
                "steps": [
                    {
                        "formula": "√අස+එය්‍යුං",
                        "rule": ""
                    },
                    {
                        "formula": "අ-ස + එය්‍යුං →ඉයුං",
                        "rule": ""
                    },
                    {
                        "formula": "ස්-අ + ඉයුං",
                        "rule": ""
                    },
                    {
                        "formula": "සියුං",
                        "rule": ""
                    }
                ],
                "final_result": "සියුං"
            },
            {
                "word": "අස්ස",
                "steps": [
                    {
                        "formula": "√අස+එය්‍ය",
                        "rule": ""
                    },
                    {
                        "formula": "අ-(ස + එය්‍ය) →ස්ස",
                        "rule": ""
                    },
                    {
                        "formula": "අස්ස",
                        "rule": ""
                    }
                ],
                "final_result": "අස්ස"
            },
            {
                "word": "අස්සු",
                "steps": [
                    {
                        "formula": "√අස+එය්‍යුං",
                        "rule": ""
                    },
                    {
                        "formula": "අ-(ස + එය්‍යුං) →ස්සු",
                        "rule": ""
                    },
                    {
                        "formula": "අස්සු",
                        "rule": ""
                    }
                ],
                "final_result": "අස්සු"
            },
            {
                "word": "අස්ස",
                "steps": [
                    {
                        "formula": "√අස+එය්‍යාසි",
                        "rule": ""
                    },
                    {
                        "formula": "අ-(ස + එය්‍යාසි) →ස්ස",
                        "rule": ""
                    },
                    {
                        "formula": "අස්ස",
                        "rule": ""
                    }
                ],
                "final_result": "අස්ස"
            },
            {
                "word": "අස්සථ",
                "steps": [
                    {
                        "formula": "√අස+එය්‍යාථ",
                        "rule": ""
                    },
                    {
                        "formula": "අ-(ස + එය්‍යාථ) →ස්සථ",
                        "rule": ""
                    },
                    {
                        "formula": "අස්සථ",
                        "rule": ""
                    }
                ],
                "final_result": "අස්සථ"
            },
            {
                "word": "ආසි",
                "steps": [
                    {
                        "formula": "√අස+ඊ",
                        "rule": ""
                    },
                    {
                        "formula": "අ→ආ ස්-අ+ ඊ →ඉ",
                        "rule": ""
                    },
                    {
                        "formula": "ආසි",
                        "rule": ""
                    }
                ],
                "final_result": "ආසි"
            },
            {
                "word": "ආසුං",
                "steps": [
                    {
                        "formula": "√අස+උං",
                        "rule": ""
                    },
                    {
                        "formula": "අ→ආ ස්-අ+ උං",
                        "rule": ""
                    },
                    {
                        "formula": "ආසුං",
                        "rule": ""
                    }
                ],
                "final_result": "ආසුං"
            },
            {
                "word": "ආසිංසු",
                "steps": [
                    {
                        "formula": "√අස+උං",
                        "rule": ""
                    },
                    {
                        "formula": "අ→ආ ස්-අ+ උං→ඉංසු",
                        "rule": ""
                    },
                    {
                        "formula": "ආසිංසු",
                        "rule": ""
                    }
                ],
                "final_result": "ආසිංසු"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "497"
    },
    {
        "sutta_number": 501,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "501. අසබ්බධාතුකෙ භූ.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **අසබ්බධාතුක** ය, **භූ** ය යනු පදයි. **අසබ්බධාතුකෙ**, අසාර්‍වධාතුකප්‍රත්‍යයා පරකල්හි; **අසස්ස**, අසධාතුහට; **වා**, විකල්පයෙන්; **භූ**, භූ යනාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "",
        "vutti": "අසස්සෙව ධාතුස්ස භූආදෙසො හොති වා අසබ්බධාතුකෙ. භවිස්සති, භවිස්සන්ති. අභවිස්ස, අභවිස්සංසු.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "509"
    },
    {
        "sutta_number": 502,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "502. බ්‍රූතො ඊ තිම්හි.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **බ්‍රෑතො** ය, **ඊ** ය, **තිම්හි** ය යනු පදයි. **තිම්හි,** තිප්‍රත්‍යය පරකල්හි; **බ්‍රෑතො**, බ්‍රෑධාතුහු කෙරෙන් **ක්වචි**, සමහර තැනෙක; **ඊ**, ඊකාරාගම වේ.)",
        "sutta_type": "ආගම විධි සූත්‍රය",
        "anuvattana": "හනස්ස",
        "vutti": "බ්‍රෑඉච්චෙතාය ධාතුයා පරො ඊකාරාගමො හොති තිම්හි විභත්තිම්හි ක්වචි, වුද්ධිඅවාදෙසා, සරලොපාදි. බ්‍රවීති, (බ්‍රෑති, ‘‘අඤ්ඤෙසු චා’’ති සුත්තානුවත්තිතවාග්ගහණෙන බ්‍රෑධාතුස්ස බ්‍යඤ්ජනෙ වුද්ධි න හොති,) බහුවචනෙ ‘‘ඣලානමියුවා සරෙ වා’’ති ඌකාරස්ස සරෙ උවාදෙසො, බ්‍රැවන්ති.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "බ්‍රවීති",
                "steps": [
                    {
                        "formula": "√බ්‍රෑ + ති",
                        "rule": ""
                    },
                    {
                        "formula": "බ්-ර්-ඌ→ඔ→අව + (ඊ) + ති",
                        "rule": ""
                    },
                    {
                        "formula": "බ්-ර්- අව්-අ + ඊ + ති",
                        "rule": ""
                    },
                    {
                        "formula": "බ්‍රවීති",
                        "rule": ""
                    }
                ],
                "final_result": "බ්‍රවීති"
            },
            {
                "word": "බ්‍රැවන්ති",
                "steps": [
                    {
                        "formula": "√බ්‍රෑ + අන්ති",
                        "rule": ""
                    },
                    {
                        "formula": "බ්-ර්-ඌ →උව + අන්ති",
                        "rule": ""
                    },
                    {
                        "formula": "බ්-ර්- උව්-අ + අන්ති",
                        "rule": ""
                    },
                    {
                        "formula": "බ්‍රැවන්ති",
                        "rule": ""
                    }
                ],
                "final_result": "බ්‍රැවන්ති"
            },
            {
                "word": "ආහ",
                "steps": [
                    {
                        "formula": "√බ්‍රෑ→ආහ+ ති→අ",
                        "rule": ""
                    },
                    {
                        "formula": "ආහ්-අ + අ",
                        "rule": ""
                    },
                    {
                        "formula": "ආහ",
                        "rule": ""
                    }
                ],
                "final_result": "ආහ"
            },
            {
                "word": "ආහු",
                "steps": [
                    {
                        "formula": "√බ්‍රෑ→ආහ+ අන්ති→උ",
                        "rule": ""
                    },
                    {
                        "formula": "ආහ්-අ + උ",
                        "rule": ""
                    },
                    {
                        "formula": "ආහු",
                        "rule": ""
                    }
                ],
                "final_result": "ආහු"
            },
            {
                "word": "අබ්‍රුවූ",
                "steps": [
                    {
                        "formula": "අ+බ්‍රූ+ඌ",
                        "rule": ""
                    },
                    {
                        "formula": "අ+බ්-ර්-ඌ >උව+ඌ",
                        "rule": ""
                    },
                    {
                        "formula": "අ+බ්-ර්-උව්-අ-ඌ",
                        "rule": ""
                    },
                    {
                        "formula": "අබ්‍රුවූ",
                        "rule": ""
                    }
                ],
                "final_result": "අබ්‍රුවූ"
            },
            {
                "word": "අබ්‍රවි",
                "steps": [
                    {
                        "formula": "අ+බ්‍රූ+ඊ",
                        "rule": ""
                    },
                    {
                        "formula": "අ+බ්-ර්-ඌ→ඔ→අව+ ඊ→ඉ",
                        "rule": ""
                    },
                    {
                        "formula": "අ+බ්-ර්-අව්-අ-ඉ",
                        "rule": ""
                    },
                    {
                        "formula": "අබ්‍රවි",
                        "rule": ""
                    }
                ],
                "final_result": "අබ්‍රවි"
            },
            {
                "word": "අබ්‍රුවි",
                "steps": [
                    {
                        "formula": "අ+බ්‍රූ+ඊ",
                        "rule": ""
                    },
                    {
                        "formula": "අ+බ්-ර්-ඌ →උව+ ඊ→ඉ",
                        "rule": ""
                    },
                    {
                        "formula": "අ+බ්-ර්-උව්-අ-ඉ",
                        "rule": ""
                    },
                    {
                        "formula": "අබ්‍රුවි",
                        "rule": ""
                    }
                ],
                "final_result": "අබ්‍රුවි"
            },
            {
                "word": "හනති",
                "steps": [
                    {
                        "formula": "√හන+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හන්-අ+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හනති",
                        "rule": ""
                    }
                ],
                "final_result": "හනති"
            },
            {
                "word": "හන්ති",
                "steps": [
                    {
                        "formula": "√හන+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හන්-අ+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හන්ති",
                        "rule": ""
                    }
                ],
                "final_result": "හන්ති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "522"
    },
    {
        "sutta_number": 503,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "503. වධො වා සබ්බත්ථ.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **වධො** ය, **වා** ය, **සබ්බත්ථ** ය යනු පදයි. **හනස්ස**, සියලුම හනධාතුවට; **සබ්බත්ථ**, සෑමතන්හි; **වා**, විකල්පයෙන්; **වධො**, වධාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "අබ්භාසෙ",
        "vutti": "හනඉච්චෙතස්ස ධාතුස්ස වධාදෙසො හොති වා සබ්බත්ථ විභත්තිප්පච්චයෙසු, වවත්ථිතවිභාසත්ථොයං වාසද්දො. වධෙති. වධීයති.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "වධෙති",
                "steps": [
                    {
                        "formula": "හන+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හන→වධ+අ→එ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "වධෙති",
                        "rule": ""
                    }
                ],
                "final_result": "වධෙති"
            },
            {
                "word": "පටිහඞ්ඛාමි",
                "steps": [
                    {
                        "formula": "පටි+හන+ ස්සාමි",
                        "rule": ""
                    },
                    {
                        "formula": "පටි+හන්→-ං→ඞ්+ ස්සා→ඛ→ඛා මි",
                        "rule": ""
                    },
                    {
                        "formula": "පටිහඞ්ඛාමි",
                        "rule": ""
                    }
                ],
                "final_result": "පටිහඞ්ඛාමි"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "594"
    },
    {
        "sutta_number": 504,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "504. හස්ස ජො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **හස්ස** ය, **ජො** ය යනු පදයි. **අබ්භාසෙ,** අබ්භාස සංඥයෙහි පවත්නා වූ; **හස්ස**, හකාරයට; **ජො**, ජකාරාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "ඣලානං, සරෙ",
        "vutti": "හකාරස්ස අබ්භාසෙ වත්තමානස්ස ජො හොති. ‘‘ලොපඤ්චෙත්ත මකාරො’’ති අප්පච්චයලොපො, වුද්ධි. ජුහොති.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "ජුහොති",
                "steps": [
                    {
                        "formula": "හු+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හුහු+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හ්→ජ්-උ + හ්-උ→ඔ + අ + ති",
                        "rule": ""
                    },
                    {
                        "formula": "ජුහොති",
                        "rule": ""
                    }
                ],
                "final_result": "ජුහොති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "466"
    },
    {
        "sutta_number": 505,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "505. යවකාරා ච.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **යවකාරා** ය, **ච** ය-යනු පදයි. **සරෙ**, ස්වරයා පරකල්හි; **ඣලානං**, ඣ-සංඥ ලසංඥයන්ට; **යවකාරා ච**, යකාර වකාරාදේශයෝද වෙත්.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "සරො, අබ්භාසෙ",
        "vutti": "ඣලසඤ්ඤානං ඉවණ්ණුවණ්ණානං යකාරවකාරාදෙසා හොන්ති සරෙ පරෙති අපදන්තස්ස උකාරස්ස වකාරො. ජුහ්වති, ජුහොති, ජුහ්වන්ති, ජුහොන්ති. ජුහ්වසි, ජුහොසි, ජුහ්වථ, ජුහොථ. ජුහ්වාමි, ජුහොමි, ජුහ්වාම, ජුහොම.",
        "vutti_sanna": "**අපදන්තස්ස ඌකාරස්ස**, පදාන්ත නොවූ ඌකාරයාට පද මධ්‍යයෙහි ඌකාරයාට යයි සේයි.",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "ජුහ්වති",
                "steps": [
                    {
                        "formula": "ඉ/ඊ → ය්",
                        "rule": ""
                    },
                    {
                        "formula": "උ/ඌ → ව්",
                        "rule": ""
                    },
                    {
                        "formula": "හු+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හුහු+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හ්→ජ්-උ + හ්-උ→ව් + අ + ති",
                        "rule": ""
                    },
                    {
                        "formula": "ජුහ්වති",
                        "rule": ""
                    }
                ],
                "final_result": "ජුහ්වති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "71"
    },
    {
        "sutta_number": 506,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "506. රස්සො.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **රස්සො** යනු එක පදයි. **අබ්භාසො**, අබ්භාසසංඥයෙහි පවත්නා වූ; **සරො**, ස්වරය තෙම; **රස්සො**, හ්‍රස්ව වේ.)",
        "sutta_type": "හ්‍රස්ව විධි සූත්‍රය",
        "anuvattana": "වා",
        "vutti": "අබ්භාසෙ වත්තමානස්ස සරස්ස රස්සො හොති. ජහාති, ජහන්ති. ජහාසි, ජහාථ. ජහාමි, ජහාම.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "ජහාති",
                "steps": [
                    {
                        "formula": "හා+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හාහා+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "හ්→ජ්-ආ→අ හා+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "ජහාති",
                        "rule": ""
                    }
                ],
                "final_result": "ජහාති"
            },
            {
                "word": "හීයතෙ",
                "steps": [
                    {
                        "formula": "හා+ය+තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "හ්-ආ→ඊ+ය+තෙ",
                        "rule": ""
                    },
                    {
                        "formula": "හීයතෙ",
                        "rule": ""
                    }
                ],
                "final_result": "හීයතෙ"
            },
            {
                "word": "දදාති",
                "steps": [
                    {
                        "formula": "දා+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "දාදා+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-ආ→අ දා+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "දදාති",
                        "rule": ""
                    }
                ],
                "final_result": "දදාති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "462"
    },
    {
        "sutta_number": 507,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "507. දාධාතුස්ස දජ්ජං.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **දාධාතුස්ස** ය**,** **දජ්ජං** ය යනු පදයි. **දාධාතුස්ස**, දා දානෙ යන ධාතුහට; **වා**, විකල්පයෙන්; **දජ්ජං**, දජ්ජාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "වා",
        "vutti": "දාඉච්චෙතස්ස ධාතුස්ස සබ්බස්ස දජ්ජාදෙසො හොති වා, වවත්ථිතවිභාසත්ථොයං වාසද්දො, අප්පච්චයලොපො. දජ්ජති, දජ්ජන්ති. දජ්ජසි, දජ්ජථ. දජ්ජාමි, දජ්ජාම. දජ්ජාදෙසාභාවෙ ‘‘ලොපඤ්චෙත්තමකාරො’’ති අප්පච්චයස්ස එකාරො, දානං දෙති, දෙන්ති. දෙසි, දෙථ.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "දෙති",
                "steps": [
                    {
                        "formula": "දා+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-ආ +අ→එ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "ද් +එ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "දෙති",
                        "rule": ""
                    }
                ],
                "final_result": "දෙති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "501"
    },
    {
        "sutta_number": 508,
        "sub_khanda_id": "02_akhyata_adesa",
        "sub_khanda_name": "ධාතු ආදේශ ලොප විධි",
        "sutta_name": "508. දාදන්තස්සං මිමෙසු.",
        "sutta_meaning": "(යනු විධි සූත්‍රයි. - **දාන්තස්ස** ය, **අං** ය, **මිමෙසු** ය, යනු පදයි. **දාන්තස්ස**, දාදානෙ යන ධාතුහුගේ අන්තයට; **මිමෙසු**, මි ම යන විභක්තීන් පරකල්හි; **වා**, විකල්පයෙන්; **අං**, අංයනාදේශ වේ.)",
        "sutta_type": "ආදේශ විධි සූත්‍රය",
        "anuvattana": "පරො,පච්චයො, කත්තරි, අ",
        "vutti": "දාඉච්චෙතස්ස ධාතුස්ස අන්තස්ස අං හොති වා මිමඉච්චෙතෙසු පරෙසු, නිග්ගහීතස්ස වග්ගන්තත්තං. දම්මි, දම්ම. දෙමි, දෙම.",
        "vutti_sanna": "",
        "extended_commentary": "",
        "formed_words": [],
        "counter_examples": "",
        "examples": [
            {
                "word": "දම්මි",
                "steps": [
                    {
                        "formula": "දා+අ+මි",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-ආ→අං + අ+මි",
                        "rule": ""
                    },
                    {
                        "formula": "ද්-අ-ං→ම් +මි",
                        "rule": ""
                    },
                    {
                        "formula": "දම්මි",
                        "rule": ""
                    }
                ],
                "final_result": "දම්මි"
            },
            {
                "word": "පිදහති",
                "steps": [
                    {
                        "formula": "අපි+√ධා+අ+ති",
                        "rule": ""
                    },
                    {
                        "formula": "අපි+ධාධා + අ+ ති",
                        "rule": ""
                    },
                    {
                        "formula": "අපි+ධාධාති",
                        "rule": ""
                    },
                    {
                        "formula": "පි+ධ්→ද්-ආ→අ -ධ්→හ්-ආ→අ -ති",
                        "rule": ""
                    },
                    {
                        "formula": "පිදහති",
                        "rule": ""
                    }
                ],
                "final_result": "පිදහති"
            }
        ],
        "category_badge": "ධාතු ආදේශ ලොප විධි",
        "khanda_badge": "ආඛ්‍යාතකණ්ඩ",
        "kac_number": "484"
    }
];
