/**
 * ආඛ්‍යාතකණ්ඩය — සූත්‍රවලට අදාළ විශේෂ සටහන් (පාද සටහන්, වගු, අමතර සටහන්), සූත්‍ර අංකය අනුව
 */
window.AkhyataSuttaNotes = {
 "0": [
  {
   "n": 1,
   "title": "කාලකාරකපුරුෂයන් ප්‍රකාශ කරන්නේ ක්‍රියා ච…",
   "context": "",
   "html": "<p>කාලකාරකපුරුෂයන් ප්‍රකාශ කරන්නේ ක්‍රියා චිහ්නකොට ඇත්තේ සලකුණු කොට ඇත්තේ ආඛ්‍යාත පද නමි. කාලා ච කාරකානි ච පුරිසා ච කාලකාරකපුරිසා, තෙ පරිදීපෙති විභාවෙතීති කාලකාරකපුරිසපරිදීපකං. කාල යනාදි මෙයින් ලක්ෂණ දැක්වූ නියායි; <strong>තත්ථ</strong>, ඒ කාලාදීන් අතුරෙන්: <strong>කාලොති</strong>, කාල නම්; <strong>අතීතාදයො</strong>, අතීත අනාගත පච්චුප්පන්න ආණත්ති පරිකප්ප කාලාතිපත්ති යන ෂට්කාරකයෝයි; කාරක ලක්ෂණයෙහි භාවයට කාරක ව්‍යවහාරය නොකිව නොකළ මෙහිද කාරක ව්‍යවහාරය කෙසේ ලැබිණිද යත්? කාරක ලක්ෂණයෙහිදී භාවයට ඉදින් කාරකව්‍යවහාරය නොකීවද අවස්තුක වූ අද්‍රව්‍ය වූ භාවයා විසින් ද ක්‍රියාවගේ උත්පත්තියෙක් නැතියි යුක්ත හෙයින්ද කාරක භාවය තොප කීවා සේ නැත, එතකුදු වූව කාරක භාවය නැතද ආඛ්‍යාත පද විෂයෙහිදී භාවයට කාරක ව්‍යවහාරය නිරුක්තිනයයි; කාරක නම් කර්ම කර්තෘභාවය යන මොහු යයි කී මහානිරුක්තියෙහිදී භාවයට කාරක යයි ව්‍යවහාර කළෝ, කාරකත්‍රයෙන් විමුක්ත වූ ආඛ්‍යාත පදයක් නැති හෙයින් ඔහුගේ කාරක පරිදීපකත්වය දත යුත්තේයි. හෙතු කර්තෘදු කතෘ යන මේ වචනයෙන්ම කියන ලදැයි දතයුතු, පුරුෂ නම් එක වචන බහු වචනයෙන් යුක්ත වූ පඨම මජ්ඣිම උත්තම පුරුෂයෝයි, පඨම මජ්ඣිම උත්තමපුරුෂ යනු ති-ආදීන්ට ආඛ්‍යාතයෙහි ව්‍යවහාරයි; මෙද නිරුක්තින යයි; <strong>ක්‍රියාති</strong>, ක්‍රියා නම් ගමන පචනාදි වූ ධාත්වර්ථ යයි. ධාතූන්ගේ ගමන පචනාදි වූ අර්ථය යි සේයි: <strong>එතස්ස</strong>, මේ ආඛ්‍යාත පදය හට; <strong>ක්‍රියා</strong>, ක්‍රියා තොමෝ; <strong>ලක්ඛණං</strong>, සේ; <strong>සඤ්ඤාණං</strong>, සලකුණෙක්නුයි; <strong>ක්‍රියාලක්ඛණං</strong>, ආඛ්‍යාත පදයා තෙමෙ ක්‍රියා ලක්ඛණ නම් ක්‍රියාව ලක්ෂණ කොට ඇත්තා නම් වේ; <strong>අලිඞ්ගං ච</strong>, විසදාවිසද උභය රහිතාකාර සංඛ්‍යාත වූ ලිඟු භෙද නැත්තේයි.</p>"
  },
  {
   "n": 2,
   "title": "ලැයිස්තුව",
   "context": "",
   "html": "<ul><li><strong>වත්තමානා</strong></li><li><strong>පඤ්චමී</strong></li><li><strong>සත්තමී</strong></li><li><strong>පරොක්ඛා</strong></li><li><strong>හිය්‍යත්තනී</strong></li><li><strong>අජ්ජතනී</strong></li><li><strong>භවිස්සන්තී</strong></li><li><strong>කාලාතිපත්ති</strong></li></ul>"
  },
  {
   "n": 3,
   "title": "තත්‍ර, ඒ සකර්මක අකර්මක ධාතුන් කෙරෙන්; කම…",
   "context": "",
   "html": "<p><strong>තත්‍ර</strong>, ඒ සකර්මක අකර්මක ධාතුන් කෙරෙන්; <strong>කම්මාපෙක්ඛං</strong>, කර්මය අපේක්ෂාකළ ක්‍රියාව; <strong>යෙ ධාතවො වදන්ති</strong>, යම් ධාතු කෙනෙක් කියද්ද; <strong>තෙ ධාතවො සකම්මකා</strong>, ඒ ධාතුහු සකර්මක ධාතුහු නම් වෙති. යම් පදයක්හුගේ ප්‍රයෝගයක් ඇති කල්හි කර්තෘහු විසින් උපදවන්නා වූ ක්‍රියා තොමෝ කර්මයා නැතිව නොවේද නූපදීද ඒ ධාතුව සකර්මක නම් වේ. යථා පචතීති වුත්තෙ කිං පචතීති පච්ඡා වුත්තෙ ඔදනං වා අඤ්ඤං කිඤ්චි විඤ්ඤායති. &#x27;&#x27;කටං&quot; යන මේ නිවර්තනීය කර්මය කීයේ කර යන ධාතුහු සකර්මක නියා හැඟ වූ නියායි. &quot;කරොති&quot; යන මේ පදය කාලකාරක පුරුෂයන් ප්‍රකාශ කරන්නා වූ ප්‍රකෘති ප්‍රත්‍යයන්ගේ සමුදාය සමුහ ස්වරූපයෙක හෙවත් ක්‍රියා පදයෙක කර යන ධාතු මාත්‍රයෙක් නොවෙයි. &quot;කරොති&quot; යන ඒ පදයා සකර්මක ධාතූන්ට උදාහරණ භාවයෙන් කෙසේ දක්වන ලදද; <strong>වුච්චතෙ</strong>, එකී චොදනාවට පරිහාර කියනු ලැබේ. &quot;කරොති&#x27;&#x27; යන එහි ප්‍රකෘති වූ කර යන ධාතු මෙම නිර්වන්තනීය කර්මය අපේක්ෂා කළ ක්‍රියාව කියයි. ති ප්‍රත්‍යයා කියන්නේ නොවෙයි. එසේ කල ඒ ති-ප්‍රත්‍යයා කුමක් පිණිස කවර පරිද්දෙකින් දක්වන ලද ද යත්? කාලකාරක පුරුෂ විශේෂ විභාග ප්‍රකාශ කරන හෙයින් දක්වන ලදැයි දත යුතු. කර යන ධාතු කර්මාර්ථයක් කියන හෙයින් “කර” යන මෙ අංශයම භාගයම කොට්ඨාසයම ධාතු පාඨයෙහි “කරණෙ” යි හදාරන ලද &quot;කරොති &quot; යන මේ සමුදාය නොවෙයි ධාතු පාඨයෙහි හදාළේ. කර යන ධාතු අංශයම ධාතු පාඨයෙහි හදාළ බැවින් කර පච යනාදි ප්‍රකෘති අංශයම කර්මය අපේක්ෂා කළ ක්‍රියාව යයි කියා දත යුත්තේයි. &quot;කරොති &quot; යි කියා දැක්වුව හොත් කර යන අංශයම දක්වන ලදැයී දත යුතු සේයි.</p>"
  },
  {
   "n": 4,
   "title": "ලැයිස්තුව",
   "context": "",
   "html": "<ul><li>මිනිසා ගසක් කපයි</li><li>ඔහු ගමට යයි</li><li>හිරු අහසෙහි නැගෙයි</li><li>මම ඇඳෙහි නිදමි</li><li>ඇතා කැලයෙහි සිටියි.</li></ul>"
  },
  {
   "n": 5,
   "title": "යෙ ධාතවො කම්මනිරපෙක්ඛං ක්‍රියං වදන්ති තෙ…",
   "context": "",
   "html": "<p><strong>යෙ ධාතවො කම්මනිරපෙක්ඛං ක්‍රියං වදන්ති තෙ ධාතවො අකම්මකාති වුච්චන්තෙ</strong>, යම් පදයක්හුගේ ප්‍රයෝගයෙහිලා කර්ම රහිතව කර්තෘහු විසින්ම ක්‍රියාව හැඟේද ඒ අකර්මක ධාතු නම් වේ. <strong>යථා</strong>, &#x27;&#x27;තිට්ඨති දෙවදත්තො&quot; යි කීකල්හි දෙවදත්තයාගේ සිටීම ම බුද්ධියට විෂය වෙයි. කිසි කර්ම භූතයෙක් කිසි කර්මයෙක් බුද්ධියට විෂය නොවේ. අච්ඡතීති ආස උපවෙසනෙති ඉමස්ස රූපං නිසීදතීති අත්ථො; සෙති සි සයෙ නිපජ්ජතීති අත්ථො; තිට්ඨතීති ඨා ගතිනිවුත්තිම්හි;</p>"
  },
  {
   "n": 6,
   "title": "තෙ, ඒ ධාතුහු; පුන, නැවත; විකරණප්පච්චයභෙද…",
   "context": "",
   "html": "<p><strong>තෙ</strong>, ඒ ධාතුහු; <strong>පුන</strong>, නැවත; <strong>විකරණප්පච්චයභෙදෙන</strong>, විකරණ සංඛ්‍යාත ප්‍රත්‍යයන්ගේ භෙද හෙයින් සත් වැදෑරුම් වෙත්; විකරණො ච සො පච්චයො චාති විකරණප්පච්චයො තෙසං විකරණප්පච්චයානං භෙදෙන. <strong>පුබ්බාපරභාගට්ඨානා</strong>, පූර්ව අපරභාග ස්ථානයෙන් පුර්වභාග ස්ථානයෙන් අපරභාග ස්ථානයෙන්; <strong>භින්නා</strong>, භින්න වූ වෙන් වූ පුර්වභාග ස්ථානයෙන් භූ යනාදි ධාතුහු වෙන් වූය අපර භාග ස්ථානයෙන් ති ආදි ප්‍රත්‍යයෝ වෙන් වූය; <strong>ධාතු විභත්තියො</strong>, ධාතු විභක්තීන්; <strong>නිස්සාය</strong>, ධාතු විභක්තීන් දෙදෙනාම නිසා; <strong>යෙ පච්චයා හොන්ති</strong>, අප්‍රත්‍යය යනාදි යම් ප්‍රත්‍යය කෙනෙක් වෙත්ද; <strong>තෙ විකරණා සියුං</strong>, ඔහු විකරණ නම් වූහු; විකරියන්ති ධාතවො එතෙහීති වා විකරණා; ධාතු විභක්තීන් මැද වනහෙයින් හෝ විකරණ නම් වෙති; <strong>වා</strong>, නොහොත්; <strong>එතෙහි</strong>, මේ ප්‍රත්‍යයන් විසින් කරණකොටගෙන; <strong>ධාතවො</strong>, ධාතුහු භුවාදි ධාතුහු; <strong>විකරීයන්ති</strong>, විසුරුවනු ලැබෙත්නුයි ධාතුය යන මේ සාමාන්‍ය නමින් එක්ව සිටියවුන් භුවාදිය රුධාදියයි යනාදීන් ඒ ඒ නමින් වෙන් කරනු ලැබෙනුයි අප්‍රත්‍යයාදි ප්‍රත්‍යයෝ විකරණ නම් වෙත්; <strong>කථං</strong>, ඒ ධාතූන් විකරණ ප්‍රත්‍යය භෙද හෙයින් සත් වැදෑරුම් වූ නියා කෙසේද යත්? <strong>භුවාදයො</strong>, භුවාදි ධාතුහු; <strong>අවිකරණා</strong>, අකාර විකරණය ඇත්තාහු විකරණය යන මේ නම ඇති අප්‍රත්‍යයා ඇත්තාහ; රුධාදි ධාතුහු නිග්ගහීතයා පූර්ව කොට ඇති අකාර විකරණයා ඇත්තාහ; දිවාදීහු ය යන නම් ඇති විකරණයා ඇත්තාහ; ස්වාදිහු ණු ණ උණ යන විකරණයන් ඇත්තාහ; ගහාදිතමා කියාදියෙහි ඇතුළත් හෙයින් &quot;නාප්පණ්හා කියාදයො&#x27;&#x27; යි කීහු; තනාදීහු ඔවිකරණය ඇත්තාහ; චුරාදීහු; <strong>සකත්ථෙ</strong>, ධාත්වර්ථයෙහි ණෙ ණය ප්‍රත්‍යයන් අන්ත කොට ඇත්තාහ. කර්ත්‍රාදියෙහි නොව ධාවර්ථයෙහිම ණෙ ණය යන විකරණයෝ වෙත්.</p>"
  }
 ],
 "425": [
  {
   "n": 1,
   "title": "සද්දප්පටිපත්තී - ම.ඡ.ස.",
   "context": "තතො ධාත්වාධිකාරවිහිතානෙකප්පච්චයප්පසඞ්ගෙ ‘‘වත්තිච්ඡානුපුබ්බිකා සද්දප්පවත්තී<sup class=\"sn-mark sn-cur\">[1]</sup>’’ති කත්වා වත්තමානවචනිච්ඡායං –",
   "html": "<p>සද්දප්පටිපත්තී - ම.ඡ.ස.</p>"
  }
 ],
 "426": [
  {
   "n": 1,
   "title": "වගුව",
   "context": "",
   "html": "<div class=\"table-responsive\"><table class=\"data-table\"><tr><td></td><td>පඨම</td><td>මජ්ඣිම</td><td>උත්තම</td></tr><tr><td></td><td>එක</td><td>බහු</td><td>එක</td><td>බහු</td><td>එක</td><td>බහු</td></tr><tr><td>පරස්ස</td><td>ති</td><td>අන්ති,</td><td>සි</td><td>ථ,</td><td>මි</td><td>ම,</td></tr><tr><td>අත්තනො</td><td>තෙ</td><td>අන්තෙ,</td><td>සෙ</td><td>ව්හෙ,</td><td>එ</td><td>ම්හෙ</td></tr></table></div>"
  },
  {
   "n": 2,
   "title": "වගුව",
   "context": "",
   "html": "<div class=\"table-responsive\"><table class=\"data-table\"><tr><td></td><td>පඨම</td><td>මජ්ඣිම</td><td>උත්තම</td></tr><tr><td></td><td>එක</td><td>බහු</td><td>එක</td><td>බහු</td><td>එක</td><td>බහු</td></tr><tr><td>පරස්ස</td><td>ති</td><td>අන්ති,</td><td>සි</td><td>ථ,</td><td>මි</td><td>ම,</td></tr><tr><td>අත්තනො</td><td>තෙ</td><td>අන්තෙ,</td><td>සෙ</td><td>ව්හෙ,</td><td>එ</td><td>ම්හෙ</td></tr></table></div>"
  }
 ],
 "428": [
  {
   "n": 1,
   "title": "ලැයිස්තුව",
   "context": "",
   "html": "<ul><li>අතීත</li><li>හීයත්තනී</li><li>අජ්ජතනී</li><li>පරොක්ඛා</li><li>අනාගත</li><li>පච්චුප්පන්න</li><li>ආණත්ති</li><li>පරිකප්ප</li><li>කාලාතිපත්ති</li></ul>"
  },
  {
   "n": 2,
   "title": "ඉධ පන, මේ සූත්‍රයෙහි වනාහි; කාලස්ස, (මේ…",
   "context": "",
   "html": "<p><strong>ඉධ පන</strong>, මේ සූත්‍රයෙහි වනාහි; <strong>කාලස්ස</strong>, (මේ සූත්‍රයට වැටුණු) කාලයා; <strong>අතීතා - පෙ - කාලාතිපත්තිවසෙන,</strong> කාලාතිපත්ති වශයෙන්; <strong>ඡධා භින්නත්තා</strong>, ෂට් ප්‍රකාරයකින් භින්න හෙයින්; <strong>පච්චුප්පන්නෙති</strong>, පච්චුප්පන්නෙ යි කියා; ( මේ සූත්‍රයෙහි පචිචුප්පන්න ශබ්දයෙන්) <strong>විසෙසෙති</strong>, කාලයා වෙන් කෙරේ; පච්චුප්පන්න ශබ්දයා ප්‍රත්‍යුත්පන්න ක්‍රියාව වෙන් කෙරේ; <strong>තං තං කාරණං පටිච්ච</strong>, කර්ත්‍රාදි ඒ ඒ ක්‍රියා නිසා විද්‍යාමාන කර්ත්‍රාදි ඒ ඒ කාරණය නිමිත්තය නිසා උපන් ක්‍රියාව පච්චුප්පන්න ක්‍රියා නම් වේ; හේ කිමෙක්ද යත්? <strong>පටිලද්ධස්ස භාවො</strong>, පිළිලද ස්වකීය භාවය ඇත්තේය - ප්‍රතිලබ්ධ ආත්ම ඇත්තේ යයි සේයි; විජ්ජමාන වූ කර්ත්‍රාදි ඇත්තේයි; <strong>න තාව අතීතොති අත්ථො</strong>, නොඉක්මුණේය යන අර්ථයයි - ක්‍රියා තොම විජ්ජමාන කර්තෘස්ථ කර්මස්ථයයි සේයි.</p>"
  }
 ],
 "429": [
  {
   "n": 1,
   "title": "තත්ථ පරස්සපදානීති පරස්ස අත්ථභූතානි පදානි…",
   "context": "",
   "html": "<p>තත්ථ <strong>පරස්සපදානී</strong>ති පරස්ස අත්ථභූතානි පදානි පරස්සපදානි. එත්ථුත්තමපුරිසෙසු අත්තනො අත්ථෙසුපි අත්තනොපදවොහාරො න කරියති.</p>"
  },
  {
   "n": 2,
   "title": "කිඤ්චාපි අත්තනො අත්ථා, පුරිසා උත්තමව්හයා…",
   "context": "",
   "html": "<p>කිඤ්චාපි අත්තනො අත්ථා, පුරිසා උත්තමව්හයා;</p>"
  },
  {
   "n": 3,
   "title": "තථාපි ඉතරෙසාන-මුස්සන්නත්තාව තබ්බසා…",
   "context": "",
   "html": "<p>තථාපි ඉතරෙසාන-මුස්සන්නත්තාව තබ්බසා;</p>"
  },
  {
   "n": 4,
   "title": "තබ්බොහාරො ඉමෙසානං, පොරාණෙහි නිරොපිතො…",
   "context": "",
   "html": "<p>තබ්බොහාරො ඉමෙසානං, පොරාණෙහි නිරොපිතො.</p>"
  },
  {
   "n": 5,
   "title": "අත්තනොපදානීති අත්තනො අත්ථභූතානි පදානි අත…",
   "context": "",
   "html": "<p><strong>අත්තනොපදානී</strong>ති අත්තනො අත්ථභූතානි පදානි අත්තනොපදානි. එත්ථ පන පඨමමජ්ඣිමපුරිසෙසු පරස්සත්ථෙසුපි පරස්සපදවොහාරො න කරියති. (සද්දනීති)</p>"
  }
 ],
 "432": [
  {
   "n": 1,
   "title": "මෙහි තුල්‍යාධිකරණ යයි කියන ලද්දේ කුමක් ද…",
   "context": "",
   "html": "<p>මෙහි තුල්‍යාධිකරණ යයි කියන ලද්දේ කුමක් ද? නාමයාගේත් ආඛ්‍යාතයාගේත් තුල්‍යාධිකරණ භාවය කුමක් ද? යනු සිතිය යුතුය. තුම්හ අම්හ ශබ්දයන් ද සහිත වූ සියලුම නාම ශබ්ද ප්‍රයොගය තෙමේ ශබ්ද ප්‍රවෘත්තිය (පැවැත්ම) නිමිති කොට නිමිත්ත වන්ත (නිමිතිඇති) සාධක යයි කියූ කාරකය ප්‍රකාශ කරයි. එසේම ආඛ්‍යාත පදය තෙමේ ද ක්‍රියා පැවැත්ම නිමිති කොට නිමිත්ත සාධක යයි කියූ කාරකය ප්‍රකාශ කරයි. මෙසේ ගත් කල්හි නාමයත් ආඛ්‍යාතයත් දෙකම සාධක සංඛ්‍යාත එකම කාරකයක් ප්‍රකාශ කරන බව නිශ්චය කටයුතුය.</p>"
  },
  {
   "n": 2,
   "title": "මෙසේ යුක්තියුක්තතා අනුව &quot; සො පචති&q…",
   "context": "",
   "html": "<p>මෙසේ යුක්තියුක්තතා අනුව &quot; සො පචති&quot; යනාදි වශයෙන් තුල්‍යාධිකරණ නාම පදයක් කර්තෘත්වයෙන් යොදනු ලබන කල්හි ද නොයොදා නමුත් පචති යනාදි වශයෙන් අධ්‍යාහාර වශයෙන් ගත හැකි කල්හි ද ප්‍රථම පුරුෂ ක්‍රියාව ම වන්නේ යයි නිශ්චය කටයුතුය. (තත්වදීපිකා)</p>"
  }
 ],
 "434": [
  {
   "n": 1,
   "title": "ලැයිස්තුව",
   "context": "",
   "html": "<ul><li>ඉවර්ණ උවර්ණ යන මොවුන් අන්ත කොට ඇති ධාතුන්ගේ ඉවර්ණ උවර්ණ යන මොවුන්ටද (භූ)</li><li>අන්ත ස්වරයාගේ සමීප වර්තී වූ ලහුස්වරයාගේ ඉකාරොකාර වී නම් ඔහට ද නිත්‍යයෙන් වෘද්ධිවේ (ඉර &gt; එර්) (මුද &gt; මොද)</li><li><strong>පරස්සා</strong>ති අඤ්ඤස්ස අකාරස්ස වුද්ධි න හොති (පච &gt; පච් )</li></ul>"
  },
  {
   "n": 2,
   "title": "රූ.සි. 365",
   "context": "තස්සාප්‍යනියමප්පසඞ්ගෙ – ‘‘අයුවණ්ණානඤ්චායො වුද්ධී’’ති<sup class=\"sn-mark sn-cur\">[1]</sup> පරිභාසතො <strong>ඌ</strong>කාර<strong>ස්සො</strong>කාරො වුද්ධි.",
   "html": "<p>රූ.සි. 365</p>"
  }
 ],
 "435": [
  {
   "n": 1,
   "title": "* \" දැන්මනා වෙත් දැන් වෙත් \"",
   "context": "<strong>කිරියාය</strong>, බොහෝ දෙනා පිළිබද ක්‍රියාවගේ; <strong>එකත්තෙ සතීපි</strong>, එකත්වය ඇති කල්හිදු එක ම ක්‍රියා වුවද ක්‍රියාව තමා එකක්ම වුව බහුත්වය කෙසේ වේදයත්? <strong>කත්තූනං</strong>, කර්තෘන්; <strong>බහුත්තා</strong>, ක්‍රියාව කරන්නවුන්ගේ බහුත්වය හෙයින් ඒ ක්‍රියාව කරන්නවුන්ගේ බහුත්වයෙන් &#x27;&#x27; බහුම්හි වත්තබ්බෙ බහුවචනං &quot; යි කීහෙයින් බොහෝදෙනකු කිවමනා කල්හි බහු වචන වෙයි කී හෙයින් වත්තමානාපරස්ස පද පඨම පුරිස බහුවචන අන්ති වේ. <strong>පුරෙ විය</strong>, පෙර මෙන් ආදි මෙන්; <strong>අප්පච්චයවුද්ධිඅවාදෙසා,</strong> අප්‍රත්‍යයවෘද්ධිඅවාදෙශයෝ වෙත් අප්‍රත්‍යය වෘද්ධිය අවය යන මොහු වෙත්; <strong>සරලොපාදි</strong>, ස්වර ලොප් ප්‍රකෘති පරනයනය වේ; <strong>තෙ පුරිසා භවන්ති</strong>, ඒ පුරුෂයෝ දැන් වෙත්;*<sup class=\"sn-mark sn-cur\">[1]</sup> <strong>අප්පයුජ්ජමානෙපි</strong>, නාමයා නොයෙදුණු කල්හිදු; &#x27;භවන්ති&#x27; යි වේ - ත්‍යාදි විභක්තින් විසින්ම එකත්වාදිය ප්‍රකාශිත හෙයින් &#x27;&#x27;භවති භවන්ති &quot; යනාදි ආඛ්‍යාත පදයා කෙරෙන් පරව ප්‍රථමා විභක්ති නොවෙයි දත යුතු.",
   "html": "<p>* &quot; දැන්මනා වෙත් දැන් වෙත් &quot; යි පොත්.</p>"
  },
  {
   "n": 2,
   "title": "කිරියාය, බොහෝ දෙනා පිළිබද ක්‍රියාවගේ; එක…",
   "context": "",
   "html": "<p><strong>කිරියාය</strong>, බොහෝ දෙනා පිළිබද ක්‍රියාවගේ; <strong>එකත්තෙ සතීපි</strong>, එකත්වය ඇති කල්හිදු එක ම ක්‍රියා වුවද ක්‍රියාව තමා එකක්ම වුව බහුත්වය කෙසේ වේදයත්? <strong>කත්තූනං</strong>, කර්තෘන්; <strong>බහුත්තා</strong>, ක්‍රියාව කරන්නවුන්ගේ බහුත්වය හෙයින් ඒ ක්‍රියාව කරන්නවුන්ගේ බහුත්වයෙන් &#x27;&#x27; බහුම්හි වත්තබ්බෙ බහුවචනං &quot; යි කීහෙයින් බොහෝදෙනකු කිවමනා කල්හි බහු වචන වෙයි කී හෙයින් වත්තමානාපරස්ස පද පඨම පුරිස බහුවචන අන්ති වේ. <strong>පුරෙ විය</strong>, පෙර මෙන් ආදි මෙන්; <strong>අප්පච්චයවුද්ධිඅවාදෙසා,</strong> අප්‍රත්‍යයවෘද්ධිඅවාදෙශයෝ වෙත් අප්‍රත්‍යය වෘද්ධිය අවය යන මොහු වෙත්; <strong>සරලොපාදි</strong>, ස්වර ලොප් ප්‍රකෘති පරනයනය වේ; <strong>තෙ පුරිසා භවන්ති</strong>, ඒ පුරුෂයෝ දැන් වෙත්;*<sup class=\"sn-mark sn-cur\">[1]</sup> <strong>අප්පයුජ්ජමානෙපි</strong>, නාමයා නොයෙදුණු කල්හිදු; &#x27;භවන්ති&#x27; යි වේ - ත්‍යාදි විභක්තින් විසින්ම එකත්වාදිය ප්‍රකාශිත හෙයින් &#x27;&#x27;භවති භවන්ති &quot; යනාදි ආඛ්‍යාත පදයා කෙරෙන් පරව ප්‍රථමා විභක්ති නොවෙයි දත යුතු.</p>"
  }
 ],
 "436": [
  {
   "n": 1,
   "title": "* ''වා'' යි පොත්.",
   "context": "<strong>තුල්‍යාධිකරණෙති කිමත්ථං</strong>, සමානාර්ථ කල්හි වෙ*<sup class=\"sn-mark sn-cur\">[1]</sup> යනු සමානාර්ථ මධ්‍යම පුරුෂ වෙයි යනු කුමක් පිණිසයයත් &quot; තයා පච්චතෙ ඔදනො &#x27;&#x27; යන මෙහි නොවන පිණිසයි; තයා පචසි ඔදනො කියා නොවන පිණිසයි &quot; තයා පච්චතෙ ඔදනො &#x27;&#x27; යන මෙහි තෙ යන ආඛ්‍යාත විභක්තීහු කර්මාර්ථයෙහි වූ බැවින් ඔදන ශබ්දයා හා සමානාර්ථ වෙයි තුම්හ ශබ්දයා හා සමානාධිකරණ නොවන හෙයින් &quot; පචසි &quot; යි කියා මධ්‍යම පුරුෂ නොවෙයි ආඛ්‍යාතයා විසින් කර්තෘ උක්ත තැන සමානාධිකරණ වෙයි කර්ම උක්ත තැන සමානාධි කරණ වේ. මෙතැන කර්ම උක්තයි. <strong>පච්චතෙ</strong>, පච පාකෙ යන ධාතුයි; අත්තනොපදයට සිද්ධයි.",
   "html": "<p>* &#x27;&#x27;වා&#x27;&#x27; යි පොත්.</p>"
  }
 ],
 "442": [
  {
   "n": 1,
   "title": "අප්පච්චයපරනයනානි, අපත්‍යය පරනයනයෝ වෙත් අ…",
   "context": "",
   "html": "<p><strong>අප්පච්චයපරනයනානි</strong>, අපත්‍යය පරනයනයෝ වෙත් අප්‍රත්‍ය සාදිය පරනයන ද වෙත්; ක්ච්චිධාතු යන මේ ආදි සූත්‍රයෙන්; <strong>ගුරු පුබ්බ</strong>, ගුරු පුර්ව වූ ගුරුහු පුර්වකොට ඇති; <strong>රස්සතො</strong> <strong>පරස්ස</strong>, හ්‍රස්වයා කෙරෙන් පර වු; පඨම පුරුෂ බහු වචන අන්තිහට විකල්පයෙන් රෙ යන ආදෙශ වේ; ච්ඡ යන සංයොගයා පරකොට ඇති හෙයින් ගකාරස්ථ අකාර ගුරු නම් වේ; ච්ඡ යන සංයොගයාගේ ඡකාරස්ථ අකාර හ්‍රස්වස්වර නම් වේ;</p>"
  },
  {
   "n": 2,
   "title": "සරලොපො - ම.ඡ.ස.",
   "context": "<strong>ච්ඡා</strong>දෙසාභාවෙ ‘‘ලොපඤ්චෙත්තමකාරො’’ති <strong>අ</strong>ප්පච්චයස්ස <strong>එ</strong>කාරො. ගමෙති, ගමෙන්ති, පරලොපො<sup class=\"sn-mark sn-cur\">[1]</sup>. ගමෙසි, ගමෙථ. ගමෙමි, ගමෙම.",
   "html": "<p>සරලොපො - ම.ඡ.ස.</p>"
  },
  {
   "n": 3,
   "title": "ච්ඡාදේශාභාවෙ, විකල්පයෙන් ගමු යන ධාතුහුගේ…",
   "context": "",
   "html": "<p><strong>ච්ඡාදේශාභාවෙ</strong>, විකල්පයෙන් ගමු යන ධාතුහුගේ මකාරයහට ච්ඡ යනාදෙශ නුවූ තැන්හි &quot; ලොපඤ්චෙත්තමකාරො&quot; යන සූත්‍රයෙන් අප්‍රත්‍යය හට එකාරයෙක් වේ. &quot; ගමෙන්ති &quot; යන තන්හි අන්ති යන විභක්තියගේ අකාර ලොප් වේ. එහෙයින් &quot; පරලොපො &quot; යි කීහු. <strong>පරලොපො</strong>, පරයහට ලොප් වේ;</p>"
  }
 ],
 "444": [
  {
   "n": 1,
   "title": "ලැයිස්තුව",
   "context": "",
   "html": "<ul><li><strong>භාවෙ</strong> ච = භාව කාරක</li><li><strong>කම්මනි</strong> ච කාරකෙ = කර්ම කාරක</li><li>කම්මකත්තරිපි. = කර්ම කර්තෘ</li></ul>"
  }
 ],
 "445": [
  {
   "n": 1,
   "title": "වගුව",
   "context": "",
   "html": "<div class=\"table-responsive\"><table class=\"data-table\"><tr><td></td><td>අනුත්තකර්තෘ</td><td>උක්ත කර්මය</td><td>ආඛ්‍යාතය</td></tr><tr><td></td><td>යක්ඛෙන</td><td>සො</td><td>අනුභූයතෙ</td></tr><tr><td></td><td>යක්ඛෙන</td><td>තෙ</td><td>අනුභූයන්තෙ</td></tr><tr><td></td><td>යක්ඛෙන</td><td>ත්වං</td><td>අනුභූයසෙ</td></tr><tr><td></td><td>යක්ඛෙන</td><td>තුම්හෙ</td><td>අනුභූයව්හෙ</td></tr><tr><td></td><td>යක්ඛෙන</td><td>අහං</td><td>අනුභූයෙ</td></tr><tr><td></td><td>යක්ඛෙන</td><td>මයං</td><td>අනුභූයාම්හෙ</td></tr></table></div>"
  }
 ],
 "447": [
  {
   "n": 1,
   "title": "-තස්ස චවග්ග (447) හා පුබ්බරූපඤ්ච (449) ස…",
   "context": "",
   "html": "<p>“-තස්ස චවග්ග (447) හා පුබ්බරූපඤ්ච (449) සූත්‍ර හා උදාහරණ” යන excel සටහන බලන්න</p>"
  },
  {
   "n": 2,
   "title": "921 යස්ස චවග්ගයවත්තං සධාත්වන්තස්ස…",
   "context": "",
   "html": "<p>921 <strong>යස්ස චවග්ගයවත්තං සධාත්වන්තස්ස</strong>.</p>"
  },
  {
   "n": 3,
   "title": "යපච්චයස්ස චවග්ගයකාරවකාරත්තං හොති ධාතූනංඅ…",
   "context": "",
   "html": "<p>යපච්චයස්ස චවග්ගයකාරවකාරත්තං හොති ධාතූනංඅන්තෙන සහ. වුච්චතෙ, මජ්ජතෙ, බුජ්ඣතෙ, හඤ්ඤතෙ,කය්‍යතෙ, දිබ්බතෙ. (සද්දනීති)</p>"
  }
 ],
 "448": [
  {
   "n": 1,
   "title": "922. ඉවණ්ණාගමො තම්හිවා. තස්මිං යපච්චයෙ ප…",
   "context": "",
   "html": "<p>922. <strong>ඉවණ්ණාගමො තම්හිවා.</strong> තස්මිං යපච්චයෙ පරෙ සබ්බෙහි ධාතූහි ඉවණ්ණාගමොහොති වා. කරිය්‍යතෙ, කරීයතෙ. ගච්ඡිය්‍යතෙ,ගච්ඡීයතෙ. වාති කිං? කය්‍යතෙ. (සද්දනීති)</p>"
  }
 ],
 "449": [
  {
   "n": 1,
   "title": "923. පුබ්බරූපං යො. සබ්බෙහි ධාතූහි යපච්චය…",
   "context": "",
   "html": "<p>923<strong>. පුබ්බරූපං යො</strong>. සබ්බෙහි ධාතූහි යපච්චයො පුබ්බරූපමාපජ්ජතෙ වා. වුඩ්ඪතෙ,ඵල්ලතෙ, දම්මතෙ, ලබ්භතෙ, දිස්සතෙ. වාති කිං? දම්‍යතෙ. (සද්දනීති)</p>"
  }
 ],
 "454": [
  {
   "n": 1,
   "title": "සොදානි, සො ඉදානි; කින්නු ඛො භවෙ, කුමක් ව…",
   "context": "",
   "html": "<p><strong>සොදානි</strong>, සො ඉදානි; <strong>කින්නු ඛො භවෙ</strong>, කුමක් වේ හෝ යනු ආදිවාරයට උදාහරණයි; <strong>පඨමවයෙ</strong>, ප්‍රථම වයස; <strong>පබ්බජෙය්‍ය</strong>, පැවිදි වේ නම් වී නම්; <strong>අරහා භවෙය්‍ය</strong>, රහත් වන්නේයි යන මේ අන්තවාරයට උදාහරණයි; පබ්බජෙය්‍ය යනු හෙතු ක්‍රියාවය; භවෙය්‍ය යනු ඵල ක්‍රියාවයි; <strong>සචෙ සංඛාරා නිච්චා භවෙය්‍යුං න නිරුජ්ඣෙය්‍යුං,</strong> ඉදින් සංස්කාරයෝ නිත්‍ය වූ නම් නිරුද්ධ නොවන්නෝයි.</p>"
  },
  {
   "n": 2,
   "title": "+'' උඤ්ච '' යී පෙළ.",
   "context": "<strong>එය්‍යුස්ස</strong>, එය්‍යුහට; <strong>උ ච</strong>+<sup class=\"sn-mark sn-cur\">[1]</sup>, උකාරයෙක් වේ.",
   "html": "<p>+&#x27;&#x27; උඤ්ච &#x27;&#x27; යී පෙළ.</p>"
  }
 ],
 "457": [
  {
   "n": 1,
   "title": "අකාරස්ස, අකාරයහට විකල්පයෙන් අං යන ආදෙශ ව…",
   "context": "",
   "html": "<p><strong>අකාරස්ස</strong>, අකාරයහට විකල්පයෙන් අං යන ආදෙශ වේ; <strong>අකාරාගමාභාව‍ෙ</strong>, අකාරාගමයක් නැති තන්හි.</p>"
  }
 ],
 "463": [
  {
   "n": 1,
   "title": "ඛ ඡ ස යන මොවුන් පරකල්හි; සගුපුස්ස, ගුපුහ…",
   "context": "",
   "html": "<p>ඛ ඡ ස යන මොවුන් පරකල්හි; <strong>සගුපුස්ස</strong>, ගුපුහු සහිත වූ; <strong>අවණ්ණස්ස</strong>, සෙසු ධාතුන්ගේ අවර්ණය හට ද; <strong>ඉකාරො</strong>, ඉකාරයෙක් වේ. මේ සගුපු යන්නහු හා සම්බන්ධ කළනිසායි; එම තුන්දෙනා පරකල්හි අවර්ණය හටද ඉකාරයෙක් වෙයි &#x27;&#x27;සගුපුස්ස &quot; යි කී, √ගුප - ගොපනෙ යන ධාතුහුගේ ගකාරස්ථ උකාරය හටද ඉකාරෙයෙක් වෙයි කියා ද සම්බන්ධ කටයුතු; ගුපස්ස උ ගුපු. ගුපුනා සහ වත්තමානො සගුපු. කො සො අඤ්ඤධාතුස්ස අවණ්ණො, තග්ගුණසංවිඤ්ඤාණගුපඉච්චෙතස්ස ධාතුස්ස උකාරොපි ගය්හති; <strong>වාස්ස ඊ</strong>, අබ්භාසගත වූ වා ශබ්දය හට එම තුන්දෙනා පරකල්හි ඊකාරයෙක් වෙයි; <strong>පරොක්ඛායං</strong>, පරොක්ෂා විභක්ති පරකල්හි; <strong>භූස්ස අකාරො</strong>, භූ යන ධාතු හට අකාරයෙක් වෙයි; <strong>නාපරස්සිමෙ</strong>. <strong>ඉමෙ</strong>, මේ අවර්ණ ඊ අකාරයෝ; <strong>අපරස්ස</strong>, නොකීවන් කෙරෙන් අන්‍යයන්ට; <strong>න</strong>, නොවෙත්.</p>"
  },
  {
   "n": 2,
   "title": "ගුපිස්සි [ක. 465; රූ. 463; නී. 946; ‘ගුප…",
   "context": "",
   "html": "<p><strong>ගුපිස්සි</strong> [ක. 465; රූ. 463; නී. 946; ‘ගුපිස්සුස්ස’ (බහූසු)].</p>"
  },
  {
   "n": 3,
   "title": "ගුපිස්ස ද්විත්තෙ පුබ්බස්ස උ-කාරස්ස ඉ හොත…",
   "context": "",
   "html": "<p>ගුපිස්ස ද්විත්තෙ පුබ්බස්ස උ-කාරස්ස ඉ හොති. ගස්ස චවග්ගත්තං, ධාත්වන්තස්ස පරරූපත්තං, සංයොගාදිස්ස පඨමත්තං.</p>"
  },
  {
   "n": 4,
   "title": "ජිගුච්ඡති, ජිගුච්ඡන්ති. (නිරුත්තිදීපනී)…",
   "context": "",
   "html": "<p>ජිගුච්ඡති, ජිගුච්ඡන්ති. (නිරුත්තිදීපනී)</p>"
  },
  {
   "n": 5,
   "title": "ග්-උ &gt; ඉ ගුප් + ඡ +ති = උකාරයට ඉකාරය…",
   "context": "",
   "html": "<p>ග්-උ &gt; ඉ ගුප් + ඡ +ති = උකාරයට ඉකාරය (463)</p>"
  },
  {
   "n": 6,
   "title": "ප්-ආ&gt;ඉ වාසති = අබ්භාස අන්ත අවර්ණයට ඉ…",
   "context": "",
   "html": "<p>ප්-ආ&gt;ඉ වාසති = අබ්භාස අන්ත අවර්ණයට ඉ-ආදේශය (463)</p>"
  },
  {
   "n": 7,
   "title": "වාස්ස ඊ",
   "context": "ව්-ආ&gt;ඊ මං + ස + ති = අබ්භාසගත “වා”හි අවර්ණයට ඊ-ආදේශය<sup class=\"sn-mark sn-cur\">[1]</sup> (463)",
   "html": "<p>වාස්ස ඊ</p>"
  },
  {
   "n": 8,
   "title": "ව්-ආ&gt;ඊ මං + ස + ති = අබ්භාසගත “වා”හි…",
   "context": "",
   "html": "<p>ව්-ආ&gt;ඊ මං + ස + ති = අබ්භාසගත “වා”හි අවර්ණයට ඊ-ආදේශය<sup class=\"sn-mark sn-cur\">[1]</sup> (463)</p>"
  },
  {
   "n": 9,
   "title": "භ්-ඌ&gt;අ භූ + අ = අබ්භාසගත ඌ-හට අ-ආදේශය…",
   "context": "",
   "html": "<p>භ්-ඌ&gt;අ භූ + අ = අබ්භාසගත ඌ-හට අ-ආදේශය (463)</p>"
  }
 ],
 "466": [
  {
   "n": 1,
   "title": "අත්තනොපදෙ ඊකාරාගමයප්පච්චයිකාරාගමා, අත්තන…",
   "context": "",
   "html": "<p><strong>අත්තනොපදෙ ඊකාරාගමයප්පච්චයිකාරාගමා</strong>, අත්තනොපද විෂයෙහි ඊකාරාගමය යප්‍රත්‍යය &quot; ඉවණ්ණො &quot; යනාදි සූත්‍රයෙන් ඉකාරාගමය යන මොහු වෙත්: <strong>යප්පච්චයස්ස අසබ්බධාතුකම්හි &#x27;&#x27;ක්වචි ධාතූ &#x27;&#x27; ති ආදිනා ලොපෙ කතෙ ඉවණ්ණාගමො න භවති</strong>, අසාර්වධාතුකයා පරකල්හි ක්වචාදි සූත්‍රයෙන් යප්‍රත්‍යයාට ලොප් කළ කල්හි &#x27;&#x27; ඉවණ්ණාගමො වා &#x27;&#x27; යන සූත්‍රයෙන් වන ඉවර්ණාගමයාගේ ආගමය නොවේ;</p>"
  },
  {
   "n": 2,
   "title": "අපච්ච, අපච්චූ - ම.ඡ.ස.",
   "context": "<strong>කම්මනි</strong> පපච්චිත්ථ, පපච්චිරෙ ඉච්චාදි. තථා පපච්ච, පපච්චූ<sup class=\"sn-mark sn-cur\">[1]</sup> ඉච්චාදි.",
   "html": "<p>අපච්ච, අපච්චූ - ම.ඡ.ස.</p>"
  }
 ],
 "467": [
  {
   "n": 1,
   "title": "වගුව",
   "context": "",
   "html": "<div class=\"table-responsive\"><table class=\"data-table\"><tr><td>ක වර්ගය:</td><td>ක</td><td>ඛ</td><td>ග</td><td>ඝ</td><td>ඞ.</td></tr><tr><td>ච වර්ගය:</td><td>ච</td><td>ඡ</td><td>ජ</td><td>ඣ</td><td>ඤ.</td></tr></table></div>"
  }
 ],
 "469": [
  {
   "n": 1,
   "title": "; ඊම්හාදි, ඊ ම්හා යන මේ ආදි විභක්තීන්ට…",
   "context": "",
   "html": "<p>; <strong>ඊම්හාදි</strong>, ඊ ම්හා යන මේ ආදි විභක්තීන්ට; <strong>ඔ ආ අ වචනානං</strong>, ඔ-ය ආ-ය අ-ය යන මේ ආදි විභක්තීන්ට &quot; ක්වචි ධාතු විභත්ති&quot; යනාදී සූත්‍රයෙන්; <strong>ඉත්ථ අමාදෙසා ච</strong>, ඔකාරයාට ඉ-ය ආකාරයාට ත්ථ-ය අකාරයාට අං-ය යන මේ ආදෙශ යෝ වෙත්;</p>"
  }
 ],
 "470": [
  {
   "n": 1,
   "title": "එත්ථ, මේ සූත්‍රයෙහි ; &quot; කාසත්තං &#x…",
   "context": "",
   "html": "<p><strong>එත්ථ</strong>, මේ සූත්‍රයෙහි ; &quot; කාසත්තං &#x27;&#x27; යන භාවනිර්දෙශයෙන් හෝ; <strong>සාගම‍ෙ</strong>, සකාරාගමය කළ කල්හි; &quot;ක්වචි ධාතූති&quot; ආදිනා, ක්වචි ධාතු යන මේ ආදි සූත්‍රයෙන් ව්‍යංජනයා කෙරෙන් පරව අකාරාගමව අගම අසි යන තන්හි අගමාසි යනු වී; උංවචනය හට එම සූත්‍රයෙන් අංසු යන ආදෙශ වේ; <strong>ත්ථම්හෙසු</strong>, ත්ථය ම්හය යන මොවුන් පරකල්හි උකාරයෙක් ආගම වේ; අජ්ජතනි විභක්ති පරකල්හි ගමු යන ධාතු හට ගා යන ආදෙශ වේ;</p>"
  },
  {
   "n": 2,
   "title": "අජ්ජතනි විභක්ති පරකල්හි ගමු යන ධාතු හට ග…",
   "context": "",
   "html": "<p>අජ්ජතනි විභක්ති පරකල්හි ගමු යන ධාතු හට ගා යන ආදෙශ වේ; <strong>පරලොපො</strong>, &quot; අජ්ඣගා&quot; යන තන්හි ගා යන ආදෙශයා කෙරෙන් පරව සිටි ඊකාරය හට* ලොප් වේ; &quot;ත්වමජ්ඣගා &quot; යන තන්හි ඔහට ලොප් වේ; අජ්ඣගා යි ත්ථ යි තුබූ තන්හි ත්ථයා පරකල්හි උකාරාගමව අජ්ඣගුත්ථ වී; ඌකාර හ්‍රස්වව අකාර දීර්ඝව &quot; ආගු &quot; යි වී; අජ්ඣගා යන තන්හි ඊ විභක්ති හට+ ලොප්ව අජ්ඣගා යනු වේ; අජ්ඣගාති අධි ගම ඉති ඨිතෙ ධාතුතො පුබ්බෙ අකාරාගමෙ අජ්ඣාදෙසෙ ච කතෙ රූපං; අජ්ඣගුන්ති සරලොපාදිනා පුබ්බ සරලොපො හොති; <strong>ත්වමජ්ඣගාති</strong>, &#x27;&#x27; වා පරො අසරූපා &#x27;&#x27; ති පරලොපො; අජ්ඣගුත්ථාති උකාරාගමො සරලොපාදිනා පුබ්බසරස්ස ලොපො. අජ්ඣගන්ති ඉංවිභත්තිං අජ්ඣාදෙසංච කත්වා &#x27; වා පරො අසරුපා&#x27; ති සරලොපාදිම්හි කතොරූපං; අජ්ඣගාති සරලොපාදිනා පුබ්බසරස්ස ලුත්තෙ &quot; දීඝ&quot; න්ති දීඝො.</p>"
  }
 ],
 "473": [
  {
   "n": 1,
   "title": "යප්පච්චයස්ස අසබ්බධාතුකම්හි ‘",
   "context": "<strong>කම්මෙ ය</strong>ප්පච්චයලොපො<sup class=\"sn-mark sn-cur\">[1]</sup>, සුඛං තයා අනුභවිස්සතෙ, අනුභවිස්සන්තෙ. අනුභවිස්සසෙ, අනුභවිස්සව්හෙ. අනුභවිස්සං, අනුභවිස්සාම්හෙ. <strong>පරස්සපදත්තෙ</strong> අනුභවිස්සති දෙවදත්තෙන, අනුභවිස්සන්ති ඉච්චාදි. <strong>භාවෙ</strong> භවිස්සතෙ තෙන, <strong>ය</strong>ප්පච්චයලොපාභාවෙ අනුභූයිස්සතෙ, අනුභූයිස්සන්තෙ ඉච්චාදි. <strong>භාවෙ</strong> භූයිස්සතෙ.",
   "html": "<p>යප්පච්චයස්ස අසබ්බධාතුකම්හි ‘‘ක්වචි ධාතූ’’තිආදිනා ලොපෙ කතෙ</p>"
  }
 ],
 "475": [
  {
   "n": 1,
   "title": "එවං, මෙසේ; පඨමවයේ පබ්බජ්ජං සේයි; තං පබ්බ…",
   "context": "",
   "html": "<p><strong>එවං</strong>, මෙසේ; පඨමවයේ පබ්බජ්ජං සේයි; <strong>තං පබ්බජ්ජං</strong>, ත්වං අභවිස්ස අභවිස්සෙ සේ; සෙස්සෙදු මෙම නියෙයි ස්සෙ වචනයාගේ එකාරය හට අත්වව අභවිස්ස යනු වී; අත්වනු වූ තැන අභවිස්සෙ කියා වේ. හ්‍රස්වව අභවිස්සම්හ යනු වී;</p>"
  },
  {
   "n": 2,
   "title": "අන්වභවිස්සිසු - ම.ඡ.ස.",
   "context": "<strong>කම්මෙ</strong> අන්වභවිස්සථ, අන්වභවිස්සිංසු.<sup class=\"sn-mark sn-cur\">[1]</sup> අන්වභූයිස්සථ වා ඉච්චාදි. <strong>පරස්සපදත්තෙ</strong> අන්වභවිස්ස, අන්වභවිස්සංසු. අන්වභූයිස්ස වා ඉච්චාදි. <strong>භාවෙ</strong> අභවිස්සථ දෙවදත්තෙන, අභූයිස්සථ.",
   "html": "<p>අන්වභවිස්සිසු - ම.ඡ.ස.</p>"
  },
  {
   "n": 3,
   "title": "සාධනං - සීහළපොත්ථකෙසු, ඉන්ධන",
   "context": "තථා සො චෙ තං ධනං<sup class=\"sn-mark sn-cur\">[1]</sup> අලභිස්ස, ඔදනං අපචිස්ස, පචිස්ස, අපචිස්සා, පචිස්සා වා, අපචිස්සංසු, පචිස්සංසු. අපචිස්ස, පචිස්ස, අපචිස්සෙ, පචිස්සෙ වා, අපචිස්සථ, පචිස්සථ. අපචිස්සං, පචිස්සං, අපචිස්සම්හ, පචිස්සම්හ, අපචිස්සාම්හා, පචිස්සාම්හා වා. අපචිස්සථ, පචිස්සථ, අපචිස්සිංසු, පචිස්සිංසු<sup class=\"sn-mark sn-cur\">[2]</sup>. අපචිස්සසෙ, පචිස්සසෙ, අපචිස්සව්හෙ, පචිස්සව්හෙ. අපචිස්සිං, පචිස්සිං, අපචිස්සාම්හසෙ, පචිස්සාම්හසෙ.",
   "html": "<p>සාධනං - සීහළපොත්ථකෙසු, ඉන්ධනං - සීහළසන්නෙ</p>"
  },
  {
   "n": 4,
   "title": "අපචිස්සිසු, පචිස්සිසු - ම.ඡ.",
   "context": "තථා සො චෙ තං ධනං<sup class=\"sn-mark sn-cur\">[1]</sup> අලභිස්ස, ඔදනං අපචිස්ස, පචිස්ස, අපචිස්සා, පචිස්සා වා, අපචිස්සංසු, පචිස්සංසු. අපචිස්ස, පචිස්ස, අපචිස්සෙ, පචිස්සෙ වා, අපචිස්සථ, පචිස්සථ. අපචිස්සං, පචිස්සං, අපචිස්සම්හ, පචිස්සම්හ, අපචිස්සාම්හා, පචිස්සාම්හා වා. අපචිස්සථ, පචිස්සථ, අපචිස්සිංසු, පචිස්සිංසු<sup class=\"sn-mark sn-cur\">[2]</sup>. අපචිස්සසෙ, පචිස්සසෙ, අපචිස්සව්හෙ, පචිස්සව්හෙ. අපචිස්සිං, පචිස්සිං, අපචිස්සාම්හසෙ, පචිස්සාම්හසෙ.",
   "html": "<p>අපචිස්සිසු, පචිස්සිසු - ම.ඡ.ස.</p>"
  },
  {
   "n": 5,
   "title": "අපචිස්සිසු - ම.ඡ.ස.",
   "context": "<strong>කම්මෙ</strong> අපචිස්සථ ඔදනො දෙවදත්තෙන, අපචිස්සිංසු<sup class=\"sn-mark sn-cur\">[1]</sup>. <strong>ය</strong>ප්පච්චයලොපාභාවෙ අපචීයිස්සථ ඉච්චාදි. <strong>පරස්සපදත්තෙ</strong> අපච්චිස්ස තෙන, පච්චිස්ස, අපච්චිස්සා, පච්චිස්සා වා, අපච්චිස්සංසු, පච්චිස්සංසු ඉච්චාදි.",
   "html": "<p>අපචිස්සිසු - ම.ඡ.ස.</p>"
  }
 ],
 "476": [
  {
   "n": 1,
   "title": "රූ.සි.51 (ස යෙ ච)",
   "context": "<strong>යමු</strong> උපරමෙ, <strong>නි</strong>පුබ්බො, <strong>ච්ඡා</strong>දෙසො ච. නියච්ඡති, නියච්ඡන්ති. නියමති, නියමන්ති. <strong>සං</strong>පුබ්බො ‘‘සයෙ චා’’ති<sup class=\"sn-mark sn-cur\">[1]</sup> <strong>ඤ</strong>ත්තං, ද්විත්තඤ්ච. සඤ්ඤමති,<sup class=\"sn-mark sn-cur\">[2]</sup> සඤ්ඤමන්ති.",
   "html": "<p>රූ.සි.51 (ස යෙ ච)</p>"
  },
  {
   "n": 2,
   "title": "saññama: masc. restraint; ab",
   "context": "<strong>යමු</strong> උපරමෙ, <strong>නි</strong>පුබ්බො, <strong>ච්ඡා</strong>දෙසො ච. නියච්ඡති, නියච්ඡන්ති. නියමති, නියමන්ති. <strong>සං</strong>පුබ්බො ‘‘සයෙ චා’’ති<sup class=\"sn-mark sn-cur\">[1]</sup> <strong>ඤ</strong>ත්තං, ද්විත්තඤ්ච. සඤ්ඤමති,<sup class=\"sn-mark sn-cur\">[2]</sup> සඤ්ඤමන්ති.",
   "html": "<p>saññama: masc. restraint; abstinence; self-control [saṃ + √yam + a] ✓ , Sinhala 2පු ඉන්ද්‍රියන් තැන්පත් කිරීම; හික්මීම.</p>"
  },
  {
   "n": 3,
   "title": "ක්‍රි (උප + ආස. d භු උපවෙසනෙ",
   "context": "<strong>ආස</strong> උපවෙසනෙ, යොගවිභාගෙන <strong>ච්ඡා</strong>දෙසො, රස්සත්තං. අච්ඡති, අච්ඡන්ති. අච්ඡසි, අච්ඡථ. අච්ඡාමි, අච්ඡාම. අඤ්ඤත්‍ර <strong>උප</strong>පුබ්බො උපාසති,<sup class=\"sn-mark sn-cur\">[1]</sup> උපාසන්ති.",
   "html": "<p>ක්‍රි (උප + ආස. d භු උපවෙසනෙ, ළඟ හිඳීමෙහි + ති) සේවනය කෙරෙයි., upāsati: pr. (+acc) attends (to); pays attention (to); sits at the feet (of); lit. sits near [upa + √ās + a + ti] ✓</p>"
  }
 ],
 "477": [
  {
   "n": 1,
   "title": "රූ.සි.524",
   "context": "භවිස්සන්තිම්හි ‘‘කරස්ස සප්පච්චයස්ස කාහො’’ති<sup class=\"sn-mark sn-cur\">[1]</sup> එත්ථ <strong>සප්පච්චය</strong>ග්ගහණෙන <strong>වච-මුච-භුජා</strong>දිතො <strong>ස්ස</strong>ස්ස <strong>ඛා</strong>දෙසො, <strong>වස ඡිද ලභා</strong>දිතො <strong>ඡා</strong>දෙසො ච වා හොතීති <strong>ස්ස</strong>ස්ස <strong>ඡා</strong>දෙසො, ‘‘බ්‍යඤ්ජනන්තස්ස චො ඡප්පච්චයෙසු චා’’ති<sup class=\"sn-mark sn-cur\">[2]</sup> ධාත්වන්තස්ස <strong>ච</strong>කාරො, ලච්ඡති, ලච්ඡන්ති. ලච්ඡසි, ලච්ඡථ. ලච්ඡාමි, ලච්ඡාම. <strong>ඡා</strong>දෙසාභාවෙ ලභිස්සති, ලභිස්සන්ති. ලභිස්සසි, ලභිස්සථ. ලභිස්සාමි, ලභිස්සාම ඉච්චාදි. අලභිස්ස, අලභිස්සංසු ඉච්චාදි.",
   "html": "<p>රූ.සි.524</p>"
  },
  {
   "n": 2,
   "title": "රූ.සි.531",
   "context": "භවිස්සන්තිම්හි ‘‘කරස්ස සප්පච්චයස්ස කාහො’’ති<sup class=\"sn-mark sn-cur\">[1]</sup> එත්ථ <strong>සප්පච්චය</strong>ග්ගහණෙන <strong>වච-මුච-භුජා</strong>දිතො <strong>ස්ස</strong>ස්ස <strong>ඛා</strong>දෙසො, <strong>වස ඡිද ලභා</strong>දිතො <strong>ඡා</strong>දෙසො ච වා හොතීති <strong>ස්ස</strong>ස්ස <strong>ඡා</strong>දෙසො, ‘‘බ්‍යඤ්ජනන්තස්ස චො ඡප්පච්චයෙසු චා’’ති<sup class=\"sn-mark sn-cur\">[2]</sup> ධාත්වන්තස්ස <strong>ච</strong>කාරො, ලච්ඡති, ලච්ඡන්ති. ලච්ඡසි, ලච්ඡථ. ලච්ඡාමි, ලච්ඡාම. <strong>ඡා</strong>දෙසාභාවෙ ලභිස්සති, ලභිස්සන්ති. ලභිස්සසි, ලභිස්සථ. ලභිස්සාමි, ලභිස්සාම ඉච්චාදි. අලභිස්ස, අලභිස්සංසු ඉච්චාදි.",
   "html": "<p>රූ.සි.531</p>"
  },
  {
   "n": 3,
   "title": "වචමුචභුජාදිතොස්සස්ස ඛාදෙසො, වච වියත්තියං…",
   "context": "",
   "html": "<p><strong>වචමුචභුජාදිතොස්සස්ස ඛාදෙසො</strong>, වච වියත්තියං වාචායං මුව මොචනෙ භුජ පාලනභ්‍යවහරණෙ යනාදි ධාතුන් කෙරෙන් පර වූ ස්සති යන්නවුගේ ස්ස යන මොහට ඛා යන ආදෙශ වේ; වස නිවාසෙ ජිදි භිදි ද්වෙධාකරණෙ දලදිත්තිම්හි; <strong>වසච්ඡිද දලලභාදිතො</strong>, ලභ ලාභෙ යනාදි ධාතුන් කෙරෙන් පරව ඡ යන ආදෙශ විකල්පයෙන් වෙයි කියා ස්ස යන මොහුට ඡ යන ආදේශ වේ; ලච්ඡති යනාදි භවිස්සති විභක්තියට සිද්ධයි; <strong>ඡාදෙසාභාවෙ</strong>, ස්සහට ඡාදෙශ වැළකිතන්හි අලභිස්ස යනාදි කාලාතිපත්තියි;</p>"
  }
 ],
 "478": [
  {
   "n": 1,
   "title": "1 වන විකල්පය…",
   "context": "",
   "html": "<p><strong>1 වන විකල්පය</strong></p>"
  },
  {
   "n": 2,
   "title": "2 වන විකල්පය…",
   "context": "",
   "html": "<p><strong>2 වන විකල්පය</strong></p>"
  }
 ],
 "479": [
  {
   "n": 1,
   "title": "භවිස්සන්තිම්හි, භවිෂ්‍යත් විභක්ති පරකල්හ…",
   "context": "",
   "html": "<p><strong>භවිස්සන්තිම්හි</strong>, භවිෂ්‍යත් විභක්ති පරකල්හි &quot;කරස්ස&#x27;&#x27; යනාදි සූත්‍රයෙහි සප්පච්චය ග්‍රහණයෙන්; <strong>ස්සස්ස</strong>, ස්සති යනාදි විභක්තින්ගේ ස්ස හට ඛ යන ආදේශ වේ.</p>"
  },
  {
   "n": 2,
   "title": "* \"වසිස්ස\" පොත්.",
   "context": "වස යන ධාතු - නිවාසෙ, විසීමෙහි වැටේ. වකාර අකාර දෙදෙනාට උකාරාදෙශව (යකාරයහට); <strong>පුබ්බරූපත්තං</strong>, පුර්වරූපව වුස්සති යනාදි වී; අවසි යනු අජ්ජතනි පරස්ස පද ප්‍රථම එක වචනය හට උදාහරණයි කාලාතිපත්ති ප්‍රථමෛකවචනය හට හ්‍රස්ව ව අවසිස්ස*<sup class=\"sn-mark sn-cur\">[1]</sup> යනු වේ.",
   "html": "<p>* &quot;වසිස්ස&quot; පොත්.</p>"
  }
 ],
 "487": [
  {
   "n": 1,
   "title": "වජ්ජති - සීහළ",
   "context": "<strong>අ</strong>ප්පච්චයස්ස <strong>එ</strong>කාරො, සරලොපාදි, වජ්ජෙති<sup class=\"sn-mark sn-cur\">[1]</sup>, වදෙති, වදති, <strong>අන්ති</strong>ම්හි –",
   "html": "<p>වජ්ජති - සීහළ</p>"
  }
 ],
 "489": [
  {
   "n": 1,
   "title": "විස-පවිසනෙ, පවිසති, පවිසන්ති…",
   "context": "",
   "html": "<p><strong>විස</strong>-පවිසනෙ, පවිසති, පවිසන්ති.</p>"
  },
  {
   "n": 2,
   "title": "කම්මෙ-පවිසීයති, පවිසීයන්ති, පවිසීයතෙ, පව…",
   "context": "",
   "html": "<p>කම්මෙ-පවිසීයති, පවිසීයන්ති, පවිසීයතෙ, පවිසීයන්තෙ.</p>"
  },
  {
   "n": 3,
   "title": "යස්ස පුබ්බරූපත්තෙ-පවිස්සති, පවිස්සන්ති…",
   "context": "",
   "html": "<p>යස්ස පුබ්බරූපත්තෙ-පවිස්සති, පවිස්සන්ති, පවිස්සරෙ, පවිස්සතෙ, පවිස්සන්තෙ, පවිස්සරෙ.</p>"
  },
  {
   "n": 4,
   "title": "කාරිතෙ-පවෙසෙති, පවෙසයති…",
   "context": "",
   "html": "<p>කාරිතෙ-පවෙසෙති, පවෙසයති.</p>"
  },
  {
   "n": 5,
   "title": "කම්මෙ-පවෙසීයති, පවෙසීයන්ති. (නිරුත්තිදීප…",
   "context": "",
   "html": "<p>කම්මෙ-පවෙසීයති, පවෙසීයන්ති. (නිරුත්තිදීපනී)</p>"
  },
  {
   "n": 6,
   "title": "පවිසෙ, පවිසෙය්‍ය - සීහළ",
   "context": "තථා පවිසතු, පවිසන්තු. පවිසෙය්‍ය<sup class=\"sn-mark sn-cur\">[1]</sup>. පාවිසි, පවිසි, පාවෙක්ඛි පථවිං, ‘‘ක්වචි ධාතූ’’තිආදිනා අජ්ජතනිම්හි <strong>විස</strong>ස්ස වෙක්ඛාදෙසො ච. පාවිසිංසු, පවිසිංසු.",
   "html": "<p>පවිසෙ, පවිසෙය්‍ය - සීහළ</p>"
  },
  {
   "n": 7,
   "title": "ඊආදිම්හි උපසග්ගස්ස දීඝො වා, පාවිසි…",
   "context": "",
   "html": "<p>ඊආදිම්හි උපසග්ගස්ස දීඝො වා, පාවිසි.</p>"
  },
  {
   "n": 8,
   "title": "මහාවුත්තිනා ධාත්වන්තස්ස ක්ඛො හොති, පාවෙක…",
   "context": "",
   "html": "<p>මහාවුත්තිනා ධාත්වන්තස්ස ක්ඛො හොති, පාවෙක්ඛි පථවිං චෙච්චො [ජා. 1.19.98], සො පාවෙක්ඛි කාසිරාජා [ජා. 1.15.266], සො තස්ස ගෙහං පාවෙක්ඛි [ජා. 1.15.303], පාවිසුං, පාවිසිංසු, පාවෙක්ඛිංසු.</p>"
  },
  {
   "n": 9,
   "title": "ස්සත්‍යාදීසු ‘වච භුජ මුච විසානං ක්ඛඞ’ඉති…",
   "context": "",
   "html": "<p>ස්සත්‍යාදීසු ‘වච භුජ මුච විසානං ක්ඛඞ’ඉති ස්සෙන සහ ධාත්වන්තස්ස ක්ඛො, පවෙක්ඛති, පවිසිස්සති, පවෙක්ඛන්ති, පවිසිස්සන්ති, එස භිය්‍යො පවෙක්ඛාමි, වම්මිකං සතපොරිසං [ජා. 1.4.100], පාවෙක්ඛා, පවිසිස්සා, පාවෙක්ඛංසු, පවිසිස්සංසු. (නිරුත්තිදීපනී)</p>"
  },
  {
   "n": 10,
   "title": "පරස්ස - සීහළ",
   "context": "<strong>හූ, භූ</strong> සත්තායං, <strong>ත්‍යා</strong>ද්‍යුප්පත්ති ‘‘භූවාදිතො අ’’ඉති <strong>අ</strong>ප්පච්චයො, ‘‘වා’’ති අධිකිච්ච ‘‘ලොපඤ්චෙත්තමකාරො’’ති භූවාදිතො පරස්ස අප්පච්චයස්ස ලොපො, ‘‘අඤ්ඤෙසු චා’’ති වුද්ධි. සො හොති, තෙ හොන්ති, ‘‘ක්වචි ධාතූ’’තිආදිනා පරසරස්ස<sup class=\"sn-mark sn-cur\">[1]</sup> ලොපො. හොසි, හොථ. හොමි, හොම. <strong>භාවෙ</strong> හූයතෙ.",
   "html": "<p>පරස්ස - සීහළ</p>"
  },
  {
   "n": 11,
   "title": "හූ ධාතු, හූ යන ධාතුහුගේ ඊ යන විභක්ති හට…",
   "context": "",
   "html": "<p><strong>හූ ධාතු</strong>, හූ යන ධාතුහුගේ ඊ යන විභක්ති හට ලොප්ව අහූ යනු වූ. <strong>හූතො</strong>, හූ යන ධාතුහු කෙරෙන් පර වූ ඊකාරයාහට හ්‍රස්ව ව අහොසි යනු වී. ඔකාරයාට එකාරව අහෙසුං යනු වී. &quot; ඔ අවසරෙ &quot; යන සූත්‍රයෙන් අව අහවුං යනු වූ. <strong>පරසරලොපො</strong>, &#x27;&#x27; වා පරො අසරූපා &#x27;&#x27; යන සූත්‍රයෙන් උකාරයා කෙරෙන් පර ඉකාර ලොප්ව &quot; රස්සං &#x27;&#x27; යන සුත්‍රයෙන් හ්‍රස්ව ව <strong>අහුං</strong> යනු වී.</p>"
  }
 ],
 "490": [
  {
   "n": 1,
   "title": "සි යන ධාතු; සයෙ, හෙවීමෙහි වැටේ…",
   "context": "",
   "html": "<p><strong>සි</strong> යන ධාතු; <strong>සයෙ</strong>, හෙවීමෙහි වැටේ.</p>"
  }
 ],
 "491": [
  {
   "n": 1,
   "title": "දුහ - දෙවීම් අර්ථය…",
   "context": "",
   "html": "<p><strong>දුහ</strong> - දෙවීම් අර්ථය</p>"
  },
  {
   "n": 2,
   "title": "යාච - යැදීම් අර්ථය…",
   "context": "",
   "html": "<p><strong>යාච</strong> - යැදීම් අර්ථය</p>"
  },
  {
   "n": 3,
   "title": "රුධි - වැලැක්වීම් අර්ථය…",
   "context": "",
   "html": "<p><strong>රුධි</strong> - වැලැක්වීම් අර්ථය</p>"
  },
  {
   "n": 4,
   "title": "පුච්ඡ - විමසීම් අර්ථය…",
   "context": "",
   "html": "<p><strong>පුච්ඡ</strong> - විමසීම් අර්ථය</p>"
  },
  {
   "n": 5,
   "title": "භික්ඛ - පිඩුසිගීම් අර්ථය…",
   "context": "",
   "html": "<p><strong>භික්ඛ</strong> - පිඩුසිගීම් අර්ථය</p>"
  },
  {
   "n": 6,
   "title": "සාස - අනුශාසනා කිරීම් අර්ථය…",
   "context": "",
   "html": "<p><strong>සාස</strong> - අනුශාසනා කිරීම් අර්ථය</p>"
  },
  {
   "n": 7,
   "title": "වච - කීම් අර්ථය…",
   "context": "",
   "html": "<p><strong>වච</strong> - කීම් අර්ථය</p>"
  },
  {
   "n": 8,
   "title": "නී - පමුණුවීම්/ගෙනයෑම් අර්ථය…",
   "context": "",
   "html": "<p><strong>නී</strong> - පමුණුවීම්/ගෙනයෑම් අර්ථය</p>"
  },
  {
   "n": 9,
   "title": "වහ - ඔසවායෑම්/ගෙනයෑම් අර්ථය…",
   "context": "",
   "html": "<p><strong>වහ</strong> - ඔසවායෑම්/ගෙනයෑම් අර්ථය</p>"
  },
  {
   "n": 10,
   "title": "හර - ගෙනයෑම් අර්ථය…",
   "context": "",
   "html": "<p><strong>හර</strong> - ගෙනයෑම් අර්ථය</p>"
  },
  {
   "n": 11,
   "title": "අප්පධානං දුහාදීනං - න්‍යාදීනං තු පධානකං…",
   "context": "",
   "html": "<p>අප්පධානං දුහාදීනං - න්‍යාදීනං තු පධානකං</p>"
  },
  {
   "n": 12,
   "title": "කම්මං කම්මෙසුනෙකෙසු - වුත්තකම්මන්ති වුච්…",
   "context": "",
   "html": "<p>කම්මං කම්මෙසුනෙකෙසු - වුත්තකම්මන්ති වුච්චතෙ</p>"
  },
  {
   "n": 13,
   "title": "අජා - සීහළ",
   "context": "<strong>නී</strong> යන ධාතු, <strong>පාපුණනෙ</strong>, පැමිණිමෙහි වැටේ; <strong>අයං</strong>, මේ ධාතු තෙම; <strong>ද්විකම්මකො</strong>, කර්ම දෙකෙක් ඇත්තේයි; <strong>ලොපාභාවෙ</strong>, &#x27;&#x27; ලොපඤ්චෙත්තමකාරො&#x27;&#x27; යන සූත්‍රයෙන් අප්‍රත්‍යයාට ලොප්නුවු තැන්හි අය ව, <strong>නයති</strong> යනු වී, (ගාමමජා ගාමං අජා;) <strong>අජො</strong><sup class=\"sn-mark sn-cur\">[1]</sup>, එළි; <strong>නීයති</strong><sup class=\"sn-mark sn-cur\">[2]</sup>යනු පරස්ස පදාදෙසයි.",
   "html": "<p>අජා - සීහළ</p>"
  },
  {
   "n": 14,
   "title": "නීයතු - සීහළ",
   "context": "<strong>නී</strong> යන ධාතු, <strong>පාපුණනෙ</strong>, පැමිණිමෙහි වැටේ; <strong>අයං</strong>, මේ ධාතු තෙම; <strong>ද්විකම්මකො</strong>, කර්ම දෙකෙක් ඇත්තේයි; <strong>ලොපාභාවෙ</strong>, &#x27;&#x27; ලොපඤ්චෙත්තමකාරො&#x27;&#x27; යන සූත්‍රයෙන් අප්‍රත්‍යයාට ලොප්නුවු තැන්හි අය ව, <strong>නයති</strong> යනු වී, (ගාමමජා ගාමං අජා;) <strong>අජො</strong><sup class=\"sn-mark sn-cur\">[1]</sup>, එළි; <strong>නීයති</strong><sup class=\"sn-mark sn-cur\">[2]</sup>යනු පරස්ස පදාදෙසයි.",
   "html": "<p>නීයතු - සීහළ</p>"
  },
  {
   "n": 15,
   "title": "නී යන ධාතු, පාපුණනෙ, පැමිණිමෙහි වැටේ; අය…",
   "context": "",
   "html": "<p><strong>නී</strong> යන ධාතු, <strong>පාපුණනෙ</strong>, පැමිණිමෙහි වැටේ; <strong>අයං</strong>, මේ ධාතු තෙම; <strong>ද්විකම්මකො</strong>, කර්ම දෙකෙක් ඇත්තේයි; <strong>ලොපාභාවෙ</strong>, &#x27;&#x27; ලොපඤ්චෙත්තමකාරො&#x27;&#x27; යන සූත්‍රයෙන් අප්‍රත්‍යයාට ලොප්නුවු තැන්හි අය ව, <strong>නයති</strong> යනු වී, (ගාමමජා ගාමං අජා;) <strong>අජො</strong><sup class=\"sn-mark sn-cur\">[1]</sup>, එළි; <strong>නීයති</strong><sup class=\"sn-mark sn-cur\">[2]</sup>යනු පරස්ස පදාදෙසයි.</p>"
  }
 ],
 "493": [
  {
   "n": 1,
   "title": "පකිට්ඨිස්සති - ම.ඡ.ස. (මුද්‍",
   "context": "තථා තිට්ඨතු, තිට්ඨන්තු. ඨාතු, ඨන්තු. සණ්ඨහතු, සණ්ඨහන්තු. තිට්ඨෙ, තිට්ඨෙය්‍ය. සණ්ඨෙ, සණ්ඨෙය්‍ය, සණ්ඨෙය්‍යුං. සණ්ඨහෙ, සණ්ඨහෙය්‍යුං. අට්ඨාසි, අට්ඨංසු. සණ්ඨහි, සණ්ඨහිංසු. පතිට්ඨිස්සති<sup class=\"sn-mark sn-cur\">[1]</sup>, පතිට්ඨිස්සන්ති. ඨස්සති, ඨස්සන්ති. පතිට්ඨහිස්සති, පතිට්ඨහිස්සන්ති. පතිට්ඨිස්ස, පතිට්ඨිස්සංසු. පතිට්ඨහිස්ස, පතිට්ඨහිස්සංසු ඉච්චාදි.",
   "html": "<p>පකිට්ඨිස්සති - ම.ඡ.ස. (මුද්‍රණදෝෂ)</p>"
  }
 ],
 "500": [
  {
   "n": 1,
   "title": "අසස්සාදිලොපෙ - සීහළ",
   "context": "<strong>සත්තමියං අස</strong>ස්සාදිලොපො<sup class=\"sn-mark sn-cur\">[1]</sup>, ‘‘ක්වචි ධාතූ’’තිආදිනා <strong>අස</strong>තො <strong>එය්‍යඑය්‍යුං</strong> විභත්තීනං <strong>ඉයාඉයු</strong>ඤ්ච හොන්ති. සියා, සියුං.",
   "html": "<p>අසස්සාදිලොපෙ - සීහළ</p>"
  },
  {
   "n": 2,
   "title": "අසස්සාදිලොපෙ, අස යන ධාතුහුගේ ආදිහට ලොප්…",
   "context": "",
   "html": "<p><strong>අසස්සාදිලොපෙ</strong>, අස යන ධාතුහුගේ ආදිහට ලොප් කළ කල්හි; <strong>අසතො එය්‍ය එය්‍යුං විභත්තීනං ඉයා ඉයුඤ්ච හොන්ති</strong>, අස යන ධාතුහු කෙරෙන් පර වූ එය්‍ය එය්‍යුං යන විභක්තීන්ට ඉයා ඉයුං යන ආදෙශයෝ වෙත්;</p>"
  },
  {
   "n": 3,
   "title": "ඔහට ඉකාරාදෙසව ආසි යනු වී…",
   "context": "",
   "html": "<p>ඔහට ඉකාරාදෙසව ආසි යනු වී.</p>"
  }
 ],
 "502": [
  {
   "n": 1,
   "title": "පරො, පරව; බ්‍රෑති යනු ක්වචිග්‍රහණයෙන් වැ…",
   "context": "",
   "html": "<p><strong>පරො</strong>, පරව; බ්‍රෑති යනු ක්වචිග්‍රහණයෙන් වැළකීනුයි; <strong>බ්‍යජනෙ</strong>, බ්‍යඤ්ජනයා පරකල්හි; <strong>සරෙ</strong>, ස්වරයා පරකල්හි; <strong>බහුවචනෙ</strong>, බහුවචනයා පරකල්හි;</p>"
  },
  {
   "n": 2,
   "title": "බ්‍රෑතං යනු අත්තනොපදයි. බ්‍රෑවන්තං යනු ප…",
   "context": "",
   "html": "<p><strong>බ්‍රෑතං</strong> යනු අත්තනොපදයි. <strong>බ්‍රෑවන්තං</strong> යනු පරස්සපදාදෙස වූ තැනි. <strong>බ්‍රෑවෙථ</strong> යනු කර්තෘ විෂයෙහි වූ අත්තනොපදයි. <strong>අබ්‍රැවා</strong> <strong>අබ්‍රැවු</strong> යනු හීයත්තනියි.</p>"
  },
  {
   "n": 3,
   "title": "භවිස්සන්තියං; බ්‍රැවිස්සති; කාලාතිපත්තිය…",
   "context": "",
   "html": "<p>භවිස්සන්තියං; <strong>බ්‍රැවිස්සති</strong>; කාලාතිපත්තියං; <strong>අබ්‍රැවිස්ස</strong>,</p>"
  },
  {
   "n": 4,
   "title": "හන යන ධාතු; හිංසා ගතිසු, නැස්මය ගමනය යන…",
   "context": "",
   "html": "<p><strong>හන</strong> යන ධාතු; <strong>හිංසා ගතිසු</strong>, නැස්මය ගමනය යන මෙහි වැටේ;</p>"
  },
  {
   "n": 5,
   "title": "රූ.සි. 447",
   "context": "<strong>කම්මෙ</strong> ‘‘තස්ස චවග්ග’’ඉච්චාදිනා<sup class=\"sn-mark sn-cur\">[1]</sup> <strong>ඤ</strong>ත්තං, ද්විත්තඤ්ච, හඤ්ඤතෙ, හඤ්ඤන්තෙ, හඤ්ඤරෙ. හඤ්ඤති, හඤ්ඤන්ති.",
   "html": "<p>රූ.සි. 447</p>"
  }
 ],
 "503": [
  {
   "n": 1,
   "title": "අවධී යනාදි අජ්ජතනියි. ඛාදෙසෙ, ස්ස හට “කර…",
   "context": "",
   "html": "<p><strong>අවධී</strong> යනාදි අජ්ජතනියි. <strong>ඛාදෙසෙ</strong>, ස්ස හට “කරස්ස සප්පච්චස්ස කාහො” යන සූත්‍රයෙන් සප්පච්චය ග්‍රහණයෙන් ඛා යන ආදේශ කළ කල්හි; මහා වෘත්තියෙන් හන යන ධාතුහුගේ නකාරය හට නිග්ගහීතව පටිහංඛාමි යනු වේ. හූවාදයො.</p>"
  },
  {
   "n": 2,
   "title": "දානාදානහව්‍යපදානෙසු - සීහළ",
   "context": "<strong>හු</strong> දානාදනහබ්‍යප්පදානෙසු<sup class=\"sn-mark sn-cur\">[1]</sup>, <strong>ත්‍යා</strong>ද්‍යුප්පත්ති, <strong>අ</strong>ප්පච්චයො ච, ‘‘ක්වචාදිවණ්ණානමෙකස්සරානං ද්වෙභාවො’’ති<sup class=\"sn-mark sn-cur\">[2]</sup> ද්විත්තං, ‘‘පුබ්බොබ්භාසො’’ති අබ්භාසසඤ්ඤා.",
   "html": "<p>දානාදානහව්‍යපදානෙසු - සීහළ</p>"
  },
  {
   "n": 3,
   "title": "රූ.සි.461 - 462",
   "context": "<strong>හු</strong> දානාදනහබ්‍යප්පදානෙසු<sup class=\"sn-mark sn-cur\">[1]</sup>, <strong>ත්‍යා</strong>ද්‍යුප්පත්ති, <strong>අ</strong>ප්පච්චයො ච, ‘‘ක්වචාදිවණ්ණානමෙකස්සරානං ද්වෙභාවො’’ති<sup class=\"sn-mark sn-cur\">[2]</sup> ද්විත්තං, ‘‘පුබ්බොබ්භාසො’’ති අබ්භාසසඤ්ඤා.",
   "html": "<p>රූ.සි.461 - 462</p>"
  }
 ],
 "506": [
  {
   "n": 1,
   "title": "රූ.සි. 493",
   "context": "<strong>කම්මෙ</strong> ‘‘යම්හි දාධාමාඨාහාපාමහමථාදීනමී’’ති<sup class=\"sn-mark sn-cur\">[1]</sup> ධාත්වන්තස්ස <strong>ඊ</strong>කාරො. හීයතෙ, හීයන්තෙ, හීයරෙ. හීයති, හීයන්ති.",
   "html": "<p>රූ.සි. 493</p>"
  },
  {
   "n": 2,
   "title": "හීයති යනාදි පරස්සපදාදෙසයි…",
   "context": "",
   "html": "<p><strong>හීයති</strong> යනාදි පරස්සපදාදෙසයි.</p>"
  },
  {
   "n": 3,
   "title": "දා යන ධාතු, දානෙ, දීමෙහි වැටේ…",
   "context": "",
   "html": "<p><strong>දා</strong> යන ධාතු, <strong>දානෙ</strong>, දීමෙහි වැටේ.</p>"
  }
 ],
 "508": [
  {
   "n": 1,
   "title": "විකල්පයෙන් අං වැළක අප්‍රත්‍යයාට එකාරව දෙ…",
   "context": "",
   "html": "<p>විකල්පයෙන් අං වැළක අප්‍රත්‍යයාට එකාරව <strong>දෙම</strong> යනු වේ.</p>"
  },
  {
   "n": 2,
   "title": "දද දදාහි?",
   "context": "දදාතු, දදන්තු. දදාහි<sup class=\"sn-mark sn-cur\">[1]</sup>, දදාථ. දදාමි, දදාම. දදතං, දදන්තං. දදස්සු, දදව්හො. දදෙ, දදාමසෙ. දජ්ජතු, දජ්ජන්තු ඉච්චාදි. දෙතු, දෙන්තු. දෙහි, දෙථ. දෙමි, දෙම. <strong>කම්මෙ</strong> දීයතං, දීයන්තං. දීයතු, දීයන්තු.",
   "html": "<p>දද දදාහි?</p>"
  },
  {
   "n": 3,
   "title": "ධා යන ධාතූ; ධාරණෙ, ධැරීමෙහි වැටේ; අපි පු…",
   "context": "",
   "html": "<p><strong>ධා</strong> යන ධාතූ; <strong>ධාරණෙ</strong>, ධැරීමෙහි වැටේ; <strong>අපි පුබ්බො</strong>, ධා යන ධාතු තමා අපි යන්නහු පූර්ව කොට ඇති කල; <strong>තස්ස</strong>, ඒ අපි යන්නහුගේ අකාර ලොප් වේ. <strong>උපසග්ගපරස්ස</strong>, උපසර්ගයා කෙරෙන් පර වූ; <strong>දධාතිස්ස</strong>, දධාති යන මොහුගේ; <strong>ධකාරස්ස</strong>, ධකාරයාට හකාරයෙක් වේ; <strong>ද්ව‍ෙභාවාභාවෙ</strong>, ද්වත්ත නුවූ තන්හි නිපුර්ව අප්‍රත්‍යය හට ඉකාරව නිධෙති යනු වී;</p>"
  },
  {
   "n": 4,
   "title": "අධාසි - සීහළ",
   "context": "දධාසි<sup class=\"sn-mark sn-cur\">[1]</sup>, පිදහි.",
   "html": "<p>අධාසි - සීහළ</p>"
  }
 ],
 "509": [
  {
   "n": 1,
   "title": "ඉධ, මේ සූත්‍රයෙහි; මේ උදාහරණයෙහි; මේ නිග…",
   "context": "",
   "html": "<p><strong>ඉධ</strong>, මේ සූත්‍රයෙහි; මේ උදාහරණයෙහි; මේ නිග්ගහීත වූ ප්‍රස්තාවයෙහි; <strong>සංයොගන්තත්තා</strong>, සංයොගයා අන්ත කොට ඇති හෙයින් වෘද්ධි නොවේ- සංයෝග වූ ධාතුහු අන්තකොට ඇතිහෙයින් වෘද්ධි නොවේ සේයි; වෘද්ධි නොවන ස්වර ඇති ධාතු හට ධාතු සංයොග යම අන්ත වුව මැනව; ධාතු තමා ස්වර භාවයෙන්ම සංයොග නො වත් කෙසේ සංයෝග වූ නියාය යන චොදනාවට පරිහාර &quot; තදා ගමස්ස&quot; යනාදීන් කී, <strong>තදාගමස්ස</strong>, ඒ ධාතු හට වු ආගමයා ඔහු නිසා ඔහු කෙරෙන් පර වූ ආගමයා තදාගම නම් වෙයි. ඒ ධාතුහු කෙරෙන් පර වූ ආගමයා; <strong>තග්ගහණෙන</strong>, ඒ ධාතුහුගේ ගැන්මෙන් ඒ ධාතු ග්‍රහණයෙන්; <strong>ගහණතො</strong>, ගන්නා ලද හෙයින් - සංයොගයා අන්ත කොට ඇත්තේ නම් වුයේ ධාතු නිසා වූ ආගමයා ධාතුහු නම් වෙයි. එහෙයින් නිග්ගහීතයාත් ධාතු නම්ව වෙයි සේයි;</p>"
  },
  {
   "n": 2,
   "title": "(ni + rudh + ya.) ceases; di",
   "context": "<strong>කම්මෙ</strong> නිපුබ්බො යප්පච්චයස්ස ‘‘තස්ස චවග්ග’’ඉච්චාදිනා සධාත්වන්තස්ස ඣකාරෙ කතෙ ‘‘වග්ගෙ ඝොසා’’තිආදිනා ද්විත්තං, මග්ගො නිරුජ්ඣතෙ<sup class=\"sn-mark sn-cur\">[1]</sup> තෙන, නිරුජ්ඣන්තෙ. <strong>පරස්සපදත්තෙ</strong> නිරුජ්ඣති, නිරුජ්ඣන්ති. නිරුජ්ඣසි, නිරුජ්ඣථ. නිරුජ්ඣාමි, නිරුජ්ඣාම.",
   "html": "<p>(ni + rudh + ya.) ceases; dissolves; vanishes.To cease, perish, be destroyed or annihilated (/əˈnaɪəleɪt/ Verb Forms ​annihilate somebody/something/yourself to destroy somebody/something/yourself completely ) Sinhala 1ක්‍රි (d. භු රුධි, ආවරණෙ, වැසීමෙහි + ති) නිරුද්ධවෙයි. Sinhala 2(නි+රුධ+ය) නැති වේ; නිරුද්ධ වේ; විනාශ වේ.</p>"
  },
  {
   "n": 3,
   "title": "අරුන්ධි - ම.ඡ.ස.",
   "context": "රුන්ධි, රුන්ධිංසු. අරුන්ධිත්ථ<sup class=\"sn-mark sn-cur\">[1]</sup>, (නිරුජ්ඣිත්ථ. නිරුජ්ඣි, නිරුජ්ඣිංසු. -කම්ම)",
   "html": "<p>අරුන්ධි - ම.ඡ.ස.</p>"
  },
  {
   "n": 4,
   "title": "ඡිදි යන ධාතු; ද්වෙධාකරණ‍ෙ, දෙකක් කිරීමෙහ…",
   "context": "",
   "html": "<p><strong>ඡිදි</strong> යන ධාතු; <strong>ද්වෙධාකරණ‍ෙ</strong>, දෙකක් කිරීමෙහි වැටේ; <strong>ඡිජ්ජති</strong> යනාදි පරස්සපදාදෙසයි. <strong>ජිජ්ජතු</strong> යනු පරස්ස පදාදෙසයි. <strong>ඡිජ්ජෙය්‍ය</strong> යනු පරස්ස පදාදෙසයි - පරස්සපදාදෙශත්වයෙන් දැක්වූ කල කර්ම කොට දැක්වූ නියා මැයි. <strong>ඡින්දි</strong> යනාදි අජ්ජතනියි. ඡිද යන ධාතුහුගේ ඉකාරය හට මහා වෘත්තින් එකාරව &quot; අකාරාගමො &quot; යනාදි සූත්‍රයෙන් අකාරාගමව &quot; වග්ගෙ ඝොසා &quot; යනාදි සූත්‍රයෙන් ද්විත්ව අත්තනොපද පඨම පුරිස එක වචනය හට මහා වෘත්තින් ඉකාරව හෝ පරස්ස පදා දෙසව හෝ <strong>අච්ඡෙජ්ජි</strong> යනු වී. අත්තනො පද පඨමපුරිස එක වචනය හට ත්ථව <strong>ඡිජ්ජිත්ථ</strong> යනු වී. අත්තනොපද පඨම පුරිස එකවචන පරස්ස පද පඨම පුරිස එක වචන ඊකාර බවට පැමිණ හ්‍රස්ව ව <strong>ඡිජ්ජි</strong> යනු වී. ඉකාරාගමව <strong>ඡෙච්ඡිති</strong> වා යනු වී,</p>"
  }
 ],
 "511": [
  {
   "n": 1,
   "title": "රූ.සි.481",
   "context": "<strong>නහ</strong> බන්ධනෙ, ‘‘හ විපරියයො’’ති<sup class=\"sn-mark sn-cur\">[1]</sup> යොගවිභාගෙන විපරියයො. සන්නය්හති, සන්නය්හන්ති ඉච්චාදි.",
   "html": "<p>රූ.සි.481</p>"
  },
  {
   "n": 2,
   "title": "දාදානෙ. පුරිසො දානං දායති. ආ",
   "context": "<strong>දා</strong> දානෙ<sup class=\"sn-mark sn-cur\">[1]</sup>, <strong>සංආ</strong>පුබ්බො ‘‘ක්වචි ධාතූ’’තිආදිනා <strong>ය</strong>ම්හි ධාත්වන්තස්ස <strong>ඉ</strong>කාරො, සීලං සමාදියති, සමාදියන්ති ඉච්චාදි.",
   "html": "<p>දාදානෙ. පුරිසො දානං දායති. ආපුබ්බො ගහණෙ. අදින්නං ආදියති. සීලං සමාදියති. (සද්දනීති) (දා ආදානෙ - ම.ඡ.ස.)</p>"
  }
 ],
 "512": [
  {
   "n": 1,
   "title": "අජ්ජතනි පරස්සපද මජ්ඣිමපුරිස එක වචනයාට මහ…",
   "context": "",
   "html": "<p>අජ්ජතනි පරස්සපද මජ්ඣිමපුරිස එක වචනයාට මහා වෘත්තීන් ඉකාරාදෙසව <strong>අසුණි</strong> යනු වී. <strong>අසුණිත්ථ</strong> යනාදි ආහට ත්ථවූ තැනි; වෘද්ධි නොව <strong>අස්සුම්හ</strong> යි කියා හෝ වේ; <strong>අස්සොසිත්ථ</strong> යනු කර්තෘ විෂයෙහි ආහට ත්ථ වූ තැනි; <strong>අසූයිත්ථ</strong> ඔහට කර්ම විෂයෙහි ත්ථ වූ තැනි. <strong>අසූයී</strong> යනු ඔහට පරස්සපදාදෙස වූ තැනි.</p>"
  },
  {
   "n": 2,
   "title": "හි යන ධාතු - ගතිම්හි, යාමෙහි වැටේ. ණකාරස…",
   "context": "",
   "html": "<p><strong>හි</strong> යන ධාතු - <strong>ගතිම්හි</strong>, යාමෙහි වැටේ. ණකාරස්ථ ආකාරය හට හ්‍රස්ව ව <strong>පහිණති</strong> කියා හෝ වේ. <strong>පහිණි පාහෙසි</strong> යනු අජ්ජතනීයි.</p>"
  },
  {
   "n": 3,
   "title": "පරං වා අතිවිය සීලාදිගුණගණං අ",
   "context": "<strong>මි</strong> පක්ඛෙපෙ, ‘‘ක්වචි ධාතූ’’තිආදිනා <strong>ණ</strong>ස්ස <strong>න</strong>ත්තං, මිනොති<sup class=\"sn-mark sn-cur\">[1]</sup>, මිනන්ති ඉච්චාදි.",
   "html": "<p>පරං වා අතිවිය සීලාදිගුණගණං අත්තනො සන්තානෙ මිනොති පක්ඛිපති, (චරියාපි.අ.) (බහාලයි = පක්ඛෙප)</p>"
  }
 ],
 "513": [
  {
   "n": 1,
   "title": "යනු විධි සූත්‍රයි. - කියාදිතො ය, නා ය යන…",
   "context": "",
   "html": "<p>යනු විධි සූත්‍රයි. - <strong>කියාදිතො</strong> ය, <strong>නා</strong> ය යනු පදයි.</p>"
  },
  {
   "n": 2,
   "title": "කියාදිතො, කී ආදි ධාතු ගණයා කෙරෙන්; පරො…",
   "context": "",
   "html": "<p><strong>කියාදිතො,</strong> කී ආදි ධාතු ගණයා කෙරෙන්; <strong>පරො</strong>, පරව, <strong>කත්තරි</strong>, කතෘකාරකයෙහි; <strong>නාප්පච්චයො</strong>, ණාප්‍රත්‍ය වේ.</p>"
  }
 ],
 "514": [
  {
   "n": 1,
   "title": "ඉධ, මේ සූත්‍රයෙහි; (නාම්හි, නාවිකරණයා පර…",
   "context": "",
   "html": "<p><strong>ඉධ</strong>, මේ සූත්‍රයෙහි; (<strong>නාම්හි</strong>, නාවිකරණයා පරකල්හි; <strong>ජාදෙසො</strong>, ජා තෙම ආදෙශ වේ;)( <strong>ඤාම්හි</strong>, ඤා යන ආදෙශයා පර කල්හි; <strong>ජං</strong>, ජං තෙම ආදෙශ වේ;) (<strong>නාභාවො</strong>, නා යන ආදෙශ තෙම; <strong>තිම්හි එව</strong>, තිප්‍රත්‍යයා පරකල්හිම වේ.) මෙසේ නියත කොට කීයේ කුමක් පිණිසදයත්? <strong>වවත්ථිතවිභාසත්තා</strong>, ව්‍යවස්ථිතය වර්තමාන නිශ්චිත වූ විකල්පය අර්ථ කොට ඇති; <strong>වාසද්දානුවත්තනා</strong>, වා ශබ්දයා වැටුණු හෙයින් වැටුණු බව ඇති හෙයිනි.</p>"
  },
  {
   "n": 2,
   "title": "රූ.සි.516",
   "context": "ඤා-හට නා-යන ආදෙශව නා යන ආදෙශයා කෙරෙන් පර වූ විකරණයාට “නාස්ස ලොපො යකාරත්තං”<sup class=\"sn-mark sn-cur\">[1]</sup> යන සූත්‍රයෙන් යකාරව <strong>විනායති</strong> යනු වී.",
   "html": "<p>රූ.සි.516</p>"
  },
  {
   "n": 3,
   "title": "ඤා-හට නා-යන ආදෙශව නා යන ආදෙශයා කෙරෙන් පර…",
   "context": "",
   "html": "<p>ඤා-හට නා-යන ආදෙශව නා යන ආදෙශයා කෙරෙන් පර වූ විකරණයාට “නාස්ස ලොපො යකාරත්තං”<sup class=\"sn-mark sn-cur\">[1]</sup> යන සූත්‍රයෙන් යකාරව <strong>විනායති</strong> යනු වී.</p>"
  }
 ],
 "516": [
  {
   "n": 1,
   "title": "එය්‍යාම හට මහාවෘත්තින් එමු යන ආදෙශව විජා…",
   "context": "",
   "html": "<p>එය්‍යාම හට මහාවෘත්තින් එමු යන ආදෙශව <strong>විජානෙමු</strong> යනු වී. <strong>විඤ්ඤායෙය්‍ය</strong> යනාදි පරස්සපදාදෙසයි.</p>"
  },
  {
   "n": 2,
   "title": "සමජානි, සං අ පූර්ව වූ අජ්ජතනියි. නාස්ස ය…",
   "context": "",
   "html": "<p><strong>සමජානි</strong>, සං අ පූර්ව වූ අජ්ජතනියි. නාස්ස යනාදි සූත්‍රයෙන් නාහට ලොප්කළ කල්හි ද්විත්තව සකාරාගමව අජ්ජතනිව <strong>අඤ්ඤාසි</strong> යනු වී. කර්තෘ විෂයෙහි අත්තනොපද ආ හට ත්ථ ව <strong>විජානිත්ථ</strong> යනු වී; <strong>ඤායිත්ථ</strong> කර්ම විෂයෙහි ත්ථ වූ තැන නියායි;</p>"
  }
 ],
 "518": [
  {
   "n": 1,
   "title": "අථ වා ගීයන්ති ගණ්හීයන්ති උග්",
   "context": "<strong>ගණ්හීයති</strong><sup class=\"sn-mark sn-cur\">[1]</sup>",
   "html": "<p>අථ වා ගීයන්ති ගණ්හීයන්ති උග්ගණ්හීයන්ති ¶ ධාරීයන්ති උපධාරීයන්ති උපලක්ඛීයන්ති ගධිතපටිලාභාය (මහානිද්දෙස)</p>"
  }
 ],
 "522": [
  {
   "n": 1,
   "title": "යකාර ද්විත්තව කරිය්‍යති යනු හෝ වේ; සධාත්…",
   "context": "",
   "html": "<p>යකාර ද්විත්තව <strong>කරිය්‍යති</strong> යනු හෝ වේ; <strong>සධාත්වන්තස්ස</strong>, ධාත්වන්තයා සහිත වූ යකාරයාට; <strong>යකාරත්තං</strong>, යකාර බව වේ; <strong>රයකාරානං</strong>, රකාර යකාරයන් සම්බන්ධව; <strong>විපරියයො</strong>, උඩුයටියා බව වේ; කරීයති කියා තුබූ තන්හි යකාර විපරීතව <strong>කයිරති</strong> යනු හෝ වේ.</p>"
  }
 ],
 "527": [
  {
   "n": 1,
   "title": "(යනු වෘද්ධි විධාන සූත්‍රයි. අසංයොගන්තිස්…",
   "context": "",
   "html": "<p>(යනු වෘද්ධි විධාන සූත්‍රයි. අසංයොගන්තිස්ස යනු, අ, පු, ස, ෂ, එ, වචනයි. වුද්ධි යනු, ඉ, ඉ, කි, ප්‍ර, එ, වචනයි. කාරිතෙ යනු, අ, පු,කි,ස, එ, වචනයි. මෙසේ මෙහි පද තුණකි.</p>"
  },
  {
   "n": 2,
   "title": "කාරිතෙ, කාරිත ප්‍රත්‍යයය පරකල්හි; අසංයොග…",
   "context": "",
   "html": "<p>කාරිතෙ, කාරිත ප්‍රත්‍යයය පරකල්හි; අසංයොගන්තස්ස, සංයොගාන්ත නො වූ ධාතුහුගේ ස්වරයට; වුද්දි, වෘද්ධි වේ.)</p>"
  },
  {
   "n": 3,
   "title": "රූ.සි. 542",
   "context": "<strong>ගණ</strong> සඞ්ඛ්‍යානෙ, ‘‘ඝටාදීනං වා’’ති<sup class=\"sn-mark sn-cur\">[1]</sup> න වුද්ධි, ගණෙති, ගණයති ඉච්චාදි, සබ්බත්ථ සුබොධං.",
   "html": "<p>රූ.සි. 542</p>"
  },
  {
   "n": 4,
   "title": "නිසාමන - එකච්චෙසු සීහළපොත්ථක",
   "context": "√<strong>තිජ</strong> නිසාන<sup class=\"sn-mark sn-cur\">[1]</sup>බන්ධනඛමාසු, ධාතුසඤ්ඤාදි.",
   "html": "<p>නිසාමන - එකච්චෙසු සීහළපොත්ථකෙසු</p>"
  },
  {
   "n": 5,
   "title": "නිසාමනං ඔලොකනං සවනඤ්ච වුච්චත",
   "context": "<strong>√තිජ</strong> යනු; <strong>නිසාමනෙ</strong><sup class=\"sn-mark sn-cur\">[1]</sup>, බැලීමෙහිද; <strong>බන්ධනෙ</strong>, බැඳීමෙහිද; <strong>ඛමනෙ</strong>, ක්ෂමායෙහි ද වැටේ.",
   "html": "<p>නිසාමනං ඔලොකනං සවනඤ්ච වුච්චති. (සද්.නී.) √තිජ නිසානෙ, ඛමායඤ්ච. නිසානං තික්ඛතාකරණං. ඛමා ඛන්ති. (සද්.නී.)</p>"
  }
 ],
 "530": [
  {
   "n": 1,
   "title": "රූ.සි. 487 ලොපඤ්චෙත්ථ",
   "context": "<strong>ඛ</strong>ප්පච්චයාභාවෙ <strong>අ</strong>ප්පච්චයස්ස <strong>එ</strong>කාරො<sup class=\"sn-mark sn-cur\">[1]</sup>, තෙජෙති, තෙජති වා, තෙජන්ති ඉච්චාදි.",
   "html": "<p>රූ.සි. 487 ලොපඤ්චෙත්ථ</p>"
  }
 ],
 "531": [
  {
   "n": 1,
   "title": "ග්-උ →ඉ ගුප් + ඡ +ති = උකාරයට ඉකාරය (463…",
   "context": "",
   "html": "<p>ග්-උ →ඉ ගුප් + ඡ +ති = උකාරයට ඉකාරය (463)</p>"
  }
 ],
 "533": [
  {
   "n": 1,
   "title": "වාස්ස ඊ",
   "context": "ව්-ආ&gt;ඊ මං + ස + ති = අබ්භාසගත “වා”හි අවර්ණයට ඊ-ආදේශය<sup class=\"sn-mark sn-cur\">[1]</sup> (463)",
   "html": "<p>වාස්ස ඊ</p>"
  },
  {
   "n": 2,
   "title": "ව්-ආ&gt;ඊ මං + ස + ති = අබ්භාසගත “වා”හි…",
   "context": "",
   "html": "<p>ව්-ආ&gt;ඊ මං + ස + ති = අබ්භාසගත “වා”හි අවර්ණයට ඊ-ආදේශය<sup class=\"sn-mark sn-cur\">[1]</sup> (463)</p>"
  }
 ],
 "534": [
  {
   "n": 1,
   "title": "√ඝස යනු; අදනෙ, කෑමෙහි වැටේ…",
   "context": "",
   "html": "<p><strong>√ඝස</strong> යනු; <strong>අදනෙ</strong>, කෑමෙහි වැටේ.</p>"
  }
 ],
 "535": [
  {
   "n": 1,
   "title": "ක්වචාදිමජ්ඣුත්තරානං ???",
   "context": "ගී→ජී→ජි ගී + ස + ති = ක-වග ට ච-වග වීම හා හ්‍රස්ව වීම<sup class=\"sn-mark sn-cur\">[1]</sup> (467, 354)",
   "html": "<p>ක්වචාදිමජ්ඣුත්තරානං ???</p>"
  },
  {
   "n": 2,
   "title": "ක්වචාදිමජ්ඣුත්තරානං ???",
   "context": "වි +ගී→ජී→ජි ගී + ස + ති = ක-වග ට ච-වග වීම හා හ්‍රස්ව වීම<sup class=\"sn-mark sn-cur\">[1]</sup> (467, 354)",
   "html": "<p>ක්වචාදිමජ්ඣුත්තරානං ???</p>"
  },
  {
   "n": 3,
   "title": "සු පූර්ව වූ සු යන ධාතු සු යී කියා තිබෙයි…",
   "context": "",
   "html": "<p>සු පූර්ව වූ සු යන ධාතු සු යී කියා තිබෙයි;</p>"
  },
  {
   "n": 4,
   "title": "ප්-ආ&gt;අ&gt;ඉ වාසති = හ්‍රස්වය-අබ්භාස අ…",
   "context": "",
   "html": "<p>ප්-ආ&gt;අ&gt;ඉ වාසති = හ්‍රස්වය-අබ්භාස අන්ත අවර්ණයට ඉ-ආදේශය (463)</p>"
  },
  {
   "n": 5,
   "title": "ක්වචාදිමජ්ඣුත්තරානං ???",
   "context": "වි+ගී&gt;ජී&gt;ජි ගී + ස + ති = ක-වග ට ච-වග වීම හා හ්‍රස්ව වීම<sup class=\"sn-mark sn-cur\">[1]</sup> (467, 354)",
   "html": "<p>ක්වචාදිමජ්ඣුත්තරානං ???</p>"
  },
  {
   "n": 6,
   "title": "විජෙතුමිච්ඡති යන අර්ථයෙහි…",
   "context": "",
   "html": "<p><strong>විජෙතුමිච්ඡති</strong> යන අර්ථයෙහි;</p>"
  }
 ],
 "538": [
  {
   "n": 1,
   "title": "විනයං - සීහළසන්න",
   "context": "<strong>වීරියං</strong><sup class=\"sn-mark sn-cur\">[1]</sup><strong>,</strong> දැඩි කොට කෙරෙයි යන අර්ථයෙහි.",
   "html": "<p>විනයං - සීහළසන්න</p>"
  }
 ],
 "540": [
  {
   "n": 1,
   "title": "වගුව",
   "context": "",
   "html": "<div class=\"table-responsive\"><table class=\"data-table\"><tr><td></td><td>අකාරිත</td><td>කාරිත</td></tr><tr><td>අකම්මක ධාතු</td><td>පුත්තො සයති</td><td>මාතා පුත්තං සයාපෙති</td></tr><tr><td>සකම්මක</td><td>දාසො රුක්ඛං ඡින්දති</td><td>සාමි දාසං රුක්ඛං ඡෙදාපෙති</td></tr><tr><td>ද්විකම්මක</td><td>යාචකපුත්තො පුරිසං භත්තං යාචති</td><td>යාචකො යාචකපුත්තං පුරිසං භත්තං යාචාපෙති</td></tr></table></div>"
  },
  {
   "n": 2,
   "title": "ගතිබෝධාන්නසද්දත්ථහරකරාකම්මකා",
   "context": "<strong>තස්මා</strong>, එහෙයින් අකර්ම ධාතූන් සකර්මක ධාතූන් ද්විකර්මක ධාතූන් ත්‍රි කර්මක වන හෙයින්; <strong>කාරිතෙ</strong>; කාරිතප්‍රත්‍යයා හා යොගයක් ඇති කල්හි; <strong>කත්තරි කම්මෙච</strong>, කර්තෘ කර්ම දෙක්හිම රූප; <strong>ආඛ්‍යාත සම්භවො</strong>, ආඛ්‍යාත විභක්තීන්ගේ සම්භව වන්නේයි; <strong>භාවෙ න</strong>, කාරිතප්‍රත්‍යයාගේ යොගයෙහි භාවයෙහිලා ආඛ්‍යාත විභක්තීන්ගේ සම්භවය නොවේ; <strong>කාරිතෙ</strong>, කාරිත ප්‍රත්‍යයා කළ කල්හි; <strong>සුද්ධකත්තා ච</strong>, සුද්ධ කර්තෘ ද පෙර සිටි සුද්ධ කර්තෘම; <strong>කම්මසඤ්ඤිතො</strong>, කර්ම සංඥා වන්නේයි.<sup class=\"sn-mark sn-cur\">[1]</sup>",
   "html": "<p>ගතිබෝධාන්නසද්දත්ථහරකරාකම්මකානං, කත්තා අකාරිතේ යෝ තං වුත්තකම්මං හි කාරිතේ. (බාලාවතාර)</p>"
  },
  {
   "n": 3,
   "title": "වගුව",
   "context": "",
   "html": "<div class=\"table-responsive\"><table class=\"data-table\"><tr><td>කාරිත ප්‍රත්‍ය හා කාරක</td></tr><tr><td></td><td>කත්තුකාරක</td><td>කම්මකාරක</td></tr><tr><td>අකාරිත</td><td>දාසො භාරං හරති</td><td>දාසෙන භාරො හරීයතෙ</td></tr><tr><td>කාරිත</td><td>සාමි දාසං/දාසෙන භාරං හාරාපෙති</td><td>සාමිනා දාසො භාරං හාරාපීයතෙ</td></tr></table></div>"
  },
  {
   "n": 4,
   "title": "වගුව",
   "context": "",
   "html": "<div class=\"table-responsive\"><table class=\"data-table\"><tr><td>කාරිත ප්‍රත්‍ය හා කාරක</td></tr><tr><td></td><td>කත්තුකාරක</td><td>කම්මකාරක</td></tr><tr><td>අකාරිත</td><td>දාසො භාරං ගාමං හරති</td><td>දාසෙන භාරො ගාමං හරීයතෙ</td></tr><tr><td>කාරිත</td><td>සාමි දාසං/දාසෙන භාරං ගාමං හාරාපෙති</td><td>සාමිනා දාසො භාරං ගාමං හාරාපීයතෙ</td></tr></table></div>"
  },
  {
   "n": 5,
   "title": "දාසො ගාමං ගච්ඡති (ශුද්ධකර්තෘ ප්‍රයෝගය) (…",
   "context": "",
   "html": "<p><strong>දාසො ගාමං ගච්ඡති (ශුද්ධකර්තෘ ප්‍රයෝගය) (කර්තෘකා.)</strong></p>"
  },
  {
   "n": 6,
   "title": "සාමි දාසං /දාසෙන ගාමං ගමයති (කාරිත ප්‍රය…",
   "context": "",
   "html": "<p><strong>සාමි දාසං /දාසෙන ගාමං ගමයති (කාරිත ප්‍රයෝගය) (කර්තෘකා.)</strong></p>"
  },
  {
   "n": 7,
   "title": "සාමිනා දාසො ගාමං ගච්ඡාපීයතෙ (කාරිත ප්‍රය…",
   "context": "",
   "html": "<p><strong>සාමිනා දාසො ගාමං ගච්ඡාපීයතෙ (කාරිත ප්‍රයෝගය) (කර්මකා.)</strong></p>"
  },
  {
   "n": 8,
   "title": "අප්පධානං දුහාදීනං න්‍යාදීනන්",
   "context": "කාරිතෙ සුද්ධකත්තා ච, කම්මමාඛ්‍යාතගොචරන්ති.<sup class=\"sn-mark sn-cur\">[1]</sup>",
   "html": "<p>අප්පධානං දුහාදීනං න්‍යාදීනන්තු පධානකං, කම්මං කම්මේස්වනේකේසු වුත්තකම්මන්ති වුච්චති. දුහ යාච රුධි පුච්ඡ භික්ඛ සාසු වචාදයෝ, නී වහ හරාදයෝ ච උභයේතේ ද්විකම්මකා. (බාලාවතාර)</p>"
  },
  {
   "n": 9,
   "title": "01 දුහාදී ගණය - අප්‍රධාන කර්මය උක්ත වේ…",
   "context": "",
   "html": "<p><strong>01 දුහාදී ගණය - අප්‍රධාන කර්මය උක්ත වේ</strong></p>"
  },
  {
   "n": 10,
   "title": "ගොපාලො ගාවිං ඛීරං දුහති (කර්තෘකාරක)…",
   "context": "",
   "html": "<p>ගොපාලො ගාවිං <strong>ඛීරං</strong> දුහති (කර්තෘකාරක)</p>"
  },
  {
   "n": 11,
   "title": "ගොපල්ලා දෙනගෙන් කිරි දොවයි…",
   "context": "",
   "html": "<p>ගොපල්ලා දෙනගෙන් කිරි දොවයි.</p>"
  },
  {
   "n": 12,
   "title": "ගොපාලෙන ගො ඛීරං දුය්හතෙ (කර්මකාරක)…",
   "context": "",
   "html": "<p>ගොපාලෙන ගො <strong>ඛීරං</strong> දුය්හතෙ (කර්මකාරක)</p>"
  },
  {
   "n": 13,
   "title": "ගොපල්ලා විසින් ගවදෙන කිරි දොවනු ලැබේ…",
   "context": "",
   "html": "<p>ගොපල්ලා විසින් ගවදෙන කිරි දොවනු ලැබේ.</p>"
  },
  {
   "n": 14,
   "title": "02 නී-ආදී ගණය - ප්‍රධාන කර්මය උක්ත වේ…",
   "context": "",
   "html": "<p><strong>02 නී-ආදී ගණය - ප්‍රධාන කර්මය උක්ත වේ</strong></p>"
  },
  {
   "n": 15,
   "title": "දාසො භාරං ගාමං නෙති (කර්තෘකාරක)…",
   "context": "",
   "html": "<p>දාසො <strong>භාරං</strong> ගාමං නෙති (කර්තෘකාරක)</p>"
  },
  {
   "n": 16,
   "title": "දාසයා බර ගමට ගෙනයයි…",
   "context": "",
   "html": "<p>දාසයා බර ගමට ගෙනයයි</p>"
  },
  {
   "n": 17,
   "title": "දාසෙන භාරො ගාමං නීයතෙ (කර්මකාරක)…",
   "context": "",
   "html": "<p>දාසෙන <strong>භාරො</strong> ගාමං නීයතෙ (කර්මකාරක)</p>"
  },
  {
   "n": 18,
   "title": "දාසයා විසින් බර ගමට ගෙනයනු ලැබේ…",
   "context": "",
   "html": "<p>දාසයා විසින් බර ගමට ගෙනයනු ලැබේ.</p>"
  },
  {
   "n": 19,
   "title": "වාවයි කියා - මුද්දිතපොත්ථකෙ",
   "context": "<strong>තත්ථ</strong>, ඒ සූත්‍රයෙහි ප්‍රත්‍යයන් වන ක්‍රම කියනු ලැබේ; <strong>යො කොචි</strong>, යම් කිසිවෙක්; <strong>භවති</strong>, වේද; <strong>තං</strong>, ඔහු ඒ ශුද්ධ කර්තෘහු; <strong>අඤ්ඤො</strong>, අනිකෙක් තෙම හෙතු කර්තෘ තෙම; <strong>භවාහි භවාහි</strong>, වෙවයි කියා;<sup class=\"sn-mark sn-cur\">[1]</sup> <strong>ඉච්චෙවං බ්‍රවීති</strong>, ශුද්ධ කතෘහට මේ උක්ත ප්‍රකාරයෙන් කියාද යන මෙ අර්ථයෙහි හෝ ණෙ ණයාදි ප්‍රත්‍යයෝ වෙත්; <strong>අථවා</strong>, නො හොත්; <strong>භවන්තං</strong>, වෙන්නහු; <strong>භවන්තං</strong>, සේ; <strong>භවිතුං</strong>, සේයි වන්නාට; <strong>සමත්ථං</strong>, සමර්ථයා; <strong>පයොජයති</strong>, මෙහෙයයි යන අර්ථයෙහි හෝ භවිතුං පයොජියතීති, යන අර්ථයෙහි හෝ; භවිතුං යන්නට සමර්ථ ඇත්තහු; <strong>පයොජයති</strong>, යොදයි යන මේ අර්ථයෙහි හෝ වේ; භවිතුං සමත්ථං යන වාක්‍යය එක්කොට භවිතුං යි කීහු; භවන්තං යනාදි කිතක වාක්‍යය හඟවන පිණිස අථවා යනු කීහු.",
   "html": "<p>වාවයි කියා - මුද්දිතපොත්ථකෙ</p>"
  }
 ],
 "541": [
  {
   "n": 1,
   "title": "ඔදනං - ම.ඡ.ස.",
   "context": "<strong>කම්මෙ</strong> සො ඔදනො<sup class=\"sn-mark sn-cur\">[1]</sup> පාචීයති තෙන, පාචයීයති, පාචාපීයති, පාචාපයීයති.",
   "html": "<p>ඔදනං - ම.ඡ.ස.</p>"
  }
 ],
 "544": [
  {
   "n": 1,
   "title": "වගුව",
   "context": "",
   "html": "<div class=\"table-responsive\"><table class=\"data-table\"><tr><td>ධාතුව</td><td>අකාරිත පද</td><td>කාරිත පද</td></tr><tr><td>√රුධි ආවරණෙ</td><td>රුන්ධති = වළකයි</td><td>රොධෙති = වළක්වයි</td></tr><tr><td>√ඡිදි ද්වෙධාකරණ</td><td>ඡින්දති = කපයි / සිඳියි</td><td>ඡෙදෙති = කපවයි</td></tr><tr><td>√යුජ යොගෙ</td><td>යුඤ්ජති = යෙදෙයි</td><td>යොජෙති = යොදයි</td></tr><tr><td>√භුජ පාලන-භ්‍යවහරණෙසු</td><td>භුඤ්ජති = කයි</td><td>භොජෙති = කවයි</td></tr><tr><td>√මුච මොචනෙ</td><td>මුඤ්චති = මිදෙයි</td><td>මොචෙති = මුදයි</td></tr></table></div>"
  },
  {
   "n": 2,
   "title": "වගුව",
   "context": "",
   "html": "<div class=\"table-responsive\"><table class=\"data-table\"><tr><td>ධාතුව</td><td>අකාරිත පද</td><td>කාරිත පද</td></tr><tr><td>√දිවු කීළායං</td><td>දිබ්බති = ක්‍රීඩා කරයි</td><td>දෙවෙති = ක්‍රීඩා කරවයි</td></tr><tr><td>√පද ගතිම්හි</td><td>උප්පජ්ජති = උපදියි</td><td>උප්පාදෙති = උපදවයි</td></tr><tr><td>√බුධ බොධන</td><td>බුජ්ඣති = අවබෝධ කරයි</td><td>බොධෙති = අවබෝධ කරවයි</td></tr><tr><td>√තුස පීතිම්හි</td><td>තුස්සති = සතුටු වෙයි</td><td>තොසෙති = සතුටු කරයි</td></tr><tr><td>√සම සමෙ</td><td>සම්මති = සන්සිඳෙයි</td><td>සමෙති = සන්සිඳුවයි</td></tr><tr><td>√කුප කොපෙ</td><td>කුප්පති = කිපෙයි</td><td>කොපෙති = කෝප කරවයි</td></tr><tr><td>√ජන ජනනෙ</td><td>ජායති = උපදියි, බිහිවෙයි</td><td>ජනෙති = උපදවයි, බිහි කරයි</td></tr></table></div>"
  },
  {
   "n": 3,
   "title": "රූ.සි.572",
   "context": "<strong>ධාතුප්පච්චයතො චාපි</strong>, ධාතු ප්‍රත්‍යයන් කෙරෙන් පරවද; <strong>කාරිතප්පච්චයා සියුං</strong>, ණෙ ණයාදි කාරිත ප්‍රත්‍යයෝ වන්නාහු වෙත්; <strong>එත්ථ</strong>, මෙහි ධාතු ප්‍රත්‍යයන් කෙරෙන් පරව කාරිත ප්‍රත්‍යයන් විෂයෙහි; <strong>සකාරිතෙහි</strong>, කාරිත යන්නහු කෙරෙන් පර වූ; <strong>යුණ්වූනං</strong>, යු ය ණ්වු ය යන මොවුන්ට; <strong>දස්සනං</strong>, “<strong>නුදාදීහි යුණ්වූනමනානනාකානනකා සකාරිතෙහි ච</strong>”<sup class=\"sn-mark sn-cur\">[1]</sup> යන සූත්‍රයෙන් අන ය ආනන ය යන ආදෙශයන් දැක්වීම; <strong>ඤාපකං</strong>, ඤාපකයි කාරණයි දෘෂ්ටාන්තයි. සූත්‍රකාරයා විසින් ධාතු ප්‍රත්‍යයන් කෙරෙන් පරව කාරිත ප්‍රත්‍යයන් ගේ වීම සූත්‍රයෙක්හි නොදැක්වුවද කාරිත ප්‍රත්‍යයන් සහිත වූ ධාතූන් කෙරෙන් පර වූ යුය ණ්වුය යන මොවුන්ට ආනන ආනනක යන ආදෙශයන් දැක්වූ බවම ඤාපක යයි සේයි. (උදා: 1 සඤ්ඤාපෙතීති සඤ්ඤාපකො, සඤ්ජානනකො; 2 තථා දාපෙතීති දාපකො; 3 පතිට්ඨාපෙතීති පතිට්ඨාපකො, නිබ්බානං සම්පාපෙතීති නිබ්බානසම්පාපකො, කාරාපෙතීති කාරාපකො, කාරාපිකා)",
   "html": "<p>රූ.සි.572</p>"
  }
 ]
};
